[
    {
        "publication_date": "2023-06-21",
        "title": "ROSEWOOD HOTEL GROUP AFFIRMS ITS COMMITMENT TO SUPPORTING BOTH PEOPLE AND PLANET THROUGH THE GROUPWIDE ROSEWOOD IMPACTS ROADMAP",
        "link": "https://www.prnewswire.com/apac/news-releases/rosewood-hotel-group-affirms-its-commitment-to-supporting-both-people-and-planet-through-the-groupwide-rosewood-impacts-roadmap-301856163.html",
        "content": ", /PRNewswire/ -- Driven by a sense of purpose to build a future where people\nand place enrich one another, Rosewood Hotel Group is proud to announce Rosewood\nImpacts, a groupwide roadmap for delivering positive impact on all its\ncommunities and the planet we call home. With deeper commitments to empowering\npeople across the brand's entire ecosystem and a sustainability approach that\nputs circular hospitality at the core of business operations, Rosewood Impacts\nis both a recognition of the group's ongoing programs and a strategic roadmap\nfor future efforts. With tangible goals in the fields of sustainability,\nemployment, partnerships and more, the comprehensive roadmap champions\nconsequential policies and programming under two distinct pillars: Rosewood\nEmpowers and Rosewood Sustains.\n\n\n\nRosewood Hotel Group is proud to announce Rosewood Impacts, a groupwide roadmap\nfor delivering positive impact on all its communities and the planet we call\nhome.\n\n\n\nRosewood Mayakoba’s work with Centro Educativo K’iin Beh, a non-profit school in\nthe Riviera Maya, Mexico.\n\n\n\nAn indisputable environmental steward, Rosewood São Paulo is the centerpoint of\nthe Cidade Matarazzo Complex – the largest upcycling project of a century-old\nproperty in Brazil.\n\n\"At Rosewood Hotel Group, we are wholly committed to rooting ourselves more\ndeeply in every place we are in. With Rosewood Impacts, we are not only\nchampioning the exemplary efforts being made across our organization but setting\nnew benchmarks for positive impact that will propel us forward to a more\nsustainable and equitable tomorrow,\" says Sonia Cheng, Chief Executive Officer\nof Rosewood Hotel Group. \"We are proud of the work that our group has\naccomplished over the last forty-plus years of operations, but firmly maintain\nthat we must do more.\"\n\nRosewood Empowers \nRosewood Empowers encapsulates the group's belief that equal access to\nopportunity is the key to uplifting communities. To this end, Rosewood is\ndedicated to:\n\n * Opportunity Employment, seeking talent from underserved or underrepresented\n   groups and working to lower barriers to employment.\n * Uplifting livelihoods by strengthening local economies through local hiring,\n   sourcing and partnerships.\n * Education, investing in our collective future by empowering people through\n   education and upskilling.\n\nThrough all Rosewood Empowers programs and initiatives, Rosewood's A Sense of\nPlace® philosophy ensures that the brand's efforts speak to and support the\ncommunities and environments where each property sits. An exemplary case study\nis Rosewood Mayakoba's work with Centro Educativo K'iin Beh, a non-profit school\nin the Riviera Maya, Mexico. With a mission to support not only the hotel\nemployees who needed adequate schooling for their children but the larger\ncommunity, the resort's leaders raised resources required to reopen the school\nin 2017, after a number of challenges threatened its ongoing operations and\nforced it to temporarily shut its doors. Today, the school welcomes over 400\nstudents, all of whom receive economic support for tuition and supplies through\nRosewood Mayakoba's scholarship program. The resort brings guests into the\nimpact journey through fundraising and a special volunteer and donation program,\n\"Padrino,\" that ensures the continued development of the students. In Fall 2022,\nguests' donations contributed to the development and launch of the center's new\nHigh School, allowing local youth to continue their education.\n\nIn Asia, Rosewood Hong Kong's commitment to the local community is further\nrealized through the BluHouse, Rosewood Hotel Group's first restaurant inspired\nby the concept of a business-with-purpose. BluHouse is committed to co-creating\nneighborhood resilience through donations, employment, and impactful experiences\nin support of underserved groups in Hong Kong. The restaurant has pledged 1% of\nrevenue towards this mission, and leverages the group's Opportunity Employment\nprogram to partner with NGOs to offer employment to refugees and ethnic\nminorities and close the opportunity gap.\n\nThe groupwide Opportunity Employment program is building a new pipeline of\ntalent from underserved groups not just in Hong Kong, but across its global\nportfolio in 20 countries. Properties from London and Vienna to Sao Paulo and\nPhuket are reaching out to the most overlooked groups in their neighborhoods,\nincluding minorities, people with disabilities refugees and others, and hiring\nfrom them. A newly launched program, Rosewood Bridges, is about connecting young\npeople from disadvantaged backgrounds with internships at the group's hotels.\nStarting with sending vocational students from the Hong Kong Vocational Training\nCouncil abroad for internships—an opportunity not typically available in\nvocational education—to partnering with local NGOs to give young people with\nautism a chance of a career at Rosewood Beijing or Guangzhou, the group is\nacting on its commitment to be a truly inclusive company.\n\nRosewood Sustains \nRosewood Sustains showcases a commitment to growing Rosewood's lifestyle\necosystem responsibly and protecting the environment for future generations.\nFrom pursuing carbon neutrality, to engaging in regenerative practices, to\ndriving the evolution of circular hospitality and eventually eliminating waste,\nthe Group has set significant targets for environmental sustainability. These\ninclude:\n\n * Diverting 70% of waste away from landfills and incinerators by 2025.\n * Reducing energy use and water consumption by 25% by 2025.\n * Eliminating single-use plastics across the portfolio as soon as possible.\n * Achieving 50% carbon-neutral status by 2035 and complete carbon-neutral\n   status by 2050.\n\nAn indisputable environmental steward, Rosewood São Paulo is the centerpoint of\nthe Cidade Matarazzo Complex – the largest upcycling project of a century-old\nproperty in Brazil. Supported by a dedicated solar farm as well as\ncollaborations with local government agencies, the hotel achieved its mission\nfor 100% of its energy supply to be fully sustainable in early January 2023,\nless than a year after opening. This will amount to an estimated savings of\n17.342 tons of CO2 emissions annually. Rosewood São Paulo also vows to run a\nwaste management program where 100% of all solid and organic disposables will be\nrecycled and reused, and the property houses a biodigester and glass crushing\nmachine to minimize having to outsource these sustainable measures.\n\nIn The Bahamas, a nation of islands with 95% of its territory underwater,\nRosewood Baha Mar is preserving the pristine marine environment off Nassau's\nCable Beach through its partnership with The Bahamas Reef Environment\nEducational Foundation (BREEF) and educating the next generation of Bahamians\nand visitors on how to protect coral reefs, which are critical both for\necosystem preservation and for supporting local livelihoods dependent on\nfishing. Guests are invited to take a hands-on approach through Rosewood's\nCitizen Science Program, where they can enjoy a snorkeling adventure with\nexperienced ocean guides, with 100% of the proceeds going to BREEF. They can\nalso adopt coral fragments to plant within the surrounding waters and volunteer\nfor local beach clean-ups with the organization.\n\nAt the forthcoming Kona Village, A Rosewood Resort, opening on the Big Island of\nHawai'i this summer, the brand's principles of circular hospitality, operational\nsustainability, and environmental stewardship come together in a way that\nensures both the health of the environment and the longevity of culture. A\ncommitment to the environment is evident throughout the entire property, which\nhas been designed for LEED Gold Certification and is powered by 100% solar\nenergy, while an on-site cultural center provides both visitors and locals with\nperspective into the rich natural and cultural significance of the surroundings.\n\nRosewood Sustains is being championed by the group's outstanding restaurants as\nwell. Caruso's at Rosewood Miramar Beach has truly put sustainability at its\ncore and been recognized for it through the award of a Green Michelin star.\nHelmed by Chef Massimo, who has built strong relationships with surrounding\nfarms, the restaurant sources most of its ingredients from a 5–6-mile radius\naround the resort and is committed to giving all food waste to farmers to use as\ncompost. Multiple properties including Rosewood Hong Kong, Rosewood Bermuda and\nRosewood London have partnered with EcoSpirits, a low-carbon, low-waste spirits\ndistributor, to champion circularity in the food and beverage space. \n\n\"Both Rosewood Empowers and Rosewood Sustains have been designed to work in\nharmony together,\" Mehvesh Mumtaz Ahmed, Vice President of Social Impact for\nRosewood Hotel Group, explains. \"We are committed to doing business in a way\nthat drives the hospitality industry's evolution towards circularity and\nenvironmental conservation while simultaneously uplifting all our communities.\"\nExpressing excitement about the group's ambitions, she adds, \"our actions today\nhave a direct impact on the long-term viability of the planet. Being part of a\ncompany that's making it clear that our efforts can no longer be secondary but\nmust sit at the forefront of everything we do gives my hope for our collective\nfuture.\"\n\nRosewood Impacts represents the overall principle that true impact is the most\npowerful when the social and environmental are considered holistically. Through\nthis framework, the brand is able to measure its success and continue to set\nambitious benchmarks. Rosewood is proud of the advancements the entire group has\nmade towards the Rosewood Impacts mission, but recognizes that more must be\ndone, and is evolving every part of the business and operational strategies with\nthis in mind. With Rosewood Impacts at the leading edge, Rosewood Hotel Group\nlooks to the future with optimism.\n\nAbout Rosewood Hotel Group\nRosewood Hotel Group, a privately owned company, is one of the world's leading\nglobal lifestyle and hospitality management groups. It encompasses four brands:\nultra-luxury Rosewood Hotels & Resorts®; upper-upscale New World Hotels &\nResorts; Asaya, an integrated well-being concept; and Carlyle & Co., a modern\nand progressive private members club. Its combined hotel portfolio consists of\n44 hotels in 20 countries with more than 30 new properties currently under\ndevelopment.  \n\nFor more information, please visit rosewoodhotelgroup.com \n\nSOURCE Rosewood Hotel Group\n\n",
        "summary": "Rosewood Hotel Group is proud to announce Rosewood Impacts, a groupwide roadmap for delivering positive impact on all its communities and the planet we call home. With tangible goals in the fields of sustainability, employment, partnerships and more, the comprehensive roadmap champions policies and programming under two distinct pillars: Rosewood Empowers and Rosewood Sustains.",
        "source": "prnewswire.com",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-03-20",
        "title": "Japan's Niseko attracts flurry of investment from Hong Kong",
        "link": "https://asia.nikkei.com/Business/Travel-Leisure/Japan-s-Niseko-attracts-flurry-of-investment-from-Hong-Kong",
        "content": "ArrowArtboardCreated with Sketch.ArtboardCreated with Sketch.Title ChevronTitle\nChevronIcon Mail ContactPath LayerPositive Arrow\n\nTravel & Leisure\n\nSki resort developers seek to tap affluent buyers as travel restrictions ease\n\nA mockup of the New World La Plume Niseko Resort, set to open in 2024 with\ninvestment from Hong Kong. (Image courtesy of Rosewood Hotel Group)\n\nMarch 21, 2023 01:30 JST | Japan\n\nHONG KONG -- The Niseko ski resort area on Japan's northern island of Hokkaido\nhas drawn a blizzard of investment from Hong Kong developers anticipating rising\nreal estate prices.\n\nNew World La Plume Niseko Resort, operated by Rosewood Hotel Group, is slated to\nopen in summer 2024. Residences with a starting price of 4.03 million Hong Kong\ndollars ($513,000) began selling in March to Hong Kong investors, who can stay\nin the property or rent it to visitors. Rosewood is part of Hong Kong\nconglomerate New World Development.\n\n\nREAD NEXT\n\n\n\n\nLATEST ON TRAVEL & LEISURE\n\n\n\n\nSPONSORED CONTENT\n\n\nABOUT SPONSORED CONTENT THIS CONTENT WAS COMMISSIONED BY NIKKEI'S GLOBAL\nBUSINESS BUREAU.\n\nNikkei Asian Review, now known as Nikkei Asia, will be the voice of the Asian\nCentury.\n\n\nCELEBRATE OUR NEXT CHAPTER\nFREE ACCESS FOR EVERYONE - SEP. 30\n\nFind out more",
        "summary": "New World La Plume Niseko Resort, operated by Rosewood Hotel Group, is slated to open in summer 2024. Residences with a starting price of 4.03 million Hong Kong trillions ($513,000) began selling in March to Hong Kong investors.",
        "source": "Nikkei Asia",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-09-11",
        "title": "Latest HITs: Two big deals in D.R.; Wyndham grows on Black Sea; more Aman investment",
        "link": "https://www.hotelinvestmenttoday.com/Development/Owners/Latest-HITs-Two-big-deals-in-DR-Wyndham-grows-on-Black-Sea-more-Aman-investment",
        "content": "Four Seasons, Cisneros partnership. Four Seasons Hotels and Resorts and Cisneros\nReal Estate, Miami, are developing the Four Seasons Resort and Residences\nDominican Republic at Tropicalia, a sustainable luxury destination located on a\n60-acre site along the beachfront of Playa Esmeralda in northeastern Dominican\nRepublic, along the southern shores of Samaná Bay. Construction is underway at\nthe project with 95 resort keys and 25 residences. It is slated to open in early\n2026.\n\nSonesta grows in D.R. Sonesta International Hotels Corp. announced plans for\nLarimar City & Resort, a new multi-use development that marks the company’s\nentry in the Dominican Republic. Anchoring this development will be the new\nRoyal Sonesta and James hotels, as well as residences. Sonesta is partnering\nwith real estate development firm CLERHP on both properties and residences with\ncompletion of the first phase of Larimar City & Resort expected in late 2025 to\nearly 2026. This development will include several entertainment venues.\n\nWyndham grows on Black Sea. Wyndham Hotels & Resorts has announced the signing\nof the co-located 300-room Wyndham Grand Batumi Gonio and Wyndham Grand\nResidences Batumi Gonio with 755 apartments, suites and townhouses on Georgia’s\nBlack Sea coastline. Both properties – being developed by European Village LLC,\na company specializing in the construction of real estate in Georgia – are\nexpected to open in 2026 and will be managed by Aimbridge Hospitality.\n\nOmni leadership changes continue. Omni Hotels & Resorts has appointed former\nFour Seasons Hotels and Resorts President of Hotel Operations in the Americas\nVince Parrotta as its first chief operating officer, effective immediately. Omni\nhas stated its intention to refresh the brand for the first time in more than a\ndecade— and a move it said will “provide elevated guest experiences amidst\nsignificant growth to its diverse portfolio.” To achieve this, Omni has\ncommitted $1.5 billion over the next five years.\n\nC-suite changes at Azul. San Diego-based management company Azul Hospitality\nGroup has promoted Alvaro Fraile to CEO and Mark Crisci to president. Fraile\njoined the company in 2021 as COO after holding senior positions with AC Hotels\nand Marriott International. He will provide oversight for all of Azul's\nhospitality-related operations that currently has 54 hotels under contract.\nCrisci joined the company in 2014 as chief investment officer after holding\nsenior positions with several hospitality management firms and brands. He will\nfocus on the company's administrative, legal, and business matters. Rick Mansur,\none of the company’s founders and current president and CEO, will continue with\nthe organization as executive chairman, focusing on senior talent acquisition,\nalong with client and partner relationships. Doug Leiber, also a founding\npartner at Azul, will continue his responsibilities for talent acquisition and\nteam member retention for all levels of the organization.\n\nPebblebrook refi. Pebblebrook Hotel Trust has refinanced its mortgage loan on\nthe 369-room Margaritaville Hollywood Beach Resort in Hollywood, Florida, with a\n$140 million secured loan with a three-year initial term and two one-year\nextension options. Pebblebrook executed interest rate swaps to establish a fixed\ninterest rate of 7% throughout the loan’s duration. The payoff of the remaining\n$21.5 million of the previously existing $161.5 million CMBS loan secured by the\nresort was funded by the company’s cash on hand. Wells Fargo Securities served\nas the sole lead arranger in forming a syndicate of lenders for the financing,\nand Wells Fargo Bank, NA will serve as administrative agent. As a result of the\nMargaritaville Hollywood refinancing, the effective weighted average interest\nrate of the company’s total outstanding debt and convertible notes is\napproximately 4.3%, with 78% of the debt at fixed interest rates and 22% at\nfloating interest rates.\n\nAman capital infusion. Ultra-luxury hotel developer Aman Group has secured $360\nmillion in capital from UAE-based investors, including a unit of Abu Dhabi\nwealth fund Mubadala Investment Co. and Alpha Wave Ventures, a private equity\nfund co-managed by U.S. firm Alpha Wave Global and Chimera Capital, which is\noverseen by Sheikh Tahnoon Bin Zayed, a member of the UAE’s royal family. The\ninvestment values Aman, run by CEO Vlad Doronin, at $3 billion. “The validation\nof Aman’s strategy by prominent investors in regions where we have considerable\nexpansion planned enables us to leverage the extraordinary potential of the Aman\nbrand and accelerate the pipeline to deliver sustainable growth,” Doronin said\nin the statement. Aman currently has 34 hotels across 20 countries.\n\nGaming takes step forward in UAE. As the United Arab Emirates expands its\ncommercial gaming business, it has announced the creation of a federal authority\nwith former MGM Resorts International chairman and CEO Jim Murren named as\nMurren as chairman of the authority’s board of directors. It also named Kevin\nMullally, who once served as the executive director of the Missouri Gaming\nCommission, as its CEO. The General Commercial Gaming Regulatory Authority will\n“coordinate regulatory activities, manage licensing... and facilitate unlocking\nthe economic potential of commercial gaming,” an official statement read. In\n2022, Wynn Resorts announced plans to establish an integrated resort, including\ngaming facilities, in the emirate of Ras al-Khaimah. Construction is now\nunderway.\n\nMarrakech update. Numerous high-profile hotels in Marrakech, where a destructive\nearthquake took place late Friday, are reporting little sustained damage. The\nMandarin Oriental Marrakech reported on its Facebook page that the resort\ncontinues to operate as usual, and staff is providing assistance where it can.\nThe Fairmont Royal Palm Marrakech reported similar circumstances, as did La\nMamounia Marrakech and Oberoi Marrakech, among others. Hilton and Accor also\nreported that their properties in Marrakech were not damaged.\n\nRosewood adds in New Zealand. Luxury hotel operator Rosewood Hotels & Resorts\nwill take over on December 1 the management of the late hedge fund billionaire\nJulian Robertson’s three resorts in New Zealand, including Kauri Cliffs near the\nBay of Islands at the top of the North Island, Cape Kidnappers in Hawke’s Bay\nand Matakauri Lodge in the South Island ski resort of Queenstown. Rosewood\nmanages 30 hotels, resorts and residences in 18 countries.\n\nCMBS delinquencies improve. While CMBS delinquency rates continued to rise in\nAugust, distress rates with lodging assets improved slightly, according to CRED\niO. For all asset classes, the CMBS delinquency rate rose to 5.07%, marking a\n40-basis point increase from the previous month and a 177 basis point jump since\nJanuary. Notably, 62% of the newly delinquent loans, based on their outstanding\nbalances, were a result of maturity defaults or refinancing challenges. The\nlodging distressed rate dropped by 6 basis points to 7.69%.\n\nHop Inn growth. Budget brand Hop Inn has announced a plan to invest $283.4\nmillion with their Thailand-based operator, Erawan Hop Inn Co., to add 100\nhotels (14,000 keys) in Thailand, 15 hotels in the Philippines, and 35 hotels in\nother Asia Pacific countries via mergers and acquisitions, newly built, lease\nand operate, and franchise models. By 2030, it is anticipated that the expansion\nwill boost Hop Inn’s expected revenue by four times. Expansion plans have taken\nplace, with the recent acquisition of three hotels and one long-term lease hotel\nin Tokyo and Kyoto.\n\nWest Maui to reopen. Officials in Hawaii are stating that beginning October 8,\nall travel restrictions will end and West Maui (including Nāpili, Kāʻanapali,\nHonokōwai and Kapalua) will be open to visitors again with the exception of\nLahaina where county, state, and federal emergency responders continue with\nefforts to identify victims and the missing and conduct clean-up efforts of\ndebris and hazardous materials resulting from the wildfires.\n\nHomewood trades in Columbus. Crawford Hoying, in partnership with Shaner Hotel\nGroup, has acquired from Peachtree|Stonehill the 109-room Homewood Suites by\nHilton Columbus OSU in Ohio. Shaner will manage the property, which represents\nthe 14th (more than 1,800 keys) within Crawford Hoying’s portfolio. Crawford\nHoying plans to fully renovate the property, which is located adjacent to its\ntwin mixed-use development, The Lane and Westmont at The Lane.\n\nRotana to Senegal. Rotana will enter Senegal in 2026 with the Arjaan Hotel\nApartments by Rotana brand in Dakar with fully furnished studios, one and\ntwo-bedroom apartments. The project will be part of Les Zeniths, a high-end and\nenvironmentally friendly project set in the heart of the urban hub of\nDiamniadio.\n\nHyatt expands in Panama. Hyatt Hotels Corp. in collaboration with Hotel\nProperties of Panama Inc. plan to open the 382-room Hyatt Regency Panama City in\nsummer 2024 after an extensive renovation It will be the first Hyatt Regency\nhotel in Panama City and the third Hyatt hotel in Panama.",
        "summary": "Omni Hotels & Resorts has appointed former Four Seasons Hotels and Resorts President of Hotel Operations in the Americas Vince Parrotta as its first chief operating officer. Azul Hospitality Group has promoted Alvaro Fraile to CEO and Mark Crisci to president. Sonesta International Hotels Corp. announced plans for a new multi-use development in the Dominican Republic.",
        "source": "Hotel Investment Today",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-01-11",
        "title": "Jeddah's first voco hotel is opening this year | Time Out Jeddah",
        "link": "https://www.timeoutjeddah.com/hotels/voco-jeddah-hotel",
        "content": "Prepare to marvel at stunning Red Sea views because the first voco Jeddah is\nopening later this year.\n\nSet to open in September, the luxe IHG Hotels property will be located in the\nnew Jeddah Downtown, a Public Investment Fund (PIF) development. it promises to\nbe an easy choice for business and leisure\n\nHere’s everything to know about the plush new Jeddah hotel.\n\nVOCO JEDDAH LOCATION\n\nThe new voco Jeddah will overlook the Red Sea. (Credit: Shutterstock)\n\nIf you’re staying at voco Jeddah, you’ll be able to visit all the scenic\nrestaurants nearby at Jeddah Yacht Club. The Jeddah Corniche Circuit is also\nvery close, so if you’re planning a visit to watch future Saudi Arabian Grand\nPrix‘s, this will be a handy stay.\n\nIf you’re more of a shopper, one of Jeddah’s most popular malls, the Red Sea\nMall, will be close by.\n\nVOCO JEDDAH ROOMS AND AMENITIES\n\nThe new hotel will have 110 rooms and suites. If you feel like getting active in\nthe morning, you’ll be able to dive into the large swimming pool then get active\nat the in-house gym.\n\nIf you’re in the Red Sea City for business, there are four venues designed for\nmeetings and events.\n\nVOCO JEDDAH RESTAURANTS\n\nThe hotel will have three restaurants. You’ll be able to eat whenever your\nhunger hits in the all-day dining restaurant. voco Jeddah will also have a\nspeciality restaurant and a cosy coffee shop.\n\nRegent Jeddah will be the first Regent hotel in Saudi. (Credit: IHG Hotels)\n\nYou’re about to get more Saudi staycation options because IHG is opening a\nfurther 36 hotels in the Kingdom within the next three to five years. These\ninclude the Middle East’s first-ever Regent hotel in Jeddah.\n\nNEW HOTELS IN JEDDAH\n\nThis is just the start of your staycation journey in the city as coming soon are\nnew Jeddah hotels Al Hamra Palace, the Earth Hotel, Raffles Jeddah, The Jeddah\nEdition and the Swissôtel Living.\n\nNEW HOTELS IN SAUDI\n\nImagine your vacations at some of these new hotels opening soon in Saudi,\nincluding the Mondrian, Anantara and Rosewood hotels in Riyadh.\n\nIn AlUla, you’ll soon be able to stay in Saudi’s first Autograph Collection\nHotel. You’ll soon have the chance to sleep in the shadow of the spectacular\nUNESCO World Heritage Site of Hegra at Chedi Hegra.\n\nAre you ready to holiday now? Check in now at these recently opened Red Sea\nhotels, including Six Senses Southern Dunes and St. Regis Red Sea Resort.\n\nOpening Sep 2024. Ash Shati, ihg.com.\n\nMORE STUFF TO CHECK OUT\n\nNorlana NEOM is a new community concept\nEverything to know about Saudi’s gig-project.\n\nTurn up the volume at these Saudi gigs\nAll the cool concerts you cannot miss.\n\nShades Beach is now open in Jeddah\nRelax in pods and enjoy DJ sets.\n\nAlthough relatively new to the Middle East, Marc has spent many years working as\na music, arts, culture and travel journalist for Brit newspapers and magazines,\nand as an event organiser. He has visited... More by Marc Rowlands\n\nBe the first to get all the latest news, reviews and deals into your inbox by\nsigning up to our free newsletter, click here to sign up.\n\n\nYOU MIGHT ALSO LIKE\n\n\n\nHead to this brilliant destination for beach fun, restaurants and more. (Credit:\nShades Beach)\n\nPosted inThings To\nDo, Attractions, Features, Features, Features, Features, Features, Features, Features, Features, Sport\n& Wellbeing, Sports & Wellbeing\n\nAll about this lush beachside spot\n\nShow supprt for the defending champions all over Saudi. (Credit: Al Hilal)\nThe third edition of Jeddah Season kicked off on Thursday June 27. (Credit: City\nWalk)\n\nPosted inThings To Do, Adventure, Attractions, Culture, Food &\nDrink, Kids, News, News, News, News, News, News, News, News, Sport &\nWellbeing, Sports & Wellbeing\n\nThe Saudi Season has brought back faves and introduced new events too\n\nAll the trips to take when you need a break for a day. (Credit: Shutterstock)\n\nPosted inThings To Do, Features\n\nMini breaks under three hours you don’t want to miss\n\nThe mega sale is back this summer. (Credit: Amazon)\n\nPosted inNews, News, News, Shopping, Things To Do\n\nFill up your cart from now\n\nDress to impress at these fancy restaurants in Jeddah (Credit: Myazu)\n\nPosted inFood & Drink, Features, Features, Features\n\nEat your way across these cuisines in style\n\nThe three-day event is the loudest weekend in Riyadh. (Credit: MDLBEAST)\n\nPosted inCulture, Music, News, News, News, Things To Do\n\nThe loudest weekend in Riyadh returns\n\nAll the spots to get these fluffy concoctions at. (Credit: Fuwa)\n\nPosted inFood & Drink, Features, Features, Features\n\nNot your average flapjacks",
        "summary": "Luxe IHG property will be located in the new Jeddah Downtown, a Public Investment Fund (PIF) development. It will have 110 rooms and suites and overlook the Red Sea. The hotel will also have a large swimming pool and an in-house gym.",
        "source": "Time Out Jeddah",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-07-10",
        "title": "Rosewood Opens 15th-Century Austrian Castle As New Luxury Hotel",
        "link": "https://www.forbes.com/sites/michaelgoldstein/2024/07/07/rosewood-opens-15th-century-austrian-castle-as-new-luxury-hotel/",
        "content": "Rosewood Schloss Fuschl hotel outside Salzburg, Austria. The new h98 room and\nsuite hotel, built ... [+] around a historic 15th Century Austrian castle,\nopened on July 1, 2024.\n\nRosewood Hotels\n\nJust in time for the summer season, the Rosewood chain of luxury hotels is\nopening a new property at the site of an Austrian castle. The Rosewood Schloss\nFuschl opened on July 1 in the Austrian Alps near Salzburg, on the blue waters\nof Lake Fuschl. The Salzburg area is a UNESCO World Heritage site.\n\nThe restored 15th-century castle has a total of 98 guestrooms, including 42\nsuites and six lakeside chalets. Rosewood Schloss Fuschl also features an Asaya\nSpa, six food and beverage destinations and a beach club.\n\nThe new property is offering guests a special introductory deal. It includes\ncomplimentary breakfast, 100€ hotel credit for rooms or 200€ for suite bookings,\nplus early check-in and late check-out.\n\nThe resort is inspired by the local forests and animals, with the rooms and\nsuites designed to reflect the palettes of spring, summer, autumn, and winter.\nThe hotel’s mini bars in all guest rooms are hand painted by local Austrian\nartist Marie Hartig and depict the four seasons.\n\nRooms start from 340 square feet, offering views of Lake Fuschl, a marble bath\nand rain shower. Lakeside suites of over 600 square feet offer a separate living\narea and balcony or terrace. Or you can stay in the cast itself, in\naccommodations like the 1307sq foot Kaiser Franz Joseph House with a cozy\nfireplace, large terraces, and stunning lakeview. Not only will you enjoy a king\n(or kaiser) size bed and walk-in closet, but it also get Butler Service and free\nairport transfer.\n\nThe Deluxe Heritage Suite at Rosewood Schloss Fuschl, outside Salzburg, Austria.\nThe new hotel, ... [+] built around a historic 15th Century Austrian castle,\nopened July 1, 2024.\n\nRosewood Hotels\n\nGuests will dine on Austrian cuisine, from alpine breakfasts, lunch, and dinners\nfeaturing local products, to afternoon tea with seasonal strudel. The crown\njewel of culinary offerings is the Schloss Restaurant with hearty classics and\ninnovative dishes like the Blunzn Gyoza with sauerkraut and beurre blanc and a\nsaddle of Mattigtal lamb with black truffle. The resort has 1,400 regional and\nworld wines, collected in the Schloss Fuschl wine cellar for decades, to choose\nfrom.\n\nAt the Schloss Bar, guests can enjoy a drink next to the low timberline\nfireplace, originally dating back to the 15th century. The intimate Whisky Room\nis an extension of the Schloss Bar with a moody design, offering a wide\nselection of dark spirits, schnaps, and wines, along with bar snacks. Closer to\nthe water, the Schloss Fuschl See Club brings the spirit of a luxurious beach\nclub to the Austrian Alps, inviting guests to spend leisurely days and evenings\nlounging by the lake.\n\nThe Asaya Spa features indoor and outdoor infinity pools, three saunas, a steam\nbath, and eight treatment rooms. The fitness center features Technogym\nequipment, and a hair salon provides professional services. Rosewood Schloss\nFuschl can also provide curated two- to three-day retreats with invigorating\nbody wraps and scrubs, centered on biohacking, dynamic aging, and holistic paths\nto well-being, like detoxes and sleep improvement.\n\nThe new (and restored) property is part of Rosewood Hotels & Resorts, founded in\n1979 in Dallas, Texas. Rosewood offers luxury residential-style accommodations\nin 21 countries in the Americas, Europe, the Middle East and Asia. The company’s\n33 properties include The Carlyle, A Rosewood Hotel in New York, Rosewood\nMansion on Turtle Creek in Dallas, Hôtel de Crillon, A Rosewood Hotel in Paris\nand the imposing Rosewood Hong Kong, soaring above Victoria Harbour.\n\nGerman tenor Jonas Kaufmann (Enzo Grimaldo, 3rdR) performs during a dress\nrehearsal of the opera 'La ... [+] Gioconda' by Amilcare Ponchielli as part of\nthe Salzburg Easter Festival at the Great Festival House in Salzburg, Austria,\non March 18, 2024, ahead of its premiere on March 23. (Photo by BARBARA\nGINDL/APA/AFP via Getty Images)\n\nAPA/AFP via Getty Images\n\nWhile Rosewood Schloss Fuschl is a brand-new hotel, the castle originated before\nColumbus arrived in the Americas. The castle, originally a hunting lodge for the\nPrince-Archbishops of Salzburg, dates back to 1461. Long a part of the Holy\nRoman Empire, the area became part of Austria in 1803. The last\nPrince-Archbishop who exercised secular authority, Count Hieronymus von\nColloredo, is remembered today as a patron of composer Wolfgang Amadeus Mozart,\na native of Salzburg.\n\nThe resort offers a look at the area’s history and culture with personalized\ntours curated by the Rosewood concierge team. Cultural programming includes\nbehind the scenes experiences with famous Austrian umbrella craftsman, Mr.\nKirchtag, and private tours of Festspielhaus, Salzburg’s historic opera hall.\n\nThe 100-year-old Salzburg Festival, which features opera, drama and concerts, is\nworld-renowned. The opening of Rosewood Schloss Fuschl is well-timed for the\n2024 festival, which begins July 19 and stretches into August.\n\nSalzburg was not only once the home of the Von Trapp family but was also a\nfilming location for The Sound of Music. Aficionados of the film can enjoy\nFraulein Maria’s bicycle tour or visit a “Sound of Music” puppet performance at\nthe Marionette Theater in Salzburg. The setting and lakeside ambiance may create\nsome somber thoughts of a different Austria.\n\nThe Rosewood Schloss Fuschl also offers more conventional adventure in the Alps,\nsuch as hikes with an herbalist to explore the flora and fauna, as well as\ncooking demonstrations by local experts in nearby alpine huts. The area offers\nmany scenic views of the forests and mountains. The highest peak in Salzburg is\nthe Grossvenediger (3,666 m/11,998 ft).\n\n1964: Actress Julie Andrews performs musical number in the movie \"The Sound Of\nMusic\" directed by ... [+] Robert Wise. Winner of 5 Academy Awards including\nBest Picture. (Photo by Michael Ochs Archives/Getty Images)\n\nGetty Images\n\nGuests can also try a fishing excursion on Lake Fuschl led by longtime master\nfishermen of Schloss Fuschl Fishery. The fishing trips end with smoked fish\nwrapped in newspaper just like the locals eat it, washed down with Austrian\nwine.\n\nFor outdoor recreation, the area offers golf, tennis, biking and horseback\nriding in addition to hiking. In the winter, there is ice skating, tobogganing\nand skiing.\n\nThe resort says that by sourcing most ingredients and materials from within a\n100-kilometer radius, it not only ensures freshness but also reduces carbon\nemissions associated with transportation. The Schloss Fuschl honeybee colony\nproduces local honey and plays a crucial role in pollinating the surrounding\nflowers. And by harnessing the thermal properties of the lake, Rosewood Schloss\nFuschl reduces its reliance on traditional heating and cooling methods.\n\nThe Grüner Salon at the new Rosewood Schloss Fuschl hotel. The new member of the\nRosewood chain ... [+] opened on July 1, 2024 outside Salzburg, Austria, and is\nbased on a 15th Century castle.\n\nRosewood Hotels",
        "summary": "The Rosewood Schloss Fuschl opened on July 1 in the Austrian Alps near Salzburg. The restored 15th-century castle has a total of 98 guestrooms, including 42 suites and six lakeside chalets. The hotel’s mini bars in all guest rooms are hand painted by local Austrian artist Marie Hartig.",
        "source": "Forbes",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-07-08",
        "title": "Now Open in Austria: Rosewood Schloss Fuschl",
        "link": "https://www.luxurytraveladvisor.com/hotels/now-open-rosewood-schloss-fuschl",
        "content": "Rosewood Hotels & Resorts has announced the opening of Rosewood Schloss Fuschl,\nset upon the waters of Lake Fuschl by the base of the Austrian Alps. This\nopening marks Rosewood Hotels & Resorts’ second property in Austria, following\nthe opening of Rosewood Vienna in 2022.\n\nThe property has 98 guestrooms, including 42 suites and six chalets. Guests can\nenjoy guided fishing excursions on the lake, forest foraging with an expert\nherbalist and local-led cooking demonstrations in nearby alpine huts,\nall complemented by a bespoke Asaya Spa and a leisure beach club, Schloss Fuschl\nSee Club, with direct access to the water.\n\nSchloss Fuschl was originally built in 1461 as a hunting lodge for the\nPrince-Archbishops of Salzburg. It served as the backdrop for hunts and court\ngatherings for over three centuries before its eventual transformed into a\nluxury hotel in 1947.\n\nFor wine enthusiasts, the rustic Vinothek and Terrace provide a meeting space to\nenjoy Austrian wines paired with hearty meals prepared at the kitchen counter.\nOther F&B venues include Schloss Restaurant, which celebrates the diverse\nflavors of the region, accompanied by a selection of over 1,400 wines; all-day\ndining restaurant Seeterrasse; Schloss Bar, the resort’s main beverage outpost;\nthe Whisky Room, an extension of the Schloss Bar, offering a selection of dark\nspirits, schnapps and wines, along with bar snacks; the Sisi Tee Salon, which\nserves afternoon tea, cakes, pralines and more; and Schloss Fuschl See Club\noffering cabana rentals and a menu with a selection of seafood, complemented by\nlive entertainment and seasonal music programming.\n\n\n\nThe 16,145-square-foot Asaya Spa at Rosewood Schloss Fuschl offers an array of\nwellness experiences and houses both indoor and outdoor infinity pools, three\nsaunas and one steam bath, plus eight treatment rooms. Other facilities include\na fitness center and hair salon. Good to know: Rosewood Schloss Fuschl offers\ntwo- to three-day retreats centered on biohacking, dynamic aging, holistic paths\nto well-being and more.\n\nCurated experiences at Rosewood Schloss Fuschl include private after-hours tours\nof local museums with private concerts, hot air balloon excursions over the Alps\nand dirndl-making workshops focused on Austrian clothing. The resort also offers\nguided hikes, stargazing sessions, eco-friendly boating on electric vessels and\nexcursions with a local master fisherman who has been responsible for operating\nthe adjacent Schloss Fuschl Fishery since 1987. The resort also offers a local\nprogram that immerses guests in the cultural heritage of the Salzkammergut\nregion. One standout experience is the Austrian umbrella atelier excursion where\nguests get exclusive access to the Kirchtag Umbrella Store and Workshop\nestablished in 1903.\n\n\nRELATED ARTICLES",
        "summary": "Rosewood Schloss Fuschl is Rosewood Hotels & Resorts’ second property in Austria, following the opening of Rosewood Vienna in 2022. The resort was originally built in 1461 as a hunting lodge for the Prince-Archbishops of Salzburg. The property has 98 guestrooms, including 42 suites and six chalets.",
        "source": "Luxury Travel Advisor",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-07-11",
        "title": "Schloss Fuschl: a castle hotel fit for a von Trapp ",
        "link": "https://www.ft.com/content/c1a4d41b-4bd6-4abf-8d19-7baa1e4d73dc",
        "content": "Subscribe to unlock this article\n\n\nTRY UNLIMITED ACCESS\nONLY HK$10 FOR 4 WEEKS\n\n\n\nThen HK$565 per month.\nComplete digital access to quality FT journalism on any device. Cancel anytime\nduring your trial.\n\n\nEXPLORE MORE OFFERS.\n\n\n\n\nSTANDARD DIGITAL\n\n\nWEEKEND PRINT + STANDARD DIGITAL\n\n\n\nwasnow HK$349 per month\n\nEssential digital access to quality FT journalism on any device. Pay a year\nupfront and save 20%.\n\n\nSTANDARD DIGITAL\n\n\nWEEKEND PRINT + STANDARD DIGITAL\n\n\n\nwasnow\n\n\nEXPLORE OUR FULL RANGE OF SUBSCRIPTIONS.\n\n\nWHY THE FT?\n\nSee why over a million readers pay to read the Financial Times.\n\nFind out why",
        "summary": "The Financial Times costs £10 per month to subscribe to. Pay a year upfront and save 20%. See why over a million readers pay to read the Financial Times. Use the weekly Newsquiz to test your knowledge of stories you saw in the FT.",
        "source": "Financial Times",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-03-11",
        "title": "Rosewood Hotel Group Accelerates Growth And Evolution Across Its Four Distinctive Brands",
        "link": "https://www.hospitalitynet.org/news/4120869.html",
        "content": "Rosewood Hotel Group, one of the world’s leading global lifestyle and\nhospitality management groups, continues to expand its global footprint and\nevolve its four brands – Rosewood Hotels & Resorts®, New World® Hotels &\nResorts, Asaya, and Carlyle & Co.; and residential business, Rosewood\nResidences. Over the last five years, the Group has experienced ambitious yet\nthoughtful growth, with its ultra-luxury Rosewood Hotels & Resorts brand signing\nan impressive number of new deals compared to its competitive set. Following a\nmonumental 2023 which introduced the Group into new global territories,\nincluding New Zealand and Hawaii; and lifestyle categories, including\nexperiential retail; 2024 promises to deliver even more new deal signings,\nproperty openings and enriching experiences in the world’s most inspiring\ndestinations.\n\n\nA GROWING, GLOBAL PRESENCE\n\nRosewood Hotel Group’s combined portfolio now consists of 48 hotels, resorts,\nand residences across 23 countries, each embracing the brand's A Sense of Place®\nphilosophy to reflect the individual location's history, culture, and\nsensibilities. For Rosewood Hotels & Resorts, 2023 saw three properties open:\nRosewood Munich, Kona Village, A Rosewood Resort, and the brand’s New Zealand\nlodge collection consisting of Rosewood Cape Kidnappers, Rosewood Kauri Cliffs\nand Rosewood Matakauri. These launches represented the Group’s first flags in\nGermany, Hawai’i, and New Zealand, respectively, and brought Rosewood Hotels &\nResorts’ total hotel count to 33 properties across 21 countries. For New World\nHotels & Resorts, the past year featured the launches of three new properties,\nwhich was a record for this growing brand and brought the total portfolio count\nto 15 properties. This development further expanded New World’s footprint in\nVietnam and China, raising the brand’s flag in Hoi An, Taishan and Guangzhou.\n\nEqually as impressive as the Group’s operational portfolio is its curated\npipeline of projects, each of which has been thoughtfully considered to inspire\nadventure and discovery. Today, Rosewood Hotel Group has 35 properties under\ndevelopment, reflecting one of the industry’s strongest pipelines when\nconsidered as a percentage of a brand’s complete portfolio. While the Group’s\npipeline has been consistently impressive, it is the past five years which have\nmade a profound impact on the trajectory of the company globally and its status\nas a leader in the industry.\n\nSix new deal signings for Rosewood Hotels & Resorts in 2023 contributed to this\npositioning. These include Rosewood Hotels & Resorts’ first-ever properties in\nBarbuda, Greece, South Korea and the Maldives, together underscoring the brand’s\ncommitment to bringing its unique approach to hospitality to both cultural\ncapitals and exotic island destinations. Rosewood Amaala was also announced in\n2023, which will mark the brand’s fourth property in Saudi Arabia upon opening.\nThe deal to manage the iconic Robertson Lodges in New Zealand was also penned in\n2023.\n\n\nAREAS OF EXPANSION\n\nThese additions reiterate Rosewood’s strategic areas for expansion. Having just\ngrown its presence in Europe by 100% in less than three years, the region\ncontinues to be a key focus for the Group. 2024 will see the opening of Rosewood\nAmsterdam in the Netherlands and Rosewood Schloss Fuschl in Austria, followed in\n2025 by new properties in Greece, Venice, Milan, Rome, and a second London\nhotel, The Chancery Rosewood.\n\nThe Middle East’s propensity for luxury hospitality has been similarly central\nto the Group’s strategic future expansion, with several new properties set to\njoin its Middle Eastern portfolio. Building upon its current presence in Abu\nDhabi and Jeddah, Rosewood Doha will open its doors in Qatar this year. In the\nMiddle East, future growth is focused on Saudi Arabia, whose ongoing\ntransformation for a new era of travel aligns naturally with Rosewood’s\ntrailblazing reputation for impeccable, first-class service. Three new hotels\nare set to debut in Saudi Arabia in the coming years: Rosewood Diriyah in 2025,\nalongside the future openings Rosewood Red Sea and Rosewood Amaala.\n\nThe pipeline for Rosewood Hotel Group also continues to grow in Asia Pacific,\nand in 2024 will see the opening of Rosewood Miyakojima, marking Rosewood’s\nentry into Japan. New World Chongqing Hotel in China will also debut in the\nforeseeable future. Looking further ahead, future openings in China include\nRosewood Shenzhen, Rosewood Hangzhou, Rosewood Shanghai, Rosewood Chongqing,\nRosewood Ningbo, and Rosewood Xi’An. In the greater Asia Pacific region,\nanticipated destinations include Rosewood Hoi An, Rosewood Seoul and Rosewood\nRanfaru in the Maldives.\n\nIn the Americas, development stretches across The United States, Mexico, and The\nCaribbean. 2025 will add Rosewood Mexico City and Rosewood Mandarina to the\ngrowing portfolio of properties in Mexico. Looking ahead, another icon will be\nreborn under the Rosewood flag with Rosewood The Raleigh in Miami Beach, which\nwill include 44 Rosewood Residences in a newly built Peter Marino-designed\nbuilding. Also consisting of both a resort and residential experience will be\nRosewood Barbuda, opening on the exquisite Caribbean island in 2028.\n\n\nENRICHED LIVING, EVERY DAY\n\nRosewood Hotels & Resorts' branded residential business, Rosewood Residences, is\na refined collection of estate homes, luxury villas and serviced apartments\ncarefully curated to enrich the lives of all who call them home. Currently\nconsisting of 14 properties across ten countries, this collection allows owners\nand guests to unlock an elevated lifestyle supported by the very best in design,\namenities, and service.\n\nFor the last several years, Rosewood Residences has been experiencing\nexceptional growth, with the number of projects in development currently sitting\nat an all-time high. The industry has taken notice: in the 2023 Brand Residences\nReport produced by Savills [1], one of the world’s pioneering real estate\nadvisors and consultancies, Rosewood Residences ranked 4th in its competitive\nset of independent luxury brands in regard to the number of completed and\npipeline projects.\n\nA highlight of this pipeline is six standalone residential properties, the first\nof which was only announced in 2021. The rapid growth of Rosewood Residences’\nstandalone properties is a further proof point of guests’ growing desire to\naccess the Rosewood lifestyle beyond the hotel and resort experiences. In 2023,\ntwo such destinations were identified and announced: Rosewood Residences\nHillsboro Beach in Florida and Rosewood Residences Turtle Creek in Dallas,\nTexas. These newly announced projects join the additional standalone pipeline\nproperties of Rosewood Residences Naples and Rosewood Residences Lido Key, both\nin Florida; Rosewood Residences Kamala in Phuket, and Rosewood Residences\nBeverly Hills in California. The Beverly Hills property will open later this\nyear to officially debut the exclusively residential Rosewood experience.\n\nAlongside these standalone properties in the pipeline are four Rosewood\nResidences that will be co-located within a hotel or resort property, including\nRosewood Residences Mandarina, Rosewood Residences Miami Beach, Rosewood\nResidences Doha, and Rosewood Residences Barbuda.\n\nAcross both the standalone and mixed-use properties in operation as well as in\ndevelopment, the team is continuously raising the bar to deliver an elevated\nlifestyle experience that speaks to the unique needs of today’s buyer. New and\ninnovative offerings introduced or announced by Rosewood Residences in the last\nyear include elevated food and beverage services, such as expert wine curation,\nprivate restaurants and bars, and curated in-home dining; dedicated shared and\nprivate spaces for visiting guests, younger residents, and pets; indoor and\noutdoor amenities and social areas designed specifically for entertaining; and,\nof course, a range of state-of-the-art wellness experiences. As wellness is a\ntop priority for many people today, Rosewood Residences has taken great care to\nintroduce new opportunities for residents and guests to stay well, from paddle\ntennis and pickleball courts, private salons and spas, to rooftop yoga pitches\nand pools.\n\nIn the end, Rosewood Residences’ impressive growth of its physical footprint and\ninnovative offerings contributed to a 135% increase in sales year over year in\n2023, with total sales amounting to $434 million. This demand underscores that\nRosewood Residences are providing buyers with the type of modern-day living that\nthey are looking for and a community of which they wish to be an active\nparticipant.\n\n\nASAYA: INTEGRATED APPROACH TO WELLNESS\n\nAsaya, Rosewood’s integrated, holistic health and wellness concept designed to\nunlock long-lasting and transformative well-being, will flourish in 2024 with\nnew launches and unique experiences. Since its inception at Rosewood Phuket in\n2017, Asaya has launched in five additional locations. Today, there is Asaya\nActive at Rosewood Guangzhou, Asaya Retreat at Rosewood Hong Kong, and Asaya Spa\nat Rosewood Vienna, Rosewood Munich, and Kona Village, A Rosewood Resort. The\nopenings in Munich and Hawai’i in 2023 constitute growth of the Asaya concept by\n50%. This past year also saw 10% growth of Asaya’s membership model, which is\navailable in certain urban destinations including Hong Kong, Guangzhou, and now\nMunich.\n\nUnderstanding how holistic well-being is foundational to a fulfilling life, the\nevolution of Asaya is of paramount importance to Rosewood Hotel Group in 2024\nand beyond. Today, there are 19 Asayas in the pipeline at both future and\nexisting Rosewood properties. In the coming year, seven will debut, reflecting\nthe brand’s largest single-year expansion to date. All four of Rosewood Hotels &\nResorts’ new 2024 openings – Rosewood Doha, Rosewood Miyakojima, Rosewood\nSchloss Fuschl, and Rosewood Amsterdam – will feature Asaya. This will mark the\nbrand’s entry to The Middle East and Japan and double its count in Europe. In\naddition, existing properties Rosewood São Paulo, Rosewood Mayakoba and Rosewood\nSand Hill will also introduce the Asaya experience. In keeping with the Rosewood\nbrand’s guiding philosophy, each Asaya will offer immersive programming inspired\nby the destination in which it sits, with practices informed by local culture\nand heritage. Each new Asaya will further deliver exclusive treatments and\nproducts from some of the most innovative wellness brands in the world,\nincluding Dr. Barbara Sturm within Rosewood Doha and Rosewood Schloss Fuschl and\nGuerlain at Rosewood São Paulo. These partnerships reflect the brand’s\ncommitment to providing preeminent wellness experiences that are both\nestablished and innovative.\n\n\nRAREFIED RETAIL\n\nMarking the brand’s growing presence as a luxury lifestyle brand, Rosewood\nHotels & Resorts continued its expansion into the retail space in 2023 with the\nlaunch of new e-commerce storefronts for nine of its hotels – including Rosewood\nSand Hill, Rosewood Miramar Beach, and Kona Village, A Rosewood Resort. This was\nthe most storefronts to launch in a single year since Rosewood first entered\ninto the e-commerce space in 2019, and brought the total number of platforms to\n13. These channels invite Rosewood aficionados to bring home an element of the\nhotel experience and purchase incredible experiences.\n\nIn 2023, Rosewood further strengthened its retail proposition through an\nexclusive partnership with The Webster, a luxury multi-brand retailer offering\nfashion, accessories, beauty and homeware. The partnership commenced with a\nsummer pop-up series across Rosewood Miramar Beach in California and Rosewood\nMansion on Turtle Creek in Dallas, which invited Rosewood guests to shop\nexclusive collections inspired by these distinctive destinations. In celebration\nof the 2023 festive season, the partnership further included a bespoke retail\nedit to shop online. The edit consisted of The Webster’s founder, Laure Heriard\nDubréuil’s personal picks for the holidays. This model will be expanded upon in\n2024, with Rosewood looking to launch unique product collaborations with leading\nbrands across the categories of fashion, wellness, home design, and more.",
        "summary": "Rosewood Hotel Group’s combined portfolio now consists of 48 hotels, resorts, and residences across 23 countries. Rosewood Hotels & Resorts, Asaya, and Carlyle & Co.; and residential business, RosewoodResidences.",
        "source": "Hospitality Net",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-10-25",
        "title": "Sonia Cheng: ‘The key is to design a hotel that doesn’t feel like a hotel’",
        "link": "https://www.ft.com/content/3ce62078-44ed-4b1e-9ed6-3a1adc9fcef4",
        "content": "Sonia Cheng walks into the Butterfly Pâtisserie at the Hôtel de Crillon at 10am\non the dot on a Saturday. The 42-year-old CEO of Rosewood Hotel Group – which in\n2017 assumed management of this Parisian institution, commissioned by Louis XV\nin 1758 – is wearing a fawn-coloured Saint Laurent blazer over a white T-shirt,\na thick gold-snake chain and an aura of total focus. It’s Fashion Week, she’s\nhere for only three days, and she has a lot on her plate: she arrived from\nHong Kong, where she lives with her husband and five children, and went straight\nto a handful of shows. In two hours’ time she will co-host a lunch for 22 with\nLaure Hériard Dubreuil, the founder of Miami-based fashion powerhouse The\nWebster. She has just spent her breakfast being photographed in the hotel’s Bar\nLes Ambassadeurs for this magazine. She asks for coffee and says she’s “really\njetlagged” – though when I’d entered the sumptuous fitness centre at what I\nthought an unconscionably early hour for a weekend morning, she was already\nwrapping up her workout. \n\nAs chief executive, Cheng oversees a hotel group with more than 40 properties in\noperation across 20 countries, of which 31 are Rosewoods, with almost as many in\nthe works. She has simultaneously developed three more brands – a residences\ncollection, a wellness concept and a members’ club – while sitting on several\nboards, including the Hong Kong Tourism Authority. She’s also vice-chairman of\nher family’s multibillion-dollar Chow Tai Fook Jewellery Group – one of the\nlargest jewellery companies in the world, by market cap – whose parent, Chow Tai\nFook Enterprises, capitalised much of Rosewood’s development. (She is reportedly\neffecting a modernisation of both its designs and the brand’s 7,700+ stores\nworldwide.)\n\nSo if focus trumps bonhomie for much of our meeting, fair enough. Speaking in a\nlow voice at a fast clip, she is pleasant but never not crystally, didactically\non message about what makes her, and Rosewood, tick.\n\nThe entrance of Hôtel de Crillon, Paris © Julien Lienard\nCheng in Les Ambassadeurs © Julien Lienard\n\nIn the 12 years since Cheng’s father, Cheng Kar-Shun (known as Henry), the\nbillionaire chairman of Hong Kong-based New World Development (which includes\nNew World Hotels, an Asia-based collection), acquired the Rosewood brand, its\nhotels have proliferated across six continents. Like most privately held\ncompanies, Rosewood doesn’t report financials, but said bookings to the end of\nQ3 2023 are up 47 per cent worldwide on 2019 and topline growth on revenue has\nexceeded 60 per cent in the past four years. In an industry projected to more\nthan double from its current valuation of around $140bn to almost $300bn\nby 2030, they compete with the independent and multibrand conglomerate\ncategories alike.\n\nIts pipeline of 28 hotels is formidable even by industry leaders’ standards\n(Four Seasons, a behemoth with $4.3bn in revenue in 2022, has around 50).\nRosewood’s reimagining of Venice’s storied Bauer Hotel, slated to open in 2025,\nis one of several heritage European projects, along with Amsterdam, Salzburg,\nMilan and Rome, all on the heels of Vienna opening last year, and Munich opening\nlast week. Two resorts in Saudi Arabia, part of that country’s\ntrillion-dollar-plus Vision 2030 development initiatives, will open by 2026,\nalong with a Riyadh hotel. Weeks before we meet, Cheng signed a deal to take\nover the three award-winning Robertson Lodges in New Zealand. There are urban\nflagships on the way in Shanghai, Mexico City and – the most buzzed-about – a\nnew, second hotel in London, where Rosewood is currently gutting the former US\nEmbassy building on Grosvenor Square, with Sir David Chipperfield leading the\narchitecture and interiors team.\n\nLas Ventanas al Paraíso in Mexico\n\n“The key is to design a hotel that doesn’t feel like a hotel,” Cheng says. She\nwants to make environments to appeal as much to the next-door neighbour as to\nthe guest who’s arrived from several time zones away. “That’s a very important\ningredient of this brand; it’s how we’ve differentiated. We want to make it\nresonate with the neighbourhood, to make people say when they walk in, ‘This is\na place I can hang out with my friends.’ We curate every single space [to that\nend].”\n\nIf all that lands a bit like boilerplate lifted straight from the press\nliterature of Luxury Hotel Company X, consider the Rosewood London, whose 10th\nanniversary the company is celebrating this year – the first hotel Cheng opened\nafter being appointed CEO, aged 28. She had a degree in applied mathematics from\nHarvard, and a few years each at Morgan Stanley and Warburg Pincus under her\nbelt, but zero formal hospitality experience. The Edwardian pile on High Holborn\nwas formerly part of the Renaissance chain. Sceptics (including your writer)\nquestioned the wisdom of locating a property intended to compete with the likes\nof Claridge’s in the weird socio-demographic selva oscura between Covent Garden\nand Fleet Street. “People told me I was crazy, that we’d never be able to\nattract the foot traffic we’d need. But it’s such a beautiful building; I don’t\nthink there’s another courtyard like that in any hotel in London,” she says. \n\nCheng introduced the Holborn Dining Room – an all‑day British brasserie with\nfire engine-red banquettes, waiters in fitted waistcoats and forage caps, and\ntruffle fries and gourmet pies on the menu. Across the portico was Scarfes, a\ncocktail bar lined with bespoke cartoons by celebrated English illustrator\nGerald Scarfe, presided over by world-class mixologists. Within a couple of\nmonths, both were doing brisk trades; the bar regularly had a queue out the\ndoor. In the hotel itself, the suites flowed like high-spec apartments: antique\ndesks, minibars in lacquered oriental cabinets, proper kitchens with tile floors\nand gallery-hung walls. Cheng, known in the industry for having her hands\ndeep in the design side of things (“I love it – I have a really strong team, but\nwith certain flagship properties I still get quite involved”), had tapped Tony\nChi and Martin Brudnizki (now a ubiquitous force in hotel design, but then still\nan emerging star).\n\nRosewood Beijing followed a similar strategy in 2014: create something\nunexpected for the city – sleek but laid-back, full of greenery, with a haute\nhot-pot café in place of the conventional Michelin-endorsed destination. Within\nthree months of opening, Cheng says, its RevPAR (revenue per available room) was\nnumber one in the market, despite Rosewood having no other Asian presence and no\nloyalty programme.\n\nTen years and some 20 openings later, her disruptive successes have put paid to\nmuch of the nepo baby-centric speculation that initially surrounded her\nappointment – and made Rosewood popular with the industry’s blue-chip investment\npartners. The brand’s tagline, “A Sense of Place”, may predate her tenure as\nchief executive, but it’s Cheng who imbued it with the tangible signifiers that\ndeliver returns.\n\nThe new Rosewood Munich, housed in a former bank Cheng in the Tristan\nAuer-designed Boudoir, in the lobby of the Hôtel de Crillon © Julien Lienard\n\nHenry Cheng’s acquisition of the company was “brilliant move number one”, says\nJames McBride, CEO of Nihi hotels and an industry doyen of almost 40 years.\n“Brilliant move number two was putting Sonia in charge.” For a decade before\nCheng acquired Rosewood, McBride ran The Carlyle in New York, one of the most\nrecognised names in its original portfolio; numerous colleagues from his time as\na senior director at Ritz-Carlton have gone on to work with Cheng. McBride\npraises her “great instincts and engaged leadership”, her aptitude for site\nselection and conversion, and her skill at recruiting top talent (while hotel\nGMs who’ve found her management style to be overly controlling are not unheard\nof, more often what’s expressed is admiration). “The excitement, the momentum\n[that currently surrounds the brand] can be felt from afar. She has created that\nlightning-in-a-bottle thing, and I think she’s only getting started.”\n\nBut luxury hospitality moves fast. “My goal is to be a purpose-led luxury\nlifestyle brand,” she declares. “When people ask me, ‘Who are your hotel\ncompetitors?’ – of course, we have them, but in my mind I compare us to luxury\nbrands; I want us to be learning from retail and fashion, those different\nspaces.” Making them an actual part of the Rosewood brand is in the strategy as\nwell: the lunch Cheng hosts with Hériard Dubreuil in Paris is to celebrate a\nseries of Rosewood-The Webster pop-ups in the US, a collaboration that will be\nevolved across more locations, possibly as permanent retail presences with\nprivate shopping privileges.\n\nSustainability is now in the mix “from the moment we start planning”, Cheng\nsays, noting that today’s luxury consumers are more societally and\nenvironmentally conscious. “We need to build it [into the hardware], but also\nmake it part of the experience.” The company recently inaugurated Rosewood\nImpacts as its official ESG initiative, but various policies and implementations\ngo back years. \n\nBemelmans Bar in The Carlyle New York © Jennifer Cooke\n\nWhen I admit to having struggled with the lofty, vaguely worded Impacts\nliterature her press office had provided, she immediately starts ticking off\nconcrete executions: The Rosewood São Paulo, a new-build that opened in 2022,\nruns on 100 per cent renewable energy, has its own waste-management facilities,\nand around 75 per cent of building materials used were locally produced or\nupcycled (or both). Kona Village Resort, on Hawaii’s Big Island, which Rosewood\nre-flagged earlier this year, is now powered by 8,000 solar panels – the largest\nprivate micro-grid in the state, and the only one to run entirely on solar. She\ntells me the company is ahead of schedule on its 2050 carbon-neutrality target\n(which is more than can be said of a few big western democracies’ net-zero\nefforts).\n\n--------------------------------------------------------------------------------\n\nFamily travel is seen through this lens as well. “When we were first thinking\nabout kids’ experiences in the hotels [years ago], one of my team members had\nall sorts of ideas for digital experiences, all focused on that kind of\ninterface.” She looks at me in disbelief and laughs. “I just went, ‘Actually,\nno! The opposite! Hands-on, high-touch’” – get them in nature, into local\ncommunities. “They’re always in front of a screen at home, this is one of their\nonly chances not to be. I mean, why are you even travelling?” She cites plans to\ncreate kids’ “learning retreats” at a Maldives resort slated to open in a couple\nof years – several-days-long educational programmes (“or 10 days, or even two\nweeks”), focused on marine conservation – as an example of the company’s\ndirection.\n\nHer other three brands – Rosewood Residences, Asaya (the company’s wellness\nconcept, with currently just six locations, three in Asia) and Carlyle & Co, the\nmembers’ club – are moving ahead at different paces. “We launched Asaya in Hong\nKong with the idea to have it be a holistic offering. That meant not just [spa]\nbut nutritionists, a lot of post-maternity treatments, visiting practitioners.”\nI ask if she personally finds the wellness space interesting, and am politely\nstonewalled: “I think it has a lot of potential.” But does she find carving out\na meaningful wellness brand in the luxury hotel market – where terms like\nbiohacking and epigenetics now get thrown about as regularly as lomi lomi\nmassage and lift facial once were – a challenge? “Our target audience obviously\ncares about wellbeing. So how does Rosewood play a role in facilitating that?\nBut I don’t think we should overcomplicate it; just be authentic. I don’t\nbelieve in introducing fancy words just to differentiate.”\n\nDeveloping residences is almost a business imperative, but it’s also a natural\nextension: Rosewood has managed apartments at The Carlyle since 2002, and sold\nholiday residences and townhouses from Vancouver to São Paulo to every location\nin Mexico in which it operates. In the past two years, Cheng has announced\nsix standalone Rosewood Residences, unaffiliated with any hotel. “We get a lot\nof customers who say, I want this for my home – this exact design, this exact\ncuration. So how do you take that notion and put it in a residence?” If the\nstarting prices in Beverly Hills of $10mn are any indication, they’re\nsucceeding.\n\nSays Cheng: “We want to make people say when they walk in, ‘This is a place I\ncan hang out with my friends’” © Julien Lienard\n\nCarlyle & Co, the members’ club Cheng launched two years ago, currently has just\none location at present, atop the Rosewood Hong Kong – and she’s keeping schtum\nabout where the next will open.\n\n“We’re not about quantity here,” she says. “With membership, it’s always the\nright location and city. You know the Carlyle – it has such a rich soul. You\nwalk in and might not feel it’s the grandest hotel ever; there are parts that\nare probably dated, the tables are maybe too close together at Bemelmans [Bar].\nBut there’s a sense of community that’s real. Somehow, it’s kind of a club, even\nthough it’s not.” She “took the soul of all that” back to Hong Kong, recreating\nan outpost of the Café Carlyle, nightly jazz and all. It still, she says, has a\nwaiting list for membership in the hundreds.\n\nIt’s a lot to be growing all at once, it seems to me; but clearly not to Cheng.\n“All these touch points are opportunities,” she says. “That’s the purpose of us\nbeing in this business, I think. We can be a platform for connecting people in\ncommunities, and enriching the places we operate in. We can play that role. I\nfind it to be a very meaningful part of what we do.” It has the ring of the note\nshe’d like to end on: very on-message, also like something she really believes,\ndefinitely like something she intends to make happen. ",
        "summary": "Sonia Cheng is the 42-year-old CEO of Rosewood Hotel Group. She oversees a hotel group with more than 40 properties in 20 countries. Rosewood is currently gutting the former USEmbassy Grosvenor Square in London.",
        "source": "Financial Times",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-06-10",
        "title": "Kevin Neo Now Deputy CEO of Keppel Infra Trust - Mingtiandi",
        "link": "https://www.mingtiandi.com/real-estate/people/kevin-neo-now-deputy-ceo-of-keppel-infra-trust/",
        "content": "The future of a Singapore-listed infrastructure trust leads this week’s review\nof hirings and promotions from around the region, as a Keppel-managed vehicle\nlines up a new CEO. A new money guy for Hong Kong’s Rosewood Hotels also makes\nthe list, as does a new independent director for CapitaLand India Trust.\n\nKeppel Infrastructure Fund Management, the trustee and manager of Keppel\nInfrastructure Trust, said on 7 June that it had appointed Kevin Neo Tzu Chao as\ndeputy chief executive with effect from the next day. A seven year veteran of\nKeppel Group, Neo steps into the deputy CEO role under a plan which has him\ntaking over as chief executive of the trust from incumbent Jopy Chiang on 1\nOctober. Before joining Keppel in 2016, Neo, now 43, held M&A advisory and\ninvestment positions with PwC and Singapore Power.\n\nRosewood Hotel Group said on 1 June that it has appointed Kevin Yung as chief\nfinancial officer of the hospitality division of Hong Kong’s New World Group.\nYung took on his new role recently after previously serving as a strategic\nadvisor to Rosewood Hotels. He continues to serve as managing partner of\nRosewood Capital Ventures, a Los Angeles venture capital affiliate of Rosewood\nHotels Group and previously held the title of group CEO with CTF Education, a\nunit of Chow Tai Fook Enterprises, the family office of the Cheng clan which\ncontrols New World.\n\nPriyank Shah has joined Logicap Investment Advisers in Singapore as head of fund\nmanagement and strategic business development, according to a LinkedIn update.\nThe London School of Economics graduate takes on his new role after more than 12\nyears as JLL in Singapore and Mumbai, including serving for the past two years\nas senior director with the property consultancy’s capital markets team for Asia\nPacific.\n\n\n\nCapitaLand India Trust Management said on 31 May that it was appointing Kevin\nGoh, now 47, as a non-executive, non-independent director on the trust’s board\nwith effect from the next day. Goh, whose day job is chief executive of\nCapitaLand Investment’s Lodging division, will also be joining the trust’s audit\ncommittee and has held senior management roles in CapitaLand’s lodging business\nsince 2012.\n\nCushman & Wakefield announced on 6 June that it has appointed Mika Kania as\ndirector of sustainability and ESG for Asia Pacific. Reporting to Matt Clifford,\nthe company’s head of sustainability and ESG for Asia Pacific, Kania joins C&W\nin Hong Kong from JLL where she had served as senior director of sustainability\nservices for Asia Pacific for more than two years. She also has previous\nexperience with WeWork and the US Green Building Council.\n\nESR Group said on 7 June that JD Property chief executive Hu Wei had retired\nfrom his position as a non-executive director on the company’s board at the ESR\nannual general meeting that same day. Hu had first joined ESR’s board in 2021,\ntaking over a board seat from former JD Logistics chief executive Wang Zhenhui.\nESR had yet to appoint a replacement to take over Hu’s board seat at the time of\npublication.\n\nYiwen (Ivan) Zhang has joined JD.com in London as an investment manager\nresponsible for pan-European logistics and industrial real estate investment\nwith the e-commerce giant’s JD Property division, according to a LinkedIn\nupdate. Having recently completed a master of business administration degree at\nthe University of Cambridge in the UK, Zhang also has previous experience with\nMapletree Investments in Beijing.\n\nSandip Patnaik has been promoted to senior managing director with JLL India\nafter 17 years with the property consultancy, according to a LinkedIn update.\nAdvising on a range of deals including corporate leasing, investment\ntransactions, development joint ventures and fund raising, the Hyderabad-based\nexecutive reports directly JLL’s India chief executive and country head, Radah\nDhir.\n\nIf you know of other Asia real estate professionals changing their jobs, getting\npromoted or just doing something exciting, please contact us here at Mingtiandi.",
        "summary": "Keppel Infrastructure Fund Management appoints Kevin Neo Tzu Chao as deputy chief executive. A new money guy for Hong Kong’s Rosewood Hotels also makes the list. Cushman & Wakefield appoints Mika Kania as sustainability and ESG director.",
        "source": "Mingtiandi",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-01-15",
        "title": "Jobs For Refugees: How This Luxury Hotel Made Social Impact More Than A Buzzword",
        "link": "https://www.forbes.com/sites/isabellekliger/2024/01/11/jobs-for-refugees-how-this-luxury-hotel-made-social-impact-more-than-a-buzzword/",
        "content": "Long gone are the days when social responsibility was seen as just a passing\nfad. Instead, more and more companies are looking for ways to make a real\ndifference. Like Rosewood Hotel Group, which not only operates some of the\nworld’s most exceptional hotels, but does so with a deep-rooted commitment to do\ngood, both for people and the planet.\n\nRosewood Hong Kong.\n\nImage courtesy Rosewood Hotel Group\n\n\nTHIS IS ROSEWOOD HONG KONG\n\nRosewood Hotel Group has achieved a level of global recognition that most\nhospitality brands could only dream of. Last September, when 50 Best (the\norganization behind the prestigious World’s 50 Best Restaurants and World’s 50\nBest Bars) unveiled the first-ever World’s 50 Best Hotels ranking, the list\nfeatured three Rosewood hotels. Taking the number two spot globally and\nsimultaneously being named “The Best Hotel in Asia” was Rosewood Hong Kong, the\nbrand’s ultra-chic flagship property.\n\nSet in the heart of the Victoria Dockside arts and design district, on the\nglittering waterfront in Tsim Sha Tsui, the cooly sophisticated 413-room\nRosewood Hong Kong occupies 43 floors of the Rosewood Tower, a new landmark on\nthe city’s iconic skyline. A major contributor to Tsim Sha Tsui’s growing\nreputation as a burgeoning creative and cultural epicenter, the glamorous\nproperty—home to no fewer than 12 bars and restaurants, as well as the holistic\nAsaya wellness concept, and over 34,000 square feet of meeting and events\nspace—has quickly established itself as a place to see and be seen.\n\nAsaya is Rosewood Hong Kong's holistic wellness concept.\n\nImage courtesy Rosewood Hotel Group\n\nFrom Holt’s Café with its contemporary take on Hong Kong’s traditional Cha Chaan\nTeng dining culture, to DarkSide, a sophisticated, timeless celebration of rare\naged spirits and classic cocktails complemented by sultry live jazz, and superb\none-star Michelin CHAAT, aptly named after the Hindi word \"to lick\", which will\ntransport you across India with its delectable tasting menus bursting with\nreimagined, elevated authentic flavors, Rosewood Hong Kong has something for\nevery taste.\n\nAdditionally, the 186 ultra-luxury Rosewood Residences have been designed for\nresidents electing short and longer stay rentals, with a private club, along\nwith special services and exclusive amenities.\n\nBlueHouse at Rosewood Hong Kong.\n\nImage courtesy Rosewood Hotel Group\n\n\nBLUHOUSE: A BUSINESS WITH PURPOSE\n\nThen there is BluHouse, with its sun-drenched dining hall that celebrates the\nvibrant spirit of Italy. BluHouse is also Rosewood Hotel Group’s first\nrestaurant inspired by the concept of a business with purpose. As Mehvesh Mumtaz\nAhmed, Rosewood Hotel Group’s Vice President of Social Impact, explains:\n\n\"It’s not lost on us that consumers are prioritizing sustainable brands now more\nthan ever, and we’re happy to be aligned with this growing pool of conscious\ntravelers,\" she says, adding that creating a positive impact for people and the\nplanet has been at the forefront of Rosewood Hotel Group’s operations for years.\nIn 2022, the group rolled out Rosewood Impacts, a framework for delivering on\nthis vision that seeks to empower people across the brand’s ecosystem, with a\nsustainability approach that puts circular hospitality at the core of business\noperations.\n\nAhmed describes Hong Kong as a destination that is both incredibly prosperous\nyet also struggles with issues of economic disparities. Understanding that\ntourism—especially at the luxury level—is a huge driver of revenue for the\ndestination, the team at Rosewood Hong Kong identified an opportunity to bridge\nthis gap and provide direct economic support to underserved communities in its\nneighborhood.\n\nOf the 413 rooms and suites, 80% have views of Hong Kong harbor.\n\nImage courtesy Rosewood Hotel Group\n\n\nTHE IMPORTANCE OF RESPONSIBLE HIRING PRACTICES\n\n\"Given that responsible hiring practices have been shown to create real,\nsustained equity, a targeted employment program felt like the best way to ensure\nthat we were making a meaningful difference. This was the genesis of BluHouse, a\nrestaurant committed to co-creating neighborhood resilience through donations,\nemployment, and impactful experiences in support of underserved groups in Hong\nKong,\" says Ahmed.\n\nWhen the team began to research the most overlooked groups in Rosewood Hong\nKong’s neighborhood, they discovered that these were mostly people of color:\nrefugees and minorities. They decided to connect with these groups with the help\nof trusted NGO partners, and welcome them into the Rosewood family.\n\n\"Hong Kong has more than 14,000 refugees from all corners of the world who\nremain here for an average of 10+ years before heading to a country that will\ngrant them asylum,\" continues Ahmed. \"During those years, they languish on basic\ngovernment support unless an employer is willing to sponsor a work visa for\nthem. Which few employers do. For us, there was no hesitation.\"\n\nThe waterfront promenade in Tsim Sha Tsui.\n\ngetty\n\n\nOPPORTUNITIES FOR REFUGEES AND MINORITIES\n\nAs part of its mission to support underprivileged local groups, the hotel\ncurrently has three refugees working in BluHouse and three in other departments.\nMeanwhile, BluHouse has pledged 1% of its revenue towards this program and has\nalso launched the BluCup, a sustainable, reusable cup that not only reduces\nwaste but also allows guests to join the journey. Every purchase triggers a\ndonation to NGOs supporting disadvantaged groups in the community.\n\n\"We feel lucky to have some incredible members of this community among our\nranks, who bring not just a great work ethic but compassion and kindness to the\nworkplace,\" says Ahmed, emphasizing that the success of the BluHouse project\ncould well serve as a benchmark for future food and beverage ventures \"with\npurpose\".\n\n\"We want to continue to act as an employer that creates a diverse and inclusive\nenvironment and use our status as a way to help underserved groups seek out\nopportunities that lead to meaningful livelihoods,\" she says, concluding: \"We\nwant to build a future where people and place enrich one another; a future where\nluxury hospitality is a force that benefits local communities and aids in\nhelping them thrive; a future that acknowledges that the success of business and\nsociety is knitted together.\"",
        "summary": "Rosewood Hotel Group operates some of the world’s most exceptional hotels. The group also has a deep-rooted commitment to do good, both for people and the planet. Rosewood Hong Kong occupies 43 floors of the Rosewood Tower on the Tsim Sha Tsui waterfront.",
        "source": "Forbes",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-11-29",
        "title": "Hong Kong's third-richest man brushes back succession theories: 'If there’s no family member suitable, we can hire from the outside'",
        "link": "https://fortune.com/asia/2023/11/29/hong-kong-billionaire-henry-adrian-cheng-new-world-development-succession-heir/",
        "content": "For years, Adrian Cheng had all the trappings of a third-generation scion\npreparing to lead one of Hong Kong’s wealthiest clans into a new era. He infused\nhis property projects with art, burnished Tsim Sha Tsui’s waterfront as a\ncultural district and invested in digital tokens. \n\nThis month, his heir-apparent status at the $26 billion family empire was thrown\ninto doubt after his father Henry Cheng said the conglomerate is still\nlooking for a successor. \n\n“I’m still observing but I think it’s not so easy to identify such a person,” he\nsaid in a television interview, adding that the family has a wide range of\noperations and qualified “members can be in charge of each business sector. If\nthere’s no family member suitable, we can hire from the outside.”\n\nThe revelation from Hong Kong’s third-richest man raised eyebrows in a city\nall-too familiar with succession battles that often erupt into public view and\noccasionally wind up in court. Former casino baron Stanley Ho and property\ntycoon Lo Ying Shek are just two examples.\n\nHenry’s comments could mean that he hopes to have each family member lead a\nparticular segment, but not necessarily pick one leader for the entire\nbusinesses, said Winnie Peng, director of the Roger King Center for Asian Family\nBusiness and Family Office at Hong Kong University of Science and Technology.\nShe added that it’s often a process of evolving from a family business to a\nbusiness family. \n\n“When families are planning for succession, there could be potential sibling\nrivalry,” Peng said. “This is something that they have to be really careful\nabout.” But if the family members are harmonious and share the same values, then\nthis problem can be avoided, she said.\n\nAdding to the intrigue, Henry’s close associates didn’t share details of the\ninterview on the family-backed HOY TV with his children before it aired, people\nfamiliar with the matter said, requesting not to be named because the matter is\nprivate. Adrian was aware of the interview and its contents before it was\nbroadcast, a spokesperson said, without providing further details. \n\nIt had been widely expected that Adrian, a 44-year-old graduate of Harvard\nUniversity, would take over leadership of the family empire from his father. \n\nAdrian is currently chief executive officer of New World Development Co., the\nfamily’s flagship property business; Sonia Cheng, Henry’s 43-year-old daughter,\nmanages the Rosewood hotel and Chow Tai Fook Jewellery Group Ltd.; and Henry,\n76, controls Chow Tai Fook Enterprises Ltd., the Chengs’ unlisted family\ninvestment vehicle, with other relatives. Chow Tai Fook Enterprises holds major\nstakes in the clan’s main businesses, controlling New World and the Rosewood. \n\nAs recently as 2020, Adrian’s representatives were distributing a bio that\ndescribed him as “the heir to New World Development and Chow Tai Fook\nEnterprises, and the third generation leader of the $20.7 billion empire.” Sonia\nidentified herself as chief executive officer of Rosewood around the same\nperiod.\n\nWhen asked about her father’s remarks during an earnings briefing, Sonia — also\na Harvard grad — said her role at the jeweler provides a clear division of work\nwithin the company, and all family members work together for the benefit of the\nfirm. Conroy Cheng, Sonia’s cousin and vice chairman of the jeweler, said\n“there’s no such thing” when asked about the possibility of family infighting.\nNew World declined to comment. Chow Tai Fook Enterprises didn’t respond to a\nrequest for comment.\n\nThe patriarch’s words matter in a succession process that may soon get under\nway, especially in a society that traditionally favors the eldest son. \n\nHenry took over the business from his father Cheng Yu-tung, who built the\nconglomerate spanning shopping malls, casinos, hotels, and jewelry stores across\nHong Kong and mainland China. The group’s holdings are among the signature\nproperties in Hong Kong, from the New World Tower to the Victoria Dockside\ncomplex. \n\nThe sprawling empire has generated a fortune for Henry, whose net worth is\nalmost $21 billion, according to the Bloomberg Billionaires Index. \n\nUnder Adrian, New World has expanded aggressively in China and is working on two\nof the biggest retail developments in Hong Kong, including a $2.6 billion\nmall-office complex next to the airport. \n\nThe strategy has come at a cost for New World, driving its debt load higher just\nas interest rates are soaring. The company’s net debt to equity was 94% at the\nend of June, according to Bloomberg Intelligence. That compares with 42% at\nrival Henderson Land Development Co., and Sun Hung Kai Properties Ltd.’s 18%.\n\n“New World’s leverage is particularly high so there are more concerns for the\ncompany,” said Patrick Wong, an analyst at Bloomberg Intelligence. “When the\nmarket sentiment is not good” companies like New World are especially\nvulnerable, he said.\n\nNew World’s stock has tumbled 47% this year to a 20-year low, compared with a\n14% drop in the benchmark Hang Seng Index. The developer’s $1.3 billion\nperpetual bonds sold in 2019 traded at just 51 cents on the dollar. \n\nThat’s even after the Cheng family investment vehicle stepped in to alleviate\nthe builder’s debt burden. Chow Tai Fook Enterprises Ltd. recently bought the\nmajority shares of NWS Holdings Ltd., a subsidiary, generating $2.8 billion for\nNew World. \n\nChina’s property meltdown represents another headwind for New World — and for\nAdrian. Its contracted sales from homes in the mainland accounted for almost\ntwo-thirds of total sales in the 12 months through June. By contrast,\nbillionaire Li Ka-shing’s CK Asset Holdings Ltd. has trimmed its revenue from\nmainland China to just 11%. \n\n“Weathering the challenging macro business environment is very important for\nboth New World and Adrian Cheng,” said Vincent Lam, chief investment officer at\nHong Kong-based VL Asset Management. “If he can resolve the difficulties, it\nwill solidify his position and future as a business leader.”\n\n\nADRIAN’S GAMBIT\n\nAdrian has certainly been on the move, modernizing his retail empire at a time\nwhen traditional malls are under siege. His vision includes building his\nflagship K11 malls into premium destinations with art and culture. He’s bringing\nLouis Vuitton’s first ever fashion show to Hong Kong this month, and introduced\nAsia’s largest MoMA design store.\n\nHis crown jewel K11 MUSEA’s foot traffic increased 67% in this first-half and\nmall sales increased 84%, the company said.\n\nAdrian’s logic is that the future of retail isn’t just about selling goods, it’s\nabout the experience, especially for the deep-pocketed consumers he’s chasing.\nThe company’s top clients who spend more than HK$300,000 a year contributed\nHK$1.1 billion to sales last fiscal year, and tripled consumption from\npre-pandemic levels, according to a spokesperson. \n\nAnd to underscore his legitimacy beyond overseeing money from friends and\nfamily, Adrian’s private investment arm, C Capital, raised more than $250\nmillion for its Private Equity Fund III to back emerging consumer and technology\nfirms. \n\nNew World is also selling assets to raise cash and is cutting debt, making\ndeleveraging the priority, Chief Financial Officer Edward Lau said in an\ninterview. \n\nThe company plans to dispose of HK$6 billion in non-core assets in the fiscal\nyear through June, after selling HK$38 billion in the last three years. It also\nwill seek joint ventures to develop its 15 million square feet of land in Hong\nKong’s Northern Metropolis to lower costs, while some plots could also be up for\nsale. It announced plans on Nov. 23 to spend as much as $600 million to buy back\nseven of its dollar bonds. \n\n“When there’s volatility in the market, whether it’s related to our company or\nnot, we will buy more,” Lau said.\n\nRead more: New World May Only Slightly Cut Debt Cost on Bond Buyback: React\n\nStill, all the challenges facing Adrian are adding heft to his father’s comments\nabout succession in a family where multiple siblings play active roles. \n\nSonia sits atop both the hotel business and a publicly traded jewelry unit that\nhas a market value three times higher than New World. \n\nTheir brothers Brian and Christopher serve as executive directors of the\nfamily’s infrastructure arm NWS Holdings. Brian also sits on the board of New\nWorld. They also have two half-brothers. Henry’s nephew-in-law, Patrick Tsang,\nserves as chief executive officer of Chow Tai Fook Enterprises.\n\n“I think it’s actually very encouraging to siblings other than simply Adrian\nCheng,” Peng said, referring to Henry’s comments. “They would feel better that\nthe father is quite inclusive to try to encourage them to join the family”\nbusiness, she said. \n\nRecommended Newsletter: CEO Daily provides key context for the news leaders need\nto know from across the world of business. Every weekday morning, more than\n125,000 readers trust CEO Daily for insights about–and from inside–the C-suite.\nSubscribe Now.",
        "summary": "Adrian Cheng's status at the $26 billion family empire was thrown into doubt after his father said the conglomerate is still looking for a successor. The revelation from Hong Kong’s third-richest man raised eyebrows in a city that is all-too familiar with succession battles.",
        "source": "Fortune",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-04-30",
        "title": "Latest news: Gencom refi in Bermuda; record pipeline in Canada; Yotel deal in Tokyo",
        "link": "https://www.hotelinvestmenttoday.com/Development/Brands/Latest-news-Gencom-refi-in-Bermuda-record-pipeline-in-Canada-Yotel-deal-in-Tokyo",
        "content": "Gencom refi in Bermuda. Owner-operator Gencom has refinanced the Rosewood\nBermuda with the loan originated by Blackstone Mortgage Trust and KSL Capital\nPartners for an undisclosed amount. Gencom acquired the Rosewood Tucker’s Point\nmaster-planned estate out of receivership in 2017. Following the acquisition, it\nexecuted a $24 million renovation of the asset. Gencom’s current plan for a $17\nmillion renovation of Tucker’s Point includes improvements to the golf course\nand clubhouse, as well as the Beach Club, which features Bermuda’s longest\nprivate beach. It will also add new amenities and food & beverage options. The\nfirm is also developing the Fairmont Southampton, doubling down on its\ncommitment to Bermuda. Recently, Gencom retook majority ownership in the 291-key\nRitz-Carlton Key Biscayne in Miami in a deal financed by Citigroup and KSL\nCapital Partners. “Bermuda’s tourism and hospitality industries are expanding at\na rapid pace. We’re grateful to contribute to the country’s economic growth with\nthe refinancing and renovation of Rosewood Bermuda and redevelopment of Fairmont\nSouthampton, both of which provide significant jobs and revenue for the country.\nConstruction on the latter has begun, and Gencom is making progress on site\nwork,” Gencom Founder and Principal Karim Alibhai told Hotel Investment Today. \n\nRecord project count in Canada. At 1Q24, there are 314 projects/39,628 rooms in\nCanada’s pipeline, according to Lodging Econometrics. This new record-high in\nproject counts represents an 11% increase in project counts and a 5% increase in\nroom numbers year-over-year (YOY). Currently, there are 70 projects/9,151 rooms\nunder construction in Canada, up 49% and 58% YOY, respectively. Additionally, at\nthe close of the first quarter, there are 80 projects/9,593 rooms scheduled to\nstart construction in the next 12 months while projects and rooms in the early\nplanning stage reached all-time highs of 164 projects/20,884 rooms, increasing\n13% and 1% YOY, respectively. Ontario account for 59% of the projects and 60% of\nthe rooms in the total pipeline, for new all-time highs of 186 projects and\n23,839 rooms.\n\nAzora develops hostel platform. As part of its strategy to develop the Latroupe\nhostel platform Azora has acquired hostels in Dublin and Barcelona with 557 beds\non behalf of its Azora European Hotel and Lodging Fund (AEHL) through a\ntransaction with a fund managed by BlackRock. The Jacobs Inn Dublin and the\nJacobs Inn Barcelona is currently operated by Siggis Capital. The assets are\nsold unencumbered and will be operated by Latroupe, the boutique hostel operator\nowned by AEHL, which combines the facilities of a large hotel with the\natmosphere of a traditional hostel. Latroupe currently manages a hostel\nportfolio comprising three assets in Madrid, Bilbao, and Brussels, with a\ncombined 700 beds. Azora’s entry into Ireland gives it a portfolio of 12,000\nrooms across 41 assets.\n\nYotel will open in Japan in 2025\n\nYotel deal in Tokyo. Yotel, in partnership with Singapore-based Frasers\nHospitality, will open the first Yotel hotel in Japan in early 2025. Yotel Tokyo\nGinza will feature 244 rooms and become the brand’s flagship property. Yotel’s\nwider strategy is to  expand across key cities in Japan, including Osaka, Kyoto,\nSapporo, Yokohama, Fukuoka, Nagoya, and Kobe. The group is also working on\nopportunities to roll out Yotelair – the group’s unique transit hotel concept -\nat key gateway airports and train stations, and part of the brand’s commitment\nto new markets and goal to reach 50 hotels opened and signed by 2025.\n\nMelco’s big deal in Sri Lanka. Melco Resorts & Entertainment Ltd. is partnering\nwith John Keells Holdings, the largest listed conglomerate on the Colombo Stock\nExchange, in their $1 billion plus integrated resort development in central\nColombo. The integrated resort, which had previously been branded “Cinnamon Life\nIntegrated Resort,” will be rebranded as “City of Dreams Sri Lanka” and become\nthe first integrated resort in Sri Lanka and South Asia. It will include 800\nhotel rooms, retail, F&B outlets, MICE facilities, and more. Additionally, a\nwholly-owned local subsidiary of Melco has been awarded a 20-year casino license\nby the Government of Sri Lanka. Melco will fit-out and operate the gaming area\nat City of Dreams Sri Lanka, and Melco will manage the top five floors of the\nhotel under its Nuwa brand of ultra high-end luxury rooms, which represents 113\nof the 800 total hotel rooms at City of Dreams Sri Lanka. Melco and John Keells\nhave agreed all key commercial arrangements and expect fit-out of the casino\narea to begin shortly. The estimated initial investment in the casino is\nexpected to be approximately US$125 million. The non-gaming facilities of the\nintegrated resort, including the 687 key Cinnamon Life hotel managed by John\nKeells, is in the final stages of completion and is expected to open in the\nthird quarter of 2024.\n\nNew CEO at The Lux Collective. The Lux Collective (TLC), Singapore, has\nappointed Olivier Chavy as chief executive officer. Chavy will be responsible\nfor the overall strategic direction and performance of The Lux Collective while\npursuing its expansion. He was previously president of Travel + Leisure Group -\nPanorama, the business line managing the company’s exchange and membership\ntravel brands. Paul Jones will be departing TLC in June 2024 following a 14-year\ntenure as CEO.\n\nGreensboro hotel trades. A group of Charlotte, North Carolina, investors has\nreportedly purchased a Greensboro hotel near the Piedmont Triad International\nAirport for $5 million. iCare Hospitality Greensboro bought the 60-room Clarion\nPointe Greensboro Airport hotel, according to filings with the Guilford County\nRegister of Deeds. The seller was PRBGP Hospitality, which it originally\nacquired the property for $3.58 million in 2016.\n\nCheval Collection to Riyadh. KSA’s Ladun Investment Co. has signed a partnership\nagreement with Cheval Collection for the construction and operation of Ladun\nCheval Living – a tower featuring luxury hotel apartments situated near King\nAbdullah Financial Center in Riyadh. The partnership marks the first project of\nCheval Collection in Saudi Arabia, and will feature 130 residential units of\nvarious sizes, from one to three rooms, along with amenities including a gym,\nswimming pool, and sauna. Construction of the tower with a total cost of up\n£63.8m is set to commence this year with expected completion in 2027.\n\nTrilogy grows in Australia. Newly launched Trilogy Hotels and Panthers Group\nhave signed an agreement that will see Trilogy Hotels oversee operations of the\n153-room Pullman Sydney Penrith in Australia. Panthers Group invested $110\nmillion on the project that opened last August. Trilogy now operates nearly\n1,200 rooms across five hotels.\n\nIHG’s Indigo brand to Bangkok. IHG Hotels & Resorts has signed a deal with\ndeveloper Magnolia Quality Development Corp. for a 274-room Hotel Indigo The\nForestias Bangkok, which will open in 2026 at The Forestias, a new integrated\nmixed-used development on the eastern fringe of Bangkok. The hotel will be\nlocated alongside residential and office space, retail, dining and family\nentertainment options, expansive meeting spaces and a hospital. The Forestias\nwill also be home to another IHG property, Six Senses The Forestias, a 85-room\nhotel and 27 residences development closely attached to a five-hectare forest\npark.\n\nIHCL grows Ginger brand. Indian Hotels Co. Ltd. (IHCL) has signed an agreement\nwith Banaras Beads Exports Pvt. Ltd. to develop a Ginger hotel in Varanasi,\nUttar Pradesh, India. The hotel is a Greenfield project on a fully fitted\noperating lease. The 101-key hotel will feature Qmin, the signature all-day\ndiner, and amenities that include a fitness center and meeting rooms. With this\naddition, IHCL will have 23 hotels in Uttar Pradesh under Taj,\nSeleQtions,Vivanta and Ginger brands, including 10 under development.\n\nJW coming to Jeddah. Marriott International and Al Qimmah Hospitality (a\nsubsidiary of BinDawood Trading) signed an agreement to introduce the JW\nMarriott brand in Jeddah. Situated on the Jeddah Corniche, JW Marriott Hotel\nJeddah is anticipated to offer 280 guestrooms including more than 50 suites.\nPlans for the hotel include two restaurants, a lobby cafe and pool lounge, and\nleisure facilities including a swimming pool, fitness center, and Spa by JW.",
        "summary": "Gencom has refinanced Rosewood Bermuda and is developing Fairmont Southampton. Azora has acquired hostels in Dublin and Barcelona with 557 beds. Melco Resorts & Entertainment has signed a big deal in Sri Lanka. Yotel will open its first hotel in Japan in early 2025.",
        "source": "Hotel Investment Today",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-01-02",
        "title": "Sonia Cheng, scion of Hong Kong’s New World billionaire family, is steering the Rosewood hotel brand to new heights",
        "link": "https://www.hospitalitynet.org/external/4119747.html",
        "content": "When the inaugural World’s 50 Best Hotels ranking was revealed in September\n2023, three Rosewood properties, each located in a different continent, featured\non the list. Taking the number two spot and earning the distinction of “The Best\nHotel in Asia” was Rosewood Hong Kong. Rosewood Sao Paulo ranked at number 27,\nwhile Hotel de Crillon in Paris rounded up the list at number 50.\n\nThe achievement is “a huge recognition to the team and all the effort they have\nput into the brand,” reflected Sonia Cheng, CEO of Rosewood Hotel Group. “For\nthree of our properties to be recognised, and for Rosewood Hong Kong to be\nnumber two in the world, that is a significant recognition.”\n\nCheng, 43, hails from one of Hong Kong’s billionaire family dynasties. Her\ngrandfather, the late Cheng Yu-tung, founded real estate and investment\nconglomerate, New World Development. The elder Cheng’s rags-to-riches story\nbegan when he turned a Macau gold shop into the now renowned Chow Tai Fook\nJewellery chain. His son, and Cheng’s father, Henry Cheng, is now chairman of\nthe businesses.\n\nAfter pursuing a career in banking and finance, Cheng, who graduated from\nHarvard with a major in applied mathematics, joined the family fold at the age\nof 28 to head up its hospitality business. In 2011, New World Hospitality\nacquired Rosewood Hotels & Resorts, then based in Texas, US, for a reported\nUS$229.5 million. Back then, while the Rosewood name was familiar among North\nAmerican travellers, it was not well-known on an international scale.\n\nUnder Cheng’s leadership, Rosewood has since evolved into a global player in the\nluxury hospitality space, with openings in key cities including Beijing, London,\nAbu Dhabi, Munich and more. Its portfolio of 33 one-of-a-kind luxury hotels in\n21 countries also includes legendary properties such as The Carlyle in New York,\nand the Hotel de Crillon in Paris, both of which have undergone a transformation\nunder Rosewood.\n\nThere are currently another 27 hotels in the pipeline, with Cheng describing the\nnext two years as Rosewood’s “peak opening years”, where it will continue to\nexpand in Europe, Japan, the Middle East, China, Mexico, New Zealand and more.\n“The next couple of years is really exciting. Key gateway cities have always\nbeen our target, but we also explore new destinations and projects that we think\nfit the Rosewood philosophy. These projects may not be in gateway locations that\ntravellers expect, but I think what travellers are looking for in this day and\nage is for Rosewood to take them on a journey to explore new destinations.”\n\nLink to source\n\nRead the full article at Rosewood Hotel Group",
        "summary": "The inaugural World’s 50 Best Hotels ranking was revealed in September 2023. Three Rosewood properties, each located in a different continent, featured on the list. Rosewood Sao Paulo ranked at number 27, while Hotel de Crillon in Paris rounded up the list at number 50.",
        "source": "Hospitality Net",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-07-31",
        "title": "Latest HITs: New financing for Raleigh; Pebblebrook earnings; Outrigger deal done",
        "link": "https://www.hotelinvestmenttoday.com/Development/Owners/Latest-HITs-New-financing-for-Raleigh-Pebblebrook-earnings-Outrigger-deal-done",
        "content": "Raleigh loan. Developers of the Raleigh hotel in Miami Beach have finalized a\n$190 million loan from BH3 Management’s Debt Opportunity Fund II to continue\nredevelopment of the historic property. Michael Shvo, Deutsche Finance America,\nand German Institutional pension funds have since last year started work to\nrestore the hotel with 60 suites and add a 42-unit condo tower. The property\nexpected to reopen in 2026 will be managed by Rosewood Hotels & Resorts. The\nmortgage replaces $146.8 million in debt, according to a spokesperson for the\nlender. With a total investment of approximately $1 billion, including a\nsubstantial equity contribution of over $300 million, the restoration and\nexpansion represents one of the single largest investments in Miami Beach.\n\nPebblebrook beat. Pebblebrook Hotel Trust beat the Street with 2Q23 earnings\nthat showed same-property revenue growth of +0.7% and lower expenses and more\nbusiness interruption income than previously estimated. Adjusted EBITDA of\n$116.2 million beat $111 million estimates. RevPAR was flat with ADR coming in\nat -4.5% and occupancy +4.6%. Leadership commentary was in line with other\npublic hotel companies, suggesting fundamentals remain strong. They also noted\nthat more dispositions are being pursued in markets such as Chicago, Los\nAngeles, San Francisco and Washington, D.C.\n\nMCR grows in Arizona. MCR, New York City, has acquired two hotels in Phoenix,\nArizona. The 169-room Holiday Inn Express & Suites Scottsdale – Old Town and the\n121-room Hampton Inn by Hilton Phoenix-Biltmore gives MCR nine hotels in\nArizona. Prices paid and names of the sellers were not disclosed.\n\nStrong signal about rebound. STR has reported that as July 15, 2023, 90% of\nglobal markets are showing growth in RevPAR compared to 2019. This marks the\nhighest proportion of markets in that category since the update began in May\n2022. China played a significant role in that growth with 85% of its markets\nsurpassing 2019 RevPAR levels. At one point last year, China accounted for\none-fourth of the markets with RevPAR levels below those of 2019. Among all\ncountries with a total supply of more than 50,000 rooms, Israel, Switzerland,\nGreece, Italy, and France led in RevPAR on an actual basis. Notably, all five\ncountries were leaders in the last 28-day period, but this time around, Greece\ngrabbed the top spot from Israel. Since the last update, country-level\nperformance has remained stable, with all 48 countries in the 50,000-room group\nreporting occupancy rates above 50%. Ireland continued to lead in occupancy at\nan impressive 88%. Additionally, as the northern hemisphere moves deeper into\nsummer, ADR has been on the rise with nine countries reporting ADR above US$250.\n\nBraintree adds 330 rooms. Braintree Group, Boise, Idaho has acquired three\nproperties, adding 330 rooms to their portfolio. The group’s Resolute Road\nHospitality will manage all three assets. The properties include the Courtyard\nby Marriott Lehi at Thanksgiving Point and the SpringHill Suites by Marriott\nLehi at Thanksgiving Point, both in Lehi, Utah, and the Hilton Garden Inn Las\nVegas/Henderson, in Henderson, Nevada. Braintree plans to launch a substantial\nrenovation to the SpringHill Suites by Marriott and a property refresh of the\nCourtyard by Marriott at the end of 2024. The scope of work for these projects\nwill focus on elevating the guestrooms and a refresh of the hotel’s public\nareas.\n\nElise Capital adds asset. Elise Capital, an Atlanta-based hotel real estate\ninvestment firm, has acquired the 67-room Holiday Inn Express & Suites\nPicayune-Stennis Space Center, Picayune, Mississippi in an off-market\ntransaction from an independent seller for $7.5 million. Synergy Hospitality\nGroup will manage the property.\n\nCrescent grows management. Crescent Hotels & Resort has added the 198-key\nEmbassy Suites by Hilton Washington D.C. Chevy Chase Pavilion to its management\nportfolio.\n\nBraemar financing. Braemar Hotels & Resorts, Dallas, has entered into a $200\nmillion corporate financing vehicle with an initial three-year term and includes\na senior secured term loan facility in an initial principal amount of $150\nmillion and a senior secured revolving credit facility in an initial principal\namount of $50 million. The financing includes the opportunity to expand the\nborrowing capacity up to an aggregate size of $400 million, and there is a\none-year extension option subject to the satisfaction of certain conditions. The\nfinancing is fully prepayable without penalty, and the interest rate is based\nupon a pricing grid related to the company's Net Debt to EBITDA that provides\nfor a range of SOFR + 2.35% to 3.10%. Braemar anticipates that the initial\ninterest rate will be SOFR + 2.85%. The use of proceeds for the financing was to\nrepay the mortgage debt associated with the Ritz-Carlton Sarasota, the\nBardessono Hotel and Spa, and the Hotel Yountville, which will serve as the\nborrowing base for the financing.\n\nTPG growth. TPG Hotels & Resorts, Providence, Rhode Island, will manage The\nBlennerhassett Hotel, Parkersburg, West Virginia. The 140-year-old, 84-room\nhistoric property was purchased in 2019 by R&W Hotels, which is owned and\noperated by local Parkersburg businessmen Wayne Waldeck and Lee Eric Rector.\n\nOutrigger finalizes Maui deal. Outrigger Resorts & Hotels has finalized the\nacquisition of the Kā‘anapali Beach Hotel in Maui, Hawaii and the 432-room hotel\nwill become the Outrigger Kā‘anapali Beach Resort. The deal was first announced\nin May with no purchase price or name of the seller disclosed. Additionally, as\npart of the same transaction, Outrigger took ownership of The Plantation Inn, an\n18-room, adults-only bed and breakfast in historic Lahaina Town. In the last two\nyears, Outrigger has added five beach resorts to its portfolio, including\nOutrigger Kona Resort & Spa on Hawai‘i Island, as well as three properties in\nSouthern Thailand and a luxury resort in the Maldives.\n\nWynn settlement. Las Vegas legend Steve Wynn has agreed to pay a $10 million\nfine and cut ties with the casino business, ending a lengthy legal battle with\nNevada gaming regulators over claims of workplace sexual misconduct. Wynn\nresigned from his namesake gaming company in February 2018 over these\nallegations. Wynn signed a seven-page document on July 17 acknowledging he had\nbeen accused of “failure to exercise discretion and sound judgment” to prevent\nactions that “reflected negatively on the reputation” of Nevada and its gambling\nindustry. Now 81, he lives in Florida and via a statement said he “looks forward\nto moving on to other phases of his life.” The fine is reportedly the largest\never imposed by the commission, second only to a $20 million fine in 2018 to\nWynn Resorts for failing to investigate the sexual misconduct claims made\nagainst Wynn.\n\nNero's Theatre under Four Seasons. Archaeologits have discovered the ruins of\nNero’s Theatre under the garden of what will become a Four Seasons hotel near\nthe Vatican in Rome. Archaeologists have excavated deep under the walled garden\nof the Palazzo della Rovere since 2020 as part of planned renovations on the\nfrescoed Renaissance building. The palazzo, which takes up a city block along\nthe broad Via della Conciliazione leading to St. Peter's Square, is home to an\nancient Vatican chivalric order that leases the space to a hotel to raise money\nfor Christians in the Holy Land. The hotel is expected to be open in time for\nthe Vatican's 2025 Jubilee, when an estimated 30 million people and pilgrims are\nexpected to flock to Rome. Among the discoveries: 10th century glass-colored\ngoblets and pottery pieces that are unusual because so little is known about\nthis 15th century period in Rome. Officials said the portable antiquities would\nbe moved to a museum, while the ruins of the theater structure itself would be\ncovered again after all studies are completed.\n\nSix Japan hotel trades. Tokyo-based Hospitality and Residential REIT Invincible\nInvestment Corp. has acquired six hotels there from U.S. Asset Manager Fortress\nInvestment Group for JPY 57.2 billion. The deal includes properties in Okinawa,\nNagano, Okayama, Aomori, Chiba, and Akita. The portfolio acquisition will bring\nInvincibles’ assets under management to JPY 548.6 billion with 92 hotels valued\nat JPY 507.8 billion.\n\nMalaysia development. Malaysia-based Highlands Parkcity Sdn Bhd, in partnership\nwith Malaysia-based Yuk Tung Group and the Association for the Promotion of\nHigher Education in Malaysia, will develop Genting Highlands’ first CBD and\nintegrated entertainment hub – King’s Park. With a gross development value of\n$2.1 billion, King’s Park will span over 61 hectares of freehold land and will\ntake place over five phases. The first phase is expected to be completed by 2026\nand will feature a commercial center and pedestrian street shops. Other phases\nwill feature the construction of hotels with serviced apartments, two\ninternationally branded theme parks, a halal dining hub, and a Syariah compliant\nhotel with housing units. To date, it has been confirmed that Swissôtel will\noperate a hotel in late-2028. The final phase of the project to be completed in\n8 to 10 years will include a wellness and medical center.\n\nBanyan Tree appointment. Determined to extend its expansion efforts into the\nU.S., Caribbean and Latin America, Banyan Tree Group in Miami has named Tom\nRiley senior executive director, Acquisitions and Development. He has held\nleadership roles at Marriott International, Hilton, Remington Hotels and Kimpton\nHotels and Restaurants. He played a pivotal role in expanding Kimpton's\nportfolio throughout the Eastern United States, Caribbean and Latin America.",
        "summary": "Pebblebrook Hotel Trust beat the Street with 2Q23 earnings that showed same-property revenue growth of +0.7% and lower expenses. MCR, New York City, has acquired two hotels in Phoenix, Arizona. Braintree Group, Boise, Idaho has acquired three properties, adding 330 rooms to its portfolio.",
        "source": "Hotel Investment Today",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-03-20",
        "title": "Rosewood Hotel group's expansion highlights growth in Europe and beyond",
        "link": "https://hospitality-on.com/en/hospitality/rosewood-hotel-groups-expansion-highlights-growth-europe-and-beyond",
        "content": "1 min reading time\n\nPublished on 20/03/24 - Updated on 20/03/24\n\n\nROSEWOOD HOTEL GROUP IS UNDERGOING GROWTH AND TRANSFORMATION ACROSS ITS RENOWNED\nBRANDS, WITH A PARTICULAR FOCUS ON EXPANDING ITS PRESENCE IN EUROPE.\n\n\n\nIn recent years, Rosewood Hotels & Resorts, the luxury brand under the Rosewood\nHotel Group umbrella, has seen growth. This expansion is set to continue in\n2024, with the anticipated openings of Rosewood Amsterdam in the Netherlands and\nRosewood Schloss Fuschl in Austria. These new additions to the portfolio will be\ncomplemented by upcoming properties in Greece, Venice, Milan, Rome, and a second\nhotel in London, The Chancery Rosewood, further enhancing Rosewood's presence\nacross the continent.\n\nAdditionally, Rosewood Hotel Group's expansion extends to other regions,\nincluding the Middle East, Asia Pacific, and the Americas. In the Middle East,\nproperties like Rosewood Doha in Qatar are set to debut, while Saudi Arabia will\nwelcome new hotels like Rosewood Diriyah and Rosewood Red Sea. In Asia Pacific,\nRosewood Miyakojima in Japan and New World Chongqing Hotel in China will cater\nto the growing demand for luxury accommodations. In the Americas, properties\nlike Rosewood Mexico City and Rosewood Mandarina in Mexico are slated to join\nthe portfolio.\n\nIn addition to hotel offerings, Rosewood Hotel Group is expanding its branded\nresidential business, Rosewood Residences. With a selection of estate homes,\nluxury villas, and serviced apartments, Rosewood Residences offers buyers an\nopportunity to experience the Rosewood lifestyle beyond a traditional hotel\nstay. Furthermore, Rosewood Hotel Group's holistic wellness concept, Asaya, will\nsee expansion with new launches in 2024.\n\n\n\nEvery week, the HON team brings you an expert look at the world of hospitality.\nBy becoming a member, you will have access to a complete ecosystem: exclusive\ncontent, jobs, etc.",
        "summary": "Rosewood Hotels & Resorts, the luxury brand under the Rosewood Hotel Group umbrella, has seen growth. The expansion is set to continue in 2024, with the anticipated openings of Rosewood Amsterdam in the Netherlands and Rosewood Schloss Fuschl in Austria.",
        "source": "Hospitality ON",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-05-04",
        "title": "Latest HITs: US ADR growth beats inflation; $340M for Ritz condos; new CEO at Mandarin",
        "link": "https://www.hotelinvestmenttoday.com/Development/Brands/Latest-HITs-US-ADR-growth-beat-inflation-340M-for-Ritz-condos-new-CEO-at-Mandarin",
        "content": "Inflation buster. Average U.S. ADR growth has surpassed inflationary growth by\n55 bps from 1988 to 2022, according to new data from JLL. In fact, during the\nelevated inflationary period of 2022 and the first quarter of 2023, the U.S.\nhotel industry has been able to significantly outpace inflation growth. In Q1\n2023, ADR growth exceeded inflation growth by 4.3 percentage points. This\noutperformance is attributed to robust leisure demand and the resurgence of\ngroup and corporate travel.\n\nFinancing for Ritz-Carlton condos. Catalfumo Companies has received $340 million\nin financing from Madison Realty Capital to build The Ritz-Carlton-branded condo\ndevelopment in Palm Beach Gardens, Florida. The deal is South Florida’s largest\nconstruction loan since the Federal Reserve began raising interest rates in\nMarch 2022. The project is set to include 106 units across three buildings, as\nwell as a 29-boat slip marina. Since launching sales in February, the project\nhas already garnered $75 million in sales, according to Daniel Catalfumo,\nfounder of Palm Beach Gardens-based Catalfumo Companies. Asking prices for condo\nunits range between $4 million and $8 million. Construction is set to begin in\nlate summer 2023 with completion expected in 2025.\n\nNew CEO for Mandarin. Mandarin Oriental International appointed Laurent Kleitman\nas chief executive officer, effective September 1, succeeding James Riley.\nLaurent was most recently the president and chief executive of Parfums Christian\nDior, the largest luxury fashion beauty business of LVMH. Prior to joining LVMH\nin 2019, Laurent was president of the Consumer Beauty division of Coty. Prior to\nthat, he spent 25 years at Unilever and held global and regional leadership\nroles covering the UK, Europe, and Asia, across its personal care, home care,\nand food businesses.\n\nRosewood to Seoul. Rosewood Hotels & Resorts has been appointed by Korean real\nestate developer Eleven D&C Co. to manage the 250-room Rosewood Seoul, a new\nbuild ultra-luxury hotel set to open in 2027. Situated beside Yongsan Park in\nthe heart of the city, the hotel will exist within The Parkside Seoul, a\nrevolutionary development occupying the former site of the United Nations\nCommand. The architecture will be led by Kohn Pedersen Fox Associates.\n\nIHG adds in Riyadh. IHG Hotels & Resorts has signed a management agreement with\nThe King Abdullah Financial District Management and Development Co. (KAFD DMC),\na subsidiary of Saudi Arabia’s Public Investment Fund (PIF), to bring the first\nKimpton hotel in the region to Riyadh, Saudi Arabia. The 212-key Kimpton Riyadh\nis set to open in June 2024. IHG currently operates 37 hotels across five brands\nin Saudi with 31 hotels in the development pipeline set to open within the next\nthree to five years.\n\nCycas grows in Germany. Cycas Hospitality has been appointed to manage its the\nluxury Grandhotel Bad Pyrmont spa hotel near Hanover, Germany. Comprising two\nadjoining properties, the 5-star hotel includes 151 guest rooms (including nine\nsuites), within the Steigenberger Hotel and Spa and the 44-room Fürstenhof\nHotel, which has recently undergone renovation. The hotel is set to commence an\nextensive E20 million refurbishment program later this year.\n\nAsia GOPPAR beats 2019. Most of Asia Pacific’s key hotel markets surpassed their\n2019 levels in gross operating profit per available room (GOPPAR), according to\nSTR’s March 2023 P&L data release. Bali’s March GOPPAR reached US$52.92, which\nwas 227.6% of the pre-pandemic comparable. In February, the market reported\nGOPPAR at US$41.90, which was 121% of the 2019 level. New Delhi followed with a\nGOPPAR of US$82.40, which was 164.4% of the 2019 comparable. The GOPPAR level\nwas slightly lower than February (US$101.71). While improved over February, Hong\nKong’s GOPPAR was just 76.1% of the 2019 comparable.\n\nPrizeotel expands. Radisson Hotel Group has signed it first prizeotel in the UK\nand Ireland region. Scheduled to open in Q1 2025 in Dublin, the hotel will\nfeature 145 rooms. The brand is currently present in Germany, Austria,\nSwitzerland, and Belgium, and includes 17 properties, representing more than\n3,400 rooms. Additional openings and signings in European destinations will be\nannounced soon with a particular focus on the UK and Ireland.\n\nHost's big 1Q beat. Again, improvement in group business continues to drive\nstrong 1Q23 earnings with Host Hotels & Resorts delivering strong results,\nbenefitting from operational improvements across its portfolio. Notably,\ncomparable RevPAR increased 31% over 1Q22, exceeding the top end its guidance by\nfour percentage points. Host repurchased $50 million of stock in the first\nquarter. Host also raised its full year RevPAR growth guidance range to 7.5% to\n10.5%. Comparable hotel Total RevPAR was $365.93 and comparable hotel RevPAR was\n$217.77 in the first quarter, representing an increase of 34% and 31.1%\nrespectively, over the first quarter of 2022, benefiting from easier comparisons\ndue to the impact of the COVID-19 Omicron variant on first quarter 2022\noperations. Comparable hotel Total RevPAR and comparable hotel RevPAR increased\n10.3% and 7.4% respectively, in comparison to the first quarter of 2019.\nPerformance was driven by continued strong leisure demand, while also benefiting\nfrom growth in city center markets. Host generated GAAP net income of $291\nmillion in the first quarter and GAAP operating profit margin of 18.0%, an\nimprovement of 660 basis points compared to the first quarter of 2022, as food\nand beverage margins improved 490 basis points to 37.6%, due to strong\ncontributions from group business. Host achieved comparable hotel EBITDA of $439\nmillion and Adjusted EBITDAre of $444 million, both of which exceeded 2022 first\nquarter results. Strong improvement in occupancy of 14 points coupled with rate\ngrowth of 4.2% over first quarter of 2022, led to comparable hotel EBITDA margin\nof 32.5% for the first quarter of 2023, exceeding the first quarter 2022 margin\nby 220 basis points. The company also announced plans to develop and sell 40\nfee-simple condominiums on a five-acre development parcel at Golden Oak in\nOrlando, adjacent to Four Seasons Resort Orlando at Walt Disney World Resort. It\nalso sold The Camby, Autograph Collection for $110 million and recorded a gain\non sale of $69 million. In connection with the sale.\n\nOnyx launches Shama Luxe. Thailand-based Onyx Hospitality Group has signed a\nbusiness alliance agreement with Walton Asset Management Co. to manage Shama\nLuxe Sukhumvit Bangkok, a 52-unit luxury serviced apartment in the heart of\nBangkok. The signing expands its Shama brand and launches the Shama Luxe brand\ninto the luxury serviced apartment market. The launch of Shama Luxe Sukhumvit\nwill bring the number of Shama's in Bangkok to six, equaling the number of\nproperties in Hong Kong. By the end of the year, three more locations will be\nadded to the portfolio in Hong Kong and Malaysia, with Shama Johor Bahru, Shama\nMedini Iskandar and Shama Hub Metro South Hong Kong. This will bring the brands\ntotal inventory to 19 properties in 2023.\n\nCMBS delinquencies hold steady. The latest Trepp CMBS Delinquency Report reveals\nrates held steady at 3.09%. Declines in the retail, lodging, and multifamily\nrates offset a small increase in industrial loans and a bigger increase for\noffices. Office remains the most heavily watched part of the market as firms\nlook to aggressively reduce space. Sublease space is at or near record highs in\nmany markets as demand from big tech firms has eroded sharply. In addition, many\ncompanies are letting leases expire or are renewing for smaller footprints. The\nall-time high on this basis was 10.34% registered in July 2012. The COVID-19\nhigh was 10.32% in June 2020.\n\nIntroducing The Pomp. The Cordish Companies and Caesars Entertainment announced\ntheir Pompano Beach development, The Pomp, will be anchored by a dynamic Live!\ndining and entertainment district. Located 35 miles north of Miami and less than\n10 miles north of Fort Lauderdale, the 223-acre project is one of the largest\ndevelopments in South Florida. Once complete, The Pomp will bring together\nentertainment, dining, hotel, retail, residential, office and lifestyle\namenities, alongside the Harrah’s Pompano Beach casino. The Pomp will feature\n1.3 million square feet of retail and entertainment space, 4,000 luxury\nresidential units, two hotels and 1.35 million square feet of Class A office\nspace upon completion.",
        "summary": "Average U.S. ADR growth has surpassed inflationary growth by                55 bps from 1988 to 2022. Catalfumo Companies has received $340 million in financing to build The Ritz-Carlton-branded condos in Palm Beach Gardens, Florida. IHG Hotels & Resorts has signed a management agreement with the King Abdullah Financial District Management and Development Co. (KAFD DMC) to bring the first Kimpton hotel in the region to Riyadh.",
        "source": "Hotel Investment Today",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-02-16",
        "title": "Rosewood Hotels & Resorts announces new Regional Vice President - Sleeper",
        "link": "https://www.sleepermagazine.com/stories/people/rosewood-hotels-resorts-announces-new-regional-vice-president/",
        "content": "Vincent Billiard has been named as the new Regional Vice President of Central\nand North Europe for Rosewood Hotels & Resorts. \n\nPoised to support the brand’s expansion into Europe, Billiard will hold the\nposition in addition to his role as Managing Director of Hôtel de Crillon, A\nRosewood Hotel. He will supervise Rosewood hotels across Paris, London, Munich\nand Vienna, as well as two openings planned for Amsterdam and Schloss Fuschl in\n2024. \n\n“I am delighted and honoured to be able to continue contributing to Rosewood’s\nEuropean expansion,” says Billiard. “Working in close collaboration with the\nteams, I am confident that my international experience in the luxury hotel\nsector will enable me to support, guide and advance the pursuit of excellence\nwithin our properties.” \n\nOriginally from Paris, Billiard graduated from the EHL Hospitality Business\nSchool before joining The Ritz-Carlton in 2003. He was appointed as General\nManager of Hôtel de Crillon, A Rosewood Hotel, in January 2020.\n\nCREDITS\nPHOTOGRAPHY: © FABIEN BREUIL",
        "summary": "Vincent Billiard has been named as the new Regional Vice President of Central and North Europe for Rosewood Hotels & Resorts. He will supervise Rosewood hotels across Paris, London, Munich and Vienna, as well as two openings planned for Amsterdam and Schloss Fuschl.",
        "source": "Sleeper Magazine",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-03-28",
        "title": "This German City Just Welcomed A Brand-New Rosewood Hotel",
        "link": "https://www.travelandleisureasia.com/hk/hotels/europe-hotels/munich-just-welcomed-a-brand-new-rosewood-hotel/",
        "content": "TAKE A PEEK INSIDE THE LUXURIOUS ROSEWOOD MUNICH, WHICH IS BRINGING A NEW SENSE\nOF GLAMOUR TO THE GERMAN CITY.\n\n\nImage Credit: Rosewood Munich\n\nAs a travel writer, I see a lot of hotels aim to recreate the illusive feeling\nof “home.” That’s a worthy goal, of course, but sometimes, you just want a\ncapital-v Vacation. So, while a good hotel can make you feel as comfortable as\nyou would at home, a great hotel can offer you something even better — a feeling\nof belonging in a brand-new, upgraded, and wholly unique space. The new Rosewood\nMunich does exactly that.\n\n“Munich hasn’t seen this before — a hotel with a vibe,” Radha Arora, president\nof Rosewood Hotels & Resorts, told me over cocktails at the hotel’s opening fête\nin October. The hotel, he added, “speaks to the community, with all the artists\nwe showcase, it speaks to place. We have great confidence in this location.”\n\nThe Rosewood Munich, as it stands now, is the culmination of a project 10 years\nin the making. And it’s just as spectacular as you’d expect a decade’s worth of\nwork to be.\n\n\nALL YOU NEED TO KNOW ABOUT THIS BRAND-NEW ROSEWOOD HOTEL IN MUNICH\n\n\n\nImage Credit: Rosewood Munich\n\nEvery space, including the lobby, 132 guest rooms, restaurant Brasserie\nCuvilliés, and Asaya Spa, is decked out in muted earth tones, light woods, and\npops of royal blues and decadent, emerald green velvet furnishings you simply\ncannot stop running your hands over.\n\nThis includes the hotel’s signature Maximillian Suite, named after a royal\nBavarian family, that sports more than 2,500 square feet of living space,\nincluding a full kitchen and soaking tubs in each bathroom, which starts at\naround USD 25,000 (HKD 195,687) a night. All these glamorous decor touches are\nthanks to Tara Bernerd & Partners, who worked alongside the Munich-based\narchitectural firm Hilmer Sattler to ensure the space honoured its location\nwhile creating the most welcoming (and decadent) space possible.\n\n“Rosewood Munich is our first project in Germany with Rosewood Hotels & Resorts\nand is a key moment for us,” Bernerd shared in a statement. “We have sought to\nbring a refined residential style with a contemporary take on Baroque\narchitecture. This elevated sense of sophistication will provide a place for\nlocals and distinguished travellers to come together in this vibrant and\neclectic city.”\n\n\n\nImage Credit: Rosewood Munich\n\nWhile the Rosewood Munich still has that brand-new hotel smell, it somehow feels\nlived in. It’s massive, yet cosy. Walking through the common spaces, you’re\nbound to find friends, old and new, gathering for tasty chocolates set out on\nthe table, guests reading books while lounging on the plush chairs next to the\npicture windows, and perhaps even a four-legged companion or two laying out as\nif they owned the place.\n\nHowever, there is one spot you may or may not get to see while you’re at the\nhotel — its ultra-exclusive and downright secretive speakeasy, known as 100B. I\ndon’t want to give away too many details here, as half the fun is finding it for\nyourself. However, I did get a sneak peek at 100B, which is well\nhidden-somewhere near the bar. It’s as sexy a place as they come, with rich, red\nleather furnishings, dim lighting, and some fantastically rare spirits behind\nthe bar, including a few bottles of Pappy Van Winkle that will send any whiskey\nlover into full-on fanfare. Want to get in? Try to make friends with a hotel\nbartender. He or she might reveal the secret code and the location. Just don’t\nbe surprised if they look at you in total bewilderment when you ask about 100B,\nas it truly is meant to stay exclusive.\n\nHere’s what else you need to know about the hotel and my full review of the new\nRosewood Munich.\n\n[myaffiliate type=”normal” button_name=”Shop the best travel experiences here ”\nurl=”https://experiences.travelandleisureasia.com/” align=”center”\nclass=”affiliate-one”\n\n\nTHE ROOMS\n\n\n\nImage Credit: Rosewood Munich\n\nThe hotel has 73 spacious guest rooms and 59 suites, including five exclusive\nhouses, which are massive, apartment-style accommodations ideal for big groups\nor extended-stay guests. Entry-level rooms range from EUR 700 (HKD 5,941) – EUR\n2,750 (HKD 23,342); while suites range from EUR 1,200 (HKD 10,185) – EUR 4,650\n(HKD 39,469); and houses range from EUR 4,300 (HKD 36,498) – EUR 35,000 (HKD\n297,081). Every room has a fantastic view of either the Munich city skyline or\nits interior courtyard. Expect bespoke furnishings, minibars filled with local\ntreats, and marble bathrooms with not-to-miss rosemary-infused shampoos that\nwill leave your hair smelling better than ever.\n\n\nTHE SPA\n\n\n\nImage Credit: Rosewood Munich\n\nThe hotel’s Asaya Spa draws much of its decor and treatment inspiration from its\nalpine surroundings. Here, guests can indulge in holistic treatments using\nproducts by Dr Barbara Sturm, OTO, Ground Wellbeing, and EviDenS de Beauté. The\n1,300-square-foot spa includes an indoor pool, dual saunas, steam rooms, and six\ntreatment rooms. I recommend springing for The Aufguss Journey, a 120-minute\ntreatment that uses aromatherapy and happens over three phases — a body scrub, a\nwrap, and a massage. I loved that the treatment uses a native pine and spruce\nblend for that all-important “sense of place” the Rosewood is known for.\n\n\nFOOD AND DRINKS\n\n\n\nImage Credit: Rosewood Munich\n\nRosewood Munich is bringing more fine dining to the city thanks to Cuvilliés.\nThe brasserie is open to both guests and locals who wish to come enjoy meals\nbuilt around ingredients sourced from the region, including Helmut Schlader\nAlpine caviar, Wagyu beef from Tegernsee, and lamb from a breeder in Jochberg,\nlocated just two hours away. The menu highlights include bites of steckerlfisch\n(grilled fish) alongside spinach dumplings, and, of course, wiener schnitzel.\nBut please don’t overlook the Celeriac Cream Soup as an appetiser. Made with\ntruffle, spices, and white balsamic, it’s the perfect start to a hearty meal.\n\nFollowing your last bite, make your way to Bar Montez, where you can not only\nget a craft cocktail, wine, or local beer, but you can also take in live music\nby jazz musicians strumming in the corner.\n\n\nRELATED STORIES\n\n\nACTIVITIES AND EXPERIENCES\n\nThere is a dedicated concierge team at the hotel to assist guests in planning a\nbespoke itinerary. The team can help book exclusive guided tours through local\nmuseums like the Museum of Urban and Contemporary Art (MUCA), as well as visits\nto historic destinations like the Nymphenburg Palace or more adrenaline-filled\nactivities like BMW Driving Tours.\n\n\nFAMILY-FRIENDLY OFFERINGS\n\n\n\nImage Credit: Rosewood Munich\n\nKids are also more than welcome at the hotel. The concierge team is happy to\ncreate experiences just for them, including local cooking classes and arts and\ncrafts sessions. The hotel is also happy to assist in babysitting services so\nparents can head out for a night on the town sans kids.\n\n\nACCESSIBILITY AND SUSTAINABILITY\n\nThe Rosewood Munich is ADA compliant, offering three ADA-compliant rooms, and\nhas a ground-floor elevator to allow easy access in and out of the building. As\nfor sustainability, during the hotel’s construction, the team recycled 96\npercent of the materials from the demolition to use in the new space, including\n1,500 tons of metal, cables, copper pipes, reinforced concrete, and glass. This\nhotel, like other Rosewood properties, is in line with Rosewood’s principle of\n“Relationship Hospitality,” meaning it has a close relationship with local\nsuppliers to reduce environmental demands on the supply chain. And, perhaps most\nimpressive of all, the brasserie kitchen has bins to convert waste to energy,\nwhich powers part of the restaurant.\n\n\nHOW TO GET THE MOST VALUE\n\n\n\nImage Credit: Rosewood Munich\n\nThere are a few ways to maximise your value at Rosewood. Book one of the\nRosewood Escapes, which includes complimentary breakfast for two, complimentary\naccess to Asaya Spa, and complimentary access to the fitness suite. There is\nalso the More Rosewood Offer, which offers a complimentary third night for every\ntwo consecutive paid nights and includes complimentary access to Asaya Spa.\nFinally, there’s the Suite Sojourn, which provides a 20 percent discount on the\nhotel’s best available rate and includes access to the spa and fitness centre.\n\nBook your stay at Rosewood Munich via Booking.com\n\nBook your stay at Rosewood Munich via Agoda.com\n\n(Feature image credit: Rosewood Munich) \n\nThis story first appeared on travelandleisure.com\n\nAll currency conversions were done at the time of writing\n\nRelated: 20 Of The Best Places To Visit In Germany For Breathtaking Mountains,\nMedieval Towns, And Moving Historic Sites\n\nNote:\nThe information in this article is accurate as of the date of publication.\nWe may earn an affiliate commission when you shop through links on our site.\n\n\nWRITTEN BY\n\n\nSTACEY LEASCA",
        "summary": "The new Rosewood Munich is the culmination of a project 10 years in the making. Every space, including the lobby, is decked out in muted earth tones, light woods, and decadent, emerald green velvet furnishings. The hotel’s signature Maximillian Suite, named after a royal Bavarian family, sports more than 2,500 square feet of living space.",
        "source": "Travel and Leisure Asia",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-10-30",
        "title": "Latest news: McKillen sells stake in Irish group; update on troubled SF hotels",
        "link": "https://www.hotelinvestmenttoday.com/Development/Brands/Latest-news-McKillen-sells-stake-in-Irish-group-update-on-troubled-SF-hotels",
        "content": "McKillen sells stake in Dean Hotel Group. Ireland’s The Dean Hotel Group has\nagreed to sell a majority stake to an investment vehicle that is managed and led\nby London-based Lifestyle Hospitality Capital Group and backed by funds advised\nby Elliott Investment Management. Dean Hotel Group Founder Paddy McKillen, Jr.\nand the McKillen Co. will retain a stake and remain involved in the business\nwith about eight hotels and 650 rooms. Further terms of the deal were not\ndisclosed. The hotels will continue to be managed and operated by The Dean Hotel\nGroup under its own brands, including The Dean, The Mayson, The Clarence, The\nDevlin, The Leinster and Glasson Lakehouse. The Dean brand has three hotels\noperating in Ireland, with two hotels set to open in the U.K. by 2025. The\nrestaurants and bars will also continue to be operated internally by The Dean\nHotel Group under its own brands such as Sophie’s, Ryleigh’s, Roberta’s and\nLayla’s.\n\nReceiver appointed to sell Park properties in SF. Nearly five months after Park\nHotels & Resorts announced it had stopped making payments on a $725 million CMBS\nloan backed by two of the largest hotels in San Francisco, receiver HotelAVE has\nbeen appointed to take control of the Hilton Union Square and Parc 55 pending a\nsale. The receiver was appointed after Wilmington Trust, a trustee representing\nthe lender, filed a lawsuit. HotelAVE will have until September 1, 2024, to find\nan adequate buyer for the properties. If the receiver doesn’t sell the two\nhotels before the deadline, the properties will go into nonjudicial foreclosure.\nThe two hotels were valued at a combined $1.56 billion when the CMBS packaged\nfor them was issued in 2016 by JPMorgan Chase. In addition, a report has\nsurfaced that Blackstone is in discussions with CWCapital, a special servicer\nworking on behalf of a CMBS trust, for a “possible deed-in-lieu” deal on the\n346-room Club Quarters hotel in San Francisco. In 2020, Blackstone defaulted on\na $274 million loan backed by the hotel and other Club Quarters properties in\nBoston, Chicago and Philadelphia.\n\nTrinity goes to London. As part of a global expansion plan, investor Trinity\nInvestments, Honolulu, has opened a London office under the leadership of\nManaging Partner Ryan Donn. The office will target hospitality assets in western\nEurope with an emphasis on the UK, Ireland, Spain, Portugal, Italy and\nSwitzerland. Donn has been with Trinity since 2007, and the firm expects to\ncontinue building its U.K. presence while maintaining support from more than 40\nprofessionals based in the U.S. This business expansion follows an active year\nfor Trinity, which executed the largest hospitality acquisition of 2023 with its\ninvestment in The Diplomat Beach Resort, and which secured approximately $1.2\nbillion in combined refinancings for its existing portfolio assets.\n\nBoston Park Plaza buyer named. Developer Parks Hospitality Holdings from Mexico\nCity has been named as the buyer of the 1,060-room Boston Park Plaza for $370\nmillion ($349,000 per key) from Sunstone Hotel Investors. The property is\nalready trading under the Hilton banner and will be rebranded after a major\nrenovation. The hotel was listed for sale in January 2023 and no seller\nfinancing was required, according to reports, as the buyer obtained a $200\nmillion mortgage loan. the hotel traded for 12.1x Hotel EBITDA and a 7.1% NOI\ncap rate. Sunstone acquired the hotel in 2013 for $250 million.\n\nTampa assets sold. The dual-branded, 177-room Courtyard and Residence Inn Tampa\nOldsmar has been acquired by KMD Hospitality Management from MIG Real Estate\nGroup. Hunter Hotel Advisors arranged the sale of behalf of MIG. Terms of the\ndeal were not disclosed.\n\nCanada pipeline. The construction pipeline in Canada stands at 275\nprojects/37,780 rooms, up 5% by projects and 8% by rooms year-over-year (YOY),\naccording to Lodging Econometrics. In the third quarter, Canada had 22 new\nproject announcements with 2,816 rooms. Hotel projects presently under\nconstruction in Canada at Q3 stand at 56 projects/8,228 rooms, up 4% and 18%\nYOY, respectively. Projects scheduled to start construction in the next 12\nmonths stand at 101 projects/11,548 rooms at Q3, while projects in the early\nplanning stage stand at 118 projects/18,004 rooms; a 13% YOY increase by\nprojects and a 33% YOY increase by rooms. Hotel renovations in Canada at Q3\nstand at 40 projects/5,469 rooms, and brand conversions ended the quarter at 58\nprojects/6,025 rooms. Ontario continues to lead Canada’s hotel construction\npipeline with 160 projects and a record high of 22,294 rooms, accounting for 58%\nof the projects and 59% of the rooms in the country’s total pipeline.\n\nPoint A platform grows. Tristan Capital Partners’ latest opportunistic fund\nEuropean Property Investors Special Opportunities 6 (EPISO 6) and Queensway have\ncompleted the purchase of a 63,195 sqft office property on St. Andrew Square in\nEdinburgh, Scotland from PATRIZIA Hanover PUT (Patrizia). The deal will mark the\nfirst add-on investment to the Fund’s Point A Hotel platform, held in a joint\nventure with Queensway, subject to planning. The transaction will expand the\nfootprint of the platform to 12 locations across the UK and Ireland. The fund\nacquired a majority stake in the Point A platform in 2022, which at the time\ncomprised a portfolio of 10 operating and one development in the UK and Ireland.\nThe shareholders have committed significant additional equity to fund this phase\nof growth for the platform with a particular focus on strategic locations in\nLondon.\n\nVirginia property trades. The Hotel Weyanoke in Farmville, Virginia, has been\nacquired by investment bank Ascend Capital Group in partnership with Taylor\nHospitality. Taylor Hospitality will provide management for the\nWeyanoke.Rosewood to Crete. Following a reincarnation of the existing resort,\nRosewood Hotels & Resorts will open in 2025 the 154-room Rosewood Blue Palace on\nthe Greek island of Crete.\n\nStrong extended-stay ADR growth. Extended-stay hotel revenue growth accelerated\nin September, according to The Highland Group.  While occupancy declined\nslightly for the sixth consecutive month, the strongest average rate gain since\nMay lifted RevPar 2.7% and room revenues 5%. “Extended-stay hotel’s 10.7\npercentage point occupancy premium above the overall hotel industry in September\nis within the long-term annual average range over the last 25 years,” said Mark\nSkinner, partner at The Highland Group.\n\nKasa Living funding. To further fund expansion, Kasa Living has closed a $70\nmillion Series C fundraise. Citi Ventures and FirstMark Capital led the\nall-equity round with participation from new investors New York Life Ventures\nand Fireside Investments. All major existing investors, including RET Ventures,\nZigg Capital, and Ribbit Capital, participated in the twice upsized and\noversubscribed round. Jonathan Langer, with board experience at KKR Real Estate\nFinance Trust, Westin Hotels & Resorts, and Hilton Hotels & Resorts has joined\nKasa's Board of Directors. Kasa Living is a tech-powered, flexible\naccommodations brand and operator founded in San Francisco in 2016 by Roman\nPedan. It partners with real estate owners to transform investor-owned\nmultifamily apartments, boutique hotels, and single-family homes into managed\naccommodations.\n\nDallas biggest US construction market. The top five U.S. markets with the\nlargest hotel construction pipelines by projects at 3Q23 are led by Dallas, with\nan all-time high of 189 projects/21,840 rooms, followed by Atlanta, with 140\nprojects/17,775 rooms, and Nashville, with 122 projects/16,046 rooms. Next is\nPhoenix, with 119 projects/16,455 rooms, and the Inland Empire, with 117\nprojects/11,784 rooms, according to Lodging Econometrics. At the 3Q close, New\nYork City continues to have the greatest number of projects under construction,\nwith 46 projects/8,386 rooms. Phoenix follows with 26 projects/5,353 rooms, then\nAtlanta with 26 projects/4,354 rooms, Dallas with 25 projects/3,178 rooms, and\nfinally the Inland Empire with 23 projects/2,386 rooms. Dallas has the most\nprojects scheduled to start in the next 12 months with 80 projects/9,021 rooms,\nfollowed by Atlanta with 60 projects/7,311 rooms, Austin with 47 projects/5,683\nrooms, the Inland Empire with 47 projects/4,668 rooms, and then Los Angeles with\n46 projects/7,113 rooms. The renovation and conversion pipeline activity remains\nstrong in the U.S. at Q3 with 1,912 hotels/285,568 rooms presently under\nrenovation or conversion.\n\nPebblebrook earnings. Pebblebrook Hotel Trust reported 3Q23 earnings that showed\na net loss of $56.5 million and same-property Total RevPAR increasing 0.2%\nversus 2022, with urban markets rising 4.3%. Tropical Storm Hilary and Hurricane\nIdalia negatively impacted RevPAR growth by approximately 90 bps. Urban\nperformance continues to improve and 4Q23 group and transient revenue pace is up\n13% compared to 4Q22. “Our third quarter bottom line results were at the top end\nof our expectations, even after the negative impact of severe weather events on\nboth coasts and the labor strikes in the entertainment industry that primarily\naffected our Los Angeles properties,” said Pebblebrook Chairman and CEO Jon\nBortz. “We continued to see healthy occupancy improvements in our urban market\nhotels, driven by improving group and transient business travel, as well as\nsolid gains in weekend leisure demand. Our third quarter resort portfolio\noccupancy was flat year-over-year, though it would have been higher if not for\nthe severe weather events.”\n\nNew Comfort prototype unveiled. Choice Hotels International unveiled a new\nComfort hotels look and feel with the opening of the first, new construction\nRise & Shine prototype in Mountain Grove, Missouri. The 56-room property was\ndeveloped by Thompson Lodging and includes an outdoor patio anchored by an\nindoor/outdoor fireplace. Public spaces with high ceilings and floor-to-ceiling\nwindows maximize natural lighting. A multi-purpose flex room converts to serve a\nvariety of uses. Guestrooms featuring upgraded fixtures and furniture, including\nsemi-open closets and new “on the go” stations by the door. Functional lighting\nthroughout the prototype includes the front desk welcome wall, public space\nmillwork shelving, up-lighting on the guest room headboard wall and media panel\nand on the prototype exterior.\n\nHyatt milestone in China. Hyatt Hotels Corp. opened the 289-room Hyatt Regency\nChangshu Kuncheng Lake, marking the first international-branded hotel in\nChangshu. The property is a one-hour drive from Suzhou, Wuxi and Shanghai.\n\nLeela, Preferred tie-ups. India luxury brand, The Leela Palaces, Hotels and\nResorts, and consortia Preferred Hotels & Resorts are expanding their\nrelationship with the inclusion of The Leela Kovalam, A Raviz Hotel, The Leela\nAshtamudi, A Raviz Hotel and The Leela Gandhinagar to the Preferred Hotels &\nResorts portfolio. The two companies who have been working together for 15 years\nalso announced that two Leela palaces are joining Beyond Green, The Leela Palace\nUdaipur and The Leela Palace Bengaluru, are joining Preferred Hotel’s global\nportfolio of sustainable hotels.\n\nNew S Hotels CEO. S Hotels and Resorts Public Co. Ltd., part of Singha Estate\nGroup, announced the resignation of Dirk Andre Lena De Cuyper as CEO and SHR\nBoard of Directors and the appointment of Michael Marshall as CEO effective\nNovember 16, 2023. Marshall will focus on, among other things, expanding the\nhospitality portfolio worldwide, and pursuing joint investments to accelerate\ngrowth and entry into emerging markets.\n\nHilton adds in France. Hilton will debut in Lille, France, in 2024 with a\nconversion under its flagship Hilton Hotels & Resorts brand. The 124-room Hilton\nLille will continue to welcome guests and trade as a Hilton affiliated hotel\nbefore fully rebranding under Hilton Hotels & Resorts next summer following a\nmultimillion-euro renovation. It joins 23 trading hotels in France across\nHilton’s brands.",
        "summary": "Ireland’s The Dean Hotel Group has agreed to sell a majority stake to a London-based investment vehicle. Founder Paddy McKillen, Jr. will retain a stake and remain involved in the business. The hotels will continue to be managed and operated under its own brands.",
        "source": "Hotel Investment Today",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-11-01",
        "title": "Rosewood’s president on building luxury for locals and gearing up for company’s biggest growth year ever - The Points Guy",
        "link": "https://thepointsguy.com/news/rosewood-growth-outlook/",
        "content": "When you hear travel critics say that the big brands like Marriott and Hilton\ndon't really know how to run luxury hotels, it's probably because those critics\nhave stayed at a property affiliated with Rosewood Hotels & Resorts.\n\nThe Texas-originating (the Rosewood Mansion on Turtle Creek in Dallas was the\ncompany's first hotel) and now Hong Kong-based luxury hotel brand was born of\nthe idea of creating properties with residential touches and hyperattentive\nservice.\n\nRosewood is also known for designing hotels that become landmarks in the cities\nin which they operate: The Carlyle, a Rosewood Hotel in New York City is\nsynonymous with legendary jazz and equally as legendary mixology. Rosewood Hong\nKong's perch on Victoria Harbour is home to some of the city's most renowned\npower dining spots as well as an incubator of sorts of the brand's newer\nmembership club, Carlyle & Co., as well as a beefed-up city version of\nRosewood's Asaya spa concept.\n\nExpect more of this kind of luxurious localization to spread around the world,\nas the company's expansion streak is expected to build over the next few years\nto the highest growth seen in the company's 44-year history.\n\n\"As we continue to add new properties and as we continue to find new locations,\nthat's the first thing we look at,\" Radha Arora, Rosewood's president and\nco-chief development officer, said. \"Is this property really emblematic of that\nlocation?\"\n\nRelated: What it's like staying at the Rosewood Baha Mar\n\nRosewood currently has 32 hotels across its portfolio but is on track to more\nthan double that number in coming years. Rosewood Munich opened this month in\nGermany but will gain several new siblings next year with the expected arrivals\nof Rosewood Amsterdam, Rosewood Schloss Fuschl in Austria, Rosewood Miyakojima\nin Japan and Rosewood Doha.\n\nProperties in Milan, Mexico City, Rome, Vietnam, Venice and Greece as well as a\nsecond London hotel, are slated beyond those 2024 openings.\n\n\"[2025] is going to be one of those years where we're going to be probably\nopening the most properties we've ever opened in one particular year,\" Arora\nsaid.\n\nDaily Newsletter\n\nReward your inbox with the TPG Daily newsletter\n\nJoin over 700,000 readers for breaking news, in-depth guides and exclusive deals\nfrom TPG’s experts\n\nBy signing up, you will receive newsletters and promotional content and agree to\nour Terms of Use and acknowledge the data practices in our Privacy Policy. You\nmay unsubscribe at any time.\n\n\nTHINKING LIKE A LOCAL\n\nDon't take the accelerating growth as a sign the company is moving into a more\ncookie-cutter design phase where hotels can be replicated and built quickly.\nArora noted the company still goes to great lengths to have a deliberative\ndevelopment process so that hotels resemble the surrounding community and are a\nplace where locals want to socialize.\n\nThe Mansion at Turtle Creek, a manor house-style hotel nestled within a\nresidential Dallas neighborhood, established the localized flourishes that\nRosewood is still known for decades later. The brand specifically chose Rosewood\nLondon's location near Covent Garden because it wasn't in the usual bastion of\nultraluxury hotels in the city like Mayfair or Knightsbridge, Arora said.\n\nParis' Hotel de Crillon, a Rosewood Hotel is supposed to feel like a living room\nof \"old apartments that, over the years, you've collected pieces and accessories\nwhile you've been living in Paris, home to the fashionistas,\" he added.\n\nThe hyperlocalization and attention to detail appear to be working and are even\na business advantage in wooing both guests and deals for more hotels. Hotel de\nCrillon saw its highest-ever occupancy and demand levels this year, Arora said.\nFurther, room nights booked at Rosewood Bangkok are up 153% from a year ago\nwhile Rosewood Phuket is up 29%.\n\n\"We don't build properties for tourists. We build properties for locals, first\nand foremost, and make sure that we engage ourselves with the local partners,\"\nArora said. \"That comes to food, amenities and anything that comes to\npunctuating a property.\"\n\nBuild for the locals, and the out-of-towners will follow their lead, the\nthinking goes.\n\n\nWHAT'S NEXT FOR ROSEWOOD\n\nRosewood's growth trajectory has also seen the company expand into newer\nventures under the direction of Sonia Cheng, the company's CEO.\n\nThe growth of residential components at Rosewood properties, as well as\nstand-alone Rosewood-branded residential developments, is on the rise. As of\nthis year, half of the company's existing hotel portfolio, as well as its\ndevelopment pipeline, features a residential component. There are also six\nstand-alone residential projects in various stages of development in markets\nlike Beverly Hills, California, and South Florida.\n\n\"We were hesitant at first, but we realized that people want a piece of Rosewood\nas their home,\" Arora said with a laugh.\n\nCarlyle & Co., a membership club paying homage to the Carlyle, a Rosewood Hotel\nin New York City, is located within the same tower as Rosewood Hong Kong. The\nself-described \"modern, progressive\" club is meant to be more of an inclusive\nspace than other private Hong Kong clubs, and Rosewood leadership maintains it's\na place where character and personality trump what one does for a living. There\nare plans to expand Carlyle & Co. to select global destinations.\n\nAsaya, Rosewood's wellness offering, is in six hotels — including Guangzhou,\nHong Kong, Vienna and Phuket — with plans for continued expansion. Asaya is more\nof an immersive experience than a usual hotel spa, with well-being classes,\ntreatments, nutritionists and even overnight Asaya Lodges for \"contemplative,\nregenerative stays\" offered to coincide with a treatment program that fits the\nguest.\n\nNew World Hotels & Resorts, Rosewood Hotel Group's upper-upscale brand, is a nod\nto the Hong Kong company that acquired Rosewood when it was still a privately\nheld Texas company. The Asia-focused brand currently has 15 hotels in its\nportfolio, with three more slated to open by the end of 2023 and an additional\ntwo opening next year.\n\n\"Growing new brands and business ventures will further position us as a brand of\nchoice for modern luxury consumers in the future,\" Arora said.\n\n\nBUSINESS AND INDUSTRY OUTLOOK\n\nWith global macroeconomic conditions a little murky at the moment, it's\nreasonable to wonder if there's a limit to the runway for all the growth in\nultraluxury hotels. Sure, customers in this social strata tend to be a little\nrecession-proof, but high interest rates make expansion more difficult amid\nrising construction costs.\n\nWhile Arora is mindful of the economy, he also sees opportunity and advantage\nwith Rosewood being a smaller brand.\n\n\"There is always going to be some kind of cycle. There are always going to be\nsome challenges,\" he said before adding: \"We mitigate some of that risk because\nwe are going to some parts of the world that are going to be still seen as a\nsafe haven to go to, where you know what you're going to get.\"\n\nThe Rosewood executive emphasized there is still \"incredibly high demand\" for\nultraluxury and that consumers prefer experiences like travel. Making sure the\noverall offerings at Rosewood remain elevated is crucial to making sure that\ndemand momentum remains at its lofty peak.\n\n\"We continue to remain confident in the industry's long-term health and continue\nto invest in new guest experiences,\" Arora said. \"We don't just build hotels. We\nbuild destinations.\"\n\nRelated reading:\n\n * The best hotel credit cards\n * Get free breakfast, upgrades and more with the Amex Fine Hotels + Resorts\n   program\n * The best hotel rewards programs in the world\n * The best premium credit cards: A side-by-side comparison\n\nEditorial disclaimer: Opinions expressed here are the author’s alone, not those\nof any bank, credit card issuer, airline or hotel chain, and have not been\nreviewed, approved or otherwise endorsed by any of these entities.",
        "summary": "Rosewood Hotels & Resorts is a Hong Kong-based luxury hotel brand. The company's expansion streak is expected to build over the next few years. Rosewood has 32 hotels across its portfolio but is on track to more than double that number in coming years.",
        "source": "The Points Guy",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-07-04",
        "title": "The Best Rosewood Hotels in the World",
        "link": "https://pursuitist.com/the-best-rosewood-hotels-in-the-world/",
        "content": "Rosewood Hotels and Resorts are renowned for creating unique, immersive\nexperiences that pair the culture and spirit of the destination with the highest\nstandards of luxury and personalized service. Pursuitist showcases the top five\nRosewood properties that are absolute must-visits for any discerning traveler.\nOur selection criteria include the captivating design of each property, the\nallure of the destination, culinary excellence, exceptional VIP services, and\nthe unique, unforgettable experiences at each property.\n\nAbout Rosewood\n\nRosewood Hotels & Resorts is a prestigious international hospitality company\nthat was launched in 1979 by Caroline Rose Hunt, a daughter of the Texas oil\ntycoon H.L. Hunt. The first property of this company was The Mansion on Turtle\nCreek in Dallas, Texas, which opened its doors in 1981 and quickly gained a\nreputation as one of the finest hotels in the United States. Over the years, the\nbrand expanded, establishing properties in a number of countries worldwide. It\ngained renown for its distinctive collection of luxurious, residential-style\nhotels inspired by the culture, history, and geography of each location.\n\nToday, Rosewood Hotels & Resorts boasts over 20 iconic properties in 15\ncountries, with a mission to “create a sense of place” for guests. Each hotel\nand resort is designed to blend the distinctive culture and aesthetics of its\nlocation with modern luxury, providing guests with unparalleled service,\nsuperior attention to detail, and a truly unique hospitality experience.\nRosewood’s properties are known for their timeless elegance, innovative dining\nexperiences, and commitment to social responsibility. With a distinct philosophy\nof relationship hospitality, Rosewood continues to grow its portfolio with\nprojects that showcase a careful balance between the environment, culture, and\nthe unique narratives of each property’s locale.\n\nPursuitist’s Curated Top 5 Rosewood Hotels & Resorts\n\nFor the discerning luxury traveler seeking relaxation, adventure, and culinary\nexcellence, Pursuitist presents our curated selection of the top five Rosewood\nHotels and Resorts. These must-visit destinations offer the epitome of luxury\nexperiences, defining your travel bucket list with unique adventures,\nunparalleled comfort, and gastronomic delights. Your unique journey towards an\nunforgettable luxury escape begins here.\n\nHôtel de Crillon, A Rosewood Hotel, Paris, France\n\nThe Hôtel de Crillon, nestled in the heart of Paris, exudes grandeur that\ntranscends time. This 18th-century palace was painstakingly restored, marrying\nits rich architectural heritage with contemporary amenities and cutting-edge\ntechnology. Given its location, just steps away from iconic landmarks like the\nLouvre and the Champs-Élysées, it offers an unrivaled destination for cultural\nimmersion.\n\nThe hotel’s Michelin-starred restaurant, L’Ecrin, is an art piece in itself,\noffering a culinary journey that mirrors the city’s sophistication and\ninnovation. VIP services here are unmatched, with offerings such as private art\nand history tours, personal shopping services, and bespoke experiences that take\nluxury to new heights.\n\nPursuitist Tip:\n\n * Arrange for the private art tour, which takes you through the hidden gems of\n   the Louvre, guided by a local art historian.\n * Don’t miss the tailored shopping experience, where the concierge can help\n   arrange private visits to couture houses.\n * Spend an afternoon at the Sense Spa for rejuvenating treatments followed by a\n   refreshing dip in the rooftop swimming pool.\n\nHôtel de Crillon, A Rosewood Hotel, Paris, France\n\nLas Ventanas al Paraíso, A Rosewood Resort, San José del Cabo, Mexico\n\n‘Las Ventanas al Paraíso,’ aptly translates to ‘The Windows to Paradise.’ This\nRosewood Resort offers an all-suite luxury escape that blends contemporary\ndesign with traditional Mexican decor, offering a serene and intimate setting.\nWith its paradisiacal views over the Sea of Cortez and proximity to San José del\nCabo’s vibrant local culture and breathtaking natural landscapes, it offers an\nexperience like no other.\n\nThe resort’s dining experience stands out, with offerings such as a dinner under\nthe star-studded desert sky. VIP services are woven into every aspect of your\nstay, including personalized butler services, private tequila tastings, and\noceanfront spa treatments.\n\nPursuitist Tip:\n\n * Engage in the traditional Mexican craft workshop to delve deeper into the\n   local culture.\n * Don’t miss out on the private Tequila tasting session, where a seasoned\n   sommelier guides you through the rich history and nuances of this beloved\n   spirit.\n * Try out the resort’s bespoke wellness programs, designed to invigorate your\n   mind, body, and spirit.\n\nLas Ventanas al Paraíso, A Rosewood Resort, San José del Cabo, Mexico\n\nRosewood Sanya, Hainan, China\n\nEmbracing the lush tropical allure of Haitang Bay, Rosewood Sanya offers an\noasis of luxury. The resort’s design is a nod to local culture, beautifully\nentwined with contemporary elegance. Each room and suite provide breathtaking\nocean views, making it an idyllic retreat to explore Hainan’s tropical charm.\n\nThe dining options offer an exquisite mix of Chinese and international cuisine,\nshowcasing the island’s rich gastronomic landscape. The VIP services extend to\ncurated excursions to cultural sites, personalized wellness retreats, and\nexclusive access to private events.\n\nPursuitist Tip:\n\n * Explore the island’s fascinating underwater world with a guided scuba diving\n   session.\n * Try the Hainanese chicken rice at the resort’s restaurant – a local dish\n   prepared to perfection.\n * Book a traditional Chinese tea ceremony to immerse yourself in the rich\n   culture.\n\nRosewood Sanya, Hainan, China\n\nRosewood Castiglion del Bosco, Tuscany, Italy\n\nSituated in one of Tuscany’s oldest and best-preserved estates, Rosewood\nCastiglion del Bosco encapsulates the soul of Tuscany. With a picturesque\nbackdrop of stunning landscapes, vineyards, and historical sites, it is a portal\nto the very heart of Italian culture and history.\n\nDining here is a celebration of traditional Tuscan cuisine. The estate’s very\nown Brunello di Montalcino wine is the perfect accompaniment. VIP services\nextend to private vineyard tours, custom-made Italian itineraries, private\ncooking classes, and a host of personalized experiences.\n\nPursuitist Tip:\n\n * Indulge in a truffle hunting adventure, followed by a truffle-infused meal, a\n   truly Tuscan experience.\n * Try your hand at an authentic Italian cooking class, where local chefs\n   introduce you to the region’s most beloved dishes.\n * Visit the property’s private chapel, home to splendid frescoes from the 14th\n   century.\n\nRosewood Castiglion del Bosco\n\nRosewood Little Dix Bay, British Virgin Islands\n\nAn eco-friendly paradise, Rosewood Little Dix Bay is nestled within a 500-acre\nnature reserve. The hotel offers stunning views of the private bay, pristine\nbeaches, and vibrant coral reefs. The locally-sourced Caribbean fare at the\nhotel’s dining facilities is a gastronomic delight, while VIP services like\nprivate yacht charters and individualized wellness retreats elevate the\nexperience.\n\nPursuitist Tip:\n\n * Venture into the depths of the sea with a guided snorkeling tour and discover\n   a vibrant underwater world.\n * Don’t miss a chance to sail in the azure Caribbean waters with the hotel’s\n   private yacht charter.\n * Spend a day hiking in the nature reserve to observe the local flora and\n   fauna.\n\nRosewood Little Dix Bay, British Virgin Islands\n\nWith its remarkable history and commitment to luxurious, personalized service,\nRosewood Hotels & Resorts continues to redefine the standard of luxury\nhospitality. Whether you’re exploring the rich culture of Paris, reveling in the\ntropical allure of Hainan, enjoying the culinary treasures of Tuscany, or\nexperiencing the serenity of the British Virgin Islands, Rosewood’s curated\ncollection offers unique, immersive experiences in the world’s most desired\ndestinations. As a discerning luxury traveler, these top five Rosewood Hotels &\nResorts, handpicked by Pursuitist, promise to take you on unforgettable journeys\nof relaxation, adventure, and gastronomic indulgence. So pack your bags and\nstart crossing off these extraordinary escapes from your luxury travel bucket\nlist. The world of Rosewood awaits!\n\nBooking your stay at these luxury resorts using premium credit cards can add\nvalue to your travel and help you earn points and rewards.\n\nBooking Tips with Premium Credit Cards\n\n 1. American Express Platinum: This card offers access to the Fine Hotels &\n    Resorts Program. When booking through this program, you can receive benefits\n    such as room upgrades, complimentary breakfast, late check-out, early\n    check-in, and a unique property amenity like a resort credit.\n 2. Chase Sapphire Preferred: With this card, book your stay through the Chase\n    Travel Portal. Your points are worth 1.25 cents each when redeemed for\n    travel through the portal, providing 25% more value.\n 3. Citi Prestige: The card offers a fourth-night-free benefit when booking a\n    stay of four nights or more through ThankYou.com. Additionally, you earn 5x\n    points on travel and 3x points on hotels and cruise lines.\n 4. Chase Sapphire Reserve: Like the Preferred card, but with the Reserve card,\n    your points are worth 1.5 cents each when redeemed for travel through\n    Chase’s portal.\n\nRemember, using these credit cards responsibly and strategically can help you\nmaximize your rewards and points, making your luxury stay even more enjoyable.\nBecome a Points Genius and travel smart and luxuriously.\n\n--------------------------------------------------------------------------------\n\nPursuitist upholds a policy of zero influence, no affiliate links, no free\ntrips, or commissions. Our commitment is to 100% authentic, unbiased reviews.\n\nThis Pursuitist Luxury Travel Guide was curated by renowned luxury travel expert\nand journalist Christopher Parr. Named a “Top 10 Luxury Travel Blogger” by USA\nToday, Parr has also been selected as the official winner in Luxury Lifestyle\nAwards’ 2023 list of the “Top 50 Best Luxury Influencers and Bloggers in the\nWorld.”\n\nFollow: Christopher Parr on Instagram, Christopher Parr on Twitter, Christopher\nParr on Threads, Christopher Parr on Facebook and Christopher Parr on LinkedIn. ",
        "summary": "Rosewood Hotels and Resorts are renowned for creating unique, immersive experiences that pair the culture and spirit of the destination with the highest standards of luxury. Pursuitist showcases the top five Rosewood properties that are absolute must-visits for any discerning traveler.",
        "source": "Pursuitist",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-02-23",
        "title": "Radha Arora of Rosewood Hotels & Resorts, HOTELS Magazine's 2024 Corporate Hotelier of the World - HOTELSMag.com",
        "link": "https://hotelsmag.com/news/radha-arora-of-rosewood-hotels-resorts-hotels-magazines-2024-corporate-hotelier-of-the-world/",
        "content": "HOTELS Magazine’s 2024 Hoteliers of the World are recognized as two of the\npreeminent leaders in the luxury hotel space, both parts of companies that are\ntime-tested luxury groups, welcoming demanding, affluent guests and developing\nsome of the finest hotels in the world.\n\nBoth are known for their attention to detail and composure in even the most\ndemanding of situations—no matter what comes their way. These are just two of\nthe many reasons why they were selected for this year’s awards and, as proof,\nare admired by their peers; many of which supported their candidacy for this\nyear’s awards.\n\nToday, we reveal our other awardee: Radha Arora, president of Rosewood Hotels &\nResorts. We put his life and career story in the frame below. We hope you enjoy\nit.\n\nBoth he and fellow winner, Sandeep Bhalla of The Connaught, are featured in\nprint in our forthcoming March/April issue of HOTELS Magazine. \n\nWe, and the collective hospitality industry, congratulate the winners. \n\n--------------------------------------------------------------------------------\n\nRadha Arora can rationalize any trip to Paris. On a January afternoon, the\npresident of Rosewood Hotels & Resorts\nis at Hôtel de Crillon, A Rosewood Hotel, a designated Palace-grade hotel in the\n8th arrondissement that’s hosted real-life royalty and the fictional kind: the\nprotagonist of Ernest Hemingway’s “The Sun Also Rises” composes letters from the\nhotel lobby.\n\nOn this particular day, Arora, a Los Angeles resident, is in Paris for work,\nthough the City of Light isn’t why. Rosewood Hotels & Resorts, the luxury hotel\nmanagement arm of Hong Kong-based Rosewood Hotel Group, is opening the\nRosewood Schloss Fuschl, close to Salzburg, Austria, later this year and though\nRosewood also has a hotel in Vienna, Arora is working out of Paris, ensconced in\nthe landmark Crillon. Paris for any occasion.\n\nThe city and the hotel mean more to Arora than just plain work stopovers; they\nboth played pivotal roles in Arora’s upbringing as the son of a foreign service\nworker. “It’s a great love affair I have with the city,” he said, and for good\nreason. Arora may have a 40-plus-year career in the hotel industry, but one\ncould argue he’s been in it his whole life. Travel is requisite for someone\nworking in the foreign service and when his father received his first posting\nabroad in Moscow, the entire family accompanied him from Arora’s birthplace of\nNew Delhi.\n\nPrior to Russia came a stop in London, where the family stayed at the Strand\nPalace, just across the way from one of the world’s iconic hotels, The Savoy,\nwhich, among other London hospitality institutions, Arora refers to as a paragon\nof hotel virtue.\n\nRadha Arora is president of Rosewood Hotels & Resorts. He joined the company 13\nyears ago after learning the luxury ropes with Four Seasons Hotels & Resorts.\n\nAfter Russia came Paris, where, by pure coincidence, the family lived in the\nHôtel de Crillon, which opened as a hotel in 1909, but stood as a building since\n1758—in 1793, King Louis XVI and Queen Marie Antoinette were guillotined in the\nPlace de la Concorde directly in front of it. It’s a rich, even macabre history.\n\nIt was the 60s when his love affair with the hotel industry coalesced. How could\nit not when you are a real-life Eloise? “Living in hotels, being surrounded by\nand building relationships with the housekeepers, the room-service staff, the\nbellman, the concierge, front desk—that desire to be around people that are so\ncaring and nurturing,” he said. “Those were my formative years.”\n\nIt was precisely those years that led him to a career in hospitality because\ntradition did not. It’s typical Indian culture to strive to become a lawyer, a\ndoctor, a financier, but “I wanted to be a hotelier,” Arora said, adding that,\nat one point, dentistry was in the cards. Unlike a film or novel, there was no\npaternal pushback. “He said to me, ‘You’ve lived in hotels, you love hotels, you\nlove the smell of a hotel, it is all you talk about.’ That was it. I went with\nhospitality.”\n\nHôtel de Crillon, A Rosewood Hotel in Paris, is a Palace-grade hotel and a\nproperty that Arora once lived in as a boy.\n\n\nON THE WAY UP\n\nArora studied hospitality in school, but his career journey didn’t start until\nthe 1980s, with his first hotel job in London, as a night receptionist at the\nInn on the Park London, which later became a Four Seasons hotel after its owners\ntook the advice of a little- known Canadian hotelier named Isadore Sharp. (Arora\nrefers to him as the god of hospitality.) It was a pivotal moment for Four\nSeasons because it was its first hotel outside Canada.\n\nFour Seasons had a profound impact on Arora. The company now has more than 120\nhotels worldwide, but back then, there were only a handful, and most were in\nCanada. “London was a hallmark of their success,” Arora said, as transatlantic\ntravel boomed, spurred by the likes of the Concorde, which allowed the affluent\nto be on Broadway one night and the West End the next. For two years he was at\nthe hotel, doing the income audit, checking in guests and “I loved it,” he said.\n\nThere is no shortage of luxury hotels in London and there is no more effective\nway to learn the ropes than by immersing oneself in the culture. That’s what\nArora did. He worked at small luxury hotels, like DUKES London in St. James’s;\nhe worked at large luxury hotels, such as the InterContinental London Park Lane;\nand along the way, he picked up experience in all the varied disciplines—from\nfront-of-the-house guest-facing interactions to back-of-the-house accounting,\nArora was front and center on his career arc, soaking it all in. “I just wanted\nto work in great hotels,” Arora said.\n\nThe lobby of The Carlyle, A Rosewood Hotel in New York’s Upper East SIde.\n\nHe eventually became hotel manager of the famed Ritz London, where he remained\nfor seven years, a stint that included many chance meetings with the likes of\nPrincess Diana, who had a friend living in the hotel. Arora called the Princess\none of the most disarming people he’d ever encountered. “Everybody felt\nconnected to her,” he said. And while Princess Diana was swarmed wherever she\nwent in public, Arora says that the biggest luxury anyone can have of her ilk,\nwithin a luxury hotel, is anonymity.\n\nArora’s connection to London ended when the siren call of Four Seasons beckoned\nhim back. He returned to the company in 1994 and was with them for the next 17\nyears. He felt “at home” with Four Seasons and wanted out of London.\n\nArora took posts from Toronto to Hawaii and even for a time back in his home\ncountry, working in Goa, India. His last position with Four Seasons was one of\nthe most coveted jobs in hospitality: regional vice president and GM of the\nBeverly Wilshire, A Four Seasons Hotel, where he stayed for seven years. He\ncalls Los Angeles home today.\n\nIt was that post with Four Seasons that directly led to what is now a\n13-year-and-still-counting career with Rosewood Hotels & Resorts. The Beverly\nWilshire might have been managed by Four Seasons, but it was owned by the Cheng\nfamily of Hong Kong, which, in 2011, acquired a portfolio of Rosewood-managed\nproperties from Maritz, Wolff & Co., five total, including The Carlyle, a\nRosewood Hotel, in New York, and Rosewood Little Dix Bay Resort in the British\nVirgin Islands. At the time of the transaction, the Cheng family stated that\n“Rosewood will be positioned for substantially accelerated global growth.”\n\nRosewood Munich is housed in two restored historic buildings—the former State\nBank of Bavaria headquarters and the adjacent Palais Neuhaus-Preysing\naristocratic residence.\n\n\nCOMING UP ROSES\n\nSome 13 years later, Rosewood, under the stewardship of the Cheng family and its\nscion/ CEO, Sonia Cheng, have grown the portfolio to 33 hotels operating and a\nslew more on the way, including a prospective seven more hotels in Greater China\nand seven more in Europe, which includes the The Chancery Rosewood in London,\nslated to open in 2025, and housed in the former U.S. Embassy on Grosvenor\nSquare. Arora calls it an emblem of the Rosewood brand.\n\nRosewood is also opening hotels in destinations beyond what would be considered\nthe norm. This year, it will open Rosewood Miyakojima in Japan, “a destination\nthat our clients would not normally have ever dreamed of,” Arora said.\n\nHe’s been along for the entire ride. The Cheng family recognized greatness in\nArora by his successes in the U.S.— including the Beverly Wilshire, he had eight\nother hotels under his purview. The idea around Rosewood—and qualified in the\ncompany statement when it acquired the company—was to scale it up, but in a\nmanner that still allowed it to retain its almost provincial charm.\n\nBack in 2011, Sonia Cheng, Arora remembered, referred to Rosewood as a gentle\ngiant that needed to be awakened, a diamond in the rough that just needed some\nbuffing. Arora refers to the 43-year-old Cheng as his “fountain of youth” and\nhis best friend.\n\nWith a startup company mentality, the idea was to expand the brand globally, but\nin a manner where the culture was not bastardized. “Each one of our properties\nis unique, distinct to its culture. That’s what Rosewood is,” Arora said.\nConsider The Carlyle, one of New York’s famed hotels that shares the\nneighborhood with other celebrated hotels. Talk about unique: the hotel’s\nBemelmans Bar features wall murals by Ludwig Bemelmans, the creator of the\nclassic Madeline children’s books, while Woody Allen used to play clarinet with\nhis jazz band on Monday nights in Café Carlyle. It’s even appeared in HBO’s “Sex\n& The City.” Of the hotel, Arora said, “When you create a property where you go\nto a city to the hotel versus for the city itself, you know you have a winner.\nIt’s one of those properties where when you walk in you get goosebumps.”\n\nA marbled bathroom at Rosewood Hong Kong, which soars over Victoria Harbour.\n\nThe hotel recently finished off a decade-in-the- making renovation that was\npainstakingly deliberate and meticulous to preserve the hotel’s patina and\ncontinue its legacy. Arora said the older Rosewood properties, from The Caryle\nto Rosewood Mansion on Turtle Creek in Dallas, act as signposts for the newer\nRosewood properties to come.\n\nRosewood now has a handful of owned properties that Arora calls the linchpins,\nwhich, he says, act almost as showrooms. Now, the idea is to expand through an\nasset-light model, partnering with people who want a piece of Rosewood in their\nportfolio, maybe even more so for the prestige, rather than the returns. “It’s\nnot your typical institutional partner,” Arora said.\n\nPart of Arora’s remit is to strike and nurture these deals, to grow the Rosewood\nbrand by working in tandem with partners to achieve the best results, which is\nwhy Arora keeps a frenzied travel schedule. Arora favors a tête-à-tête\nconversation over a Zoom call. In October 2023, Town & Country published an\narticle titled: “Radha Arora Shares His Favorites for Being at Home or Away.”\nExpectedly, Bose QuietComfort Headphones were cited; surprisingly, were\nBlackwing pencils, which he wears down to the nub: “We’re in the aesthetics\nbusiness; I work with great designers and architects, and I’ve seen them use\nthese pencils, so when I have one, I feel like I, too, can contribute in some\nway,” he told Town & Country.\n\nArora has contributed in many ways, but it’s not just the contributions he’s\nmade to propel the business, it’s the contributions he’s made to those around\nhim. “It’s being respectful of others,” Arora said. “Humanity is what our\nindustry is all about. If you endorse the culture through the way you speak to\nsomebody else, then everything else pales.”\n\nPassionate is how Arora believes others see him. Passionate about the way he\ngoes about his business and in his daily relationships. “This is just who I am,”\nhe said. “It’s about loyalty to our partners and to our teams. When you have\nthis culture, where you create this sense of pride, at every level, that is\nimpenetrable, and it propagates creativity.”\n\nRosewood Mayakoba in Mexico’s Riviera Maya.\n\nIt’s taken time to grow the Rosewood brand to be a powerhouse, standing shoulder\nto shoulder with the likes of Ritz-Carlton and Arora’s old outfit, Four Seasons.\nIt wasn’t David slinging Goliath, but it wasn’t easy; it took time and it took\nconvincing.\n\n“There’s so many different luxury players,” Arora said. Consider Hôtel de\nCrillon. It’s owned by a Saudi Arabian prince, but it took some time coaxing him\nthat Rosewood was the right partner to operate the hotel. “He’d ask us, ‘Why\nRosewood? You have no properties in Europe. No infrastructure.’”\n\nThe answer seems easy but it’s hard to execute on. What it really is, is a\npromise, an assurance of uniqueness and mystique, Arora said. His pitch: “We are\na well-known brand in the U.S. that will continue to evolve in Europe. You need\nto trust us with this passion and desire. We’ll work on it personally.”\n\nIt happened. “Twelve years later, partners come to us,” Arora said. “We’re very\nfortunate to be in the position to have created this appealing brand.”\n\nHe’s had a big hand in it, and Arora says that his job today is to preserve the\nbrand and its culture.\n\nThirteen years in with Rosewood, Arora doesn’t have any plans to go anywhere\nsoon. Besides, he said, his boss wouldn’t allow it. “‘You’re not going\nanywhere,’” Cheng has told him.\n\nHe’s also in no hurry to be anywhere else. “Why would I want to? Every day is a\nunique day.”",
        "summary": "Radha Arora is president of Rosewood Hotels & Resorts. He joined the company 13 years ago after learning the luxury ropes with Four Seasons. Sandeep Bhalla is the editor-in-chief of The Connaught. Both are featured in the March/April issue of HOTELS Magazine.",
        "source": "HOTELSMag.com",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-04-23",
        "title": "Rosewood Hotel Group Unveils The Impact Trailblazers",
        "link": "https://www.hospitalitynet.org/news/4121593.html",
        "content": "Following the 2023 announcement of its sustainability and social impact roadmap\nRosewood Impacts, Rosewood Hotel Group today unveils the Impact Trailblazers,\nsix properties who are upleveling the portfolio’s sustainability and social\nresponsibility successes and ambitions. The Impact Trailblazers, which include\nRosewood Hong Kong, Rosewood Baha Mar, Rosewood São Paulo, Rosewood Phnom Penh,\nRosewood Mayakoba, and Rosewood Phuket, are leading the charge towards creating\na future where people and place enrich one another, and subsequently setting a\nhigher standard for their sister properties as well as the hospitality industry\nat large. Additive to several targets that are shared by all 48 Rosewood Hotel\nGroup properties, the Impact Trailblazers have committed to achieving at least\none of six stretch goals by 2025, an exercise that will ultimately strengthen\nthe ever-evolving Impacts roadmap through the integration of best practices and\nlessons learned. Focused on the most consequential methods for achieving\npositive environmental and social impact, the stretch goals include:\n\n * 100% elimination of single-use plastics in both front and back of house\n * 100% carbon neutrality\n * 90% waste diversion\n * Local sourcing of 70% of produce and protein\n * Development of minimum one meaningful and long-term community partnership\n * Transformation of minimum one of the hotel’s restaurants into a “business\n   with a purpose”\n\nCentral to Rosewood’s ethos and brand identity, sustainability and social impact\ninitiatives are not mandates but core pillars of each property experience.\nThrough every detail —from eco-conscious culinary creations and educational\nguest programming, to sustainable design elements alongside those that celebrate\nlocal heritage and artistry —every Rosewood hotel and resort embodies a\ncommitment to the planet (Rosewood Sustains) and its people (Rosewood Empowers).\nThe Impact Trailblazers shine as beacons of how luxury and responsibility can\ncoalesce, and how the most elevated experience is the one that makes a positive\ndifference in the world. Through their efforts, they are sculpting the blueprint\nfor the brand’s future, showcasing how a commitment to innovation and\ncollaborative learning can pave the way for groundbreaking achievements in\ncircular hospitality and community empowerment.\n\n> Rosewood Impacts has always been about recognizing not only what we should and\n> can be doing now, but also how we can continue to push ourselves towards\n> better solutions for the future. The Impact Trailblazers are critical to this\n> mission, with ambitions going above and beyond our current sustainability and\n> social impact goals. These six hotels and resorts perfectly embody the\n> direction we are moving in, a direction where delivering positive impact is\n> part of our business DNA. Their transparency and willingness to share both\n> their successes and lessons learned will be invaluable to our objective of\n> creating a new reality where luxury and positive impact are synonymous. They\n> are truly blazing a trail in creating meaningful, enriching connections with\n> their guests, communities, associates, and the places where they’re\n> located. Mehvesh Mumtaz Ahmed, Vice President of Social Impact at Rosewood\n> Hotel Group\n\n\nA CELEBRATION OF BRAZIL’S BEGINNINGS AND FUTURE IN SÃO PAULO\n\nRosewood São Paulo’s stretch goals as an Impact Trailblazer are 90% waste\ndiversion (achieved in 2023), 100% elimination of single-use plastics in both\nfront and back of house, 70% of produce and protein sourced locally, and 100%\ncarbon neutrality.\n\nToday, the hotel operates on 100% renewable energy and is almost zero waste,\nwhile its commitment to giving back to its home of Brazil, rather than depleting\nit, is further evidenced in its people-first approach. In just two years since\nopening, Rosewood São Paulo has played a pivotal role in boosting local\nbusinesses, rescuing ancestral traditions, and reducing inequalities, with over\n45% of Rosewood São Paulo’s workforce having been hired from underserved groups.\n\n\nMEANINGFUL PARTNERSHIPS IN PHUKET, THAILAND\n\nMore than just a picturesque retreat, Rosewood Phuket is an epicenter of\nenvironmental sustainability and community empowerment. The resort’s stretch\ngoals as an Impact Trailblazer are 70% of produce and protein sourced locally\n(achieved in 2023), development of a meaningful long-term community investment\n(achieved in 2024), 100% elimination of single-use plastics in both front and\nback of house, and transformation of one restaurant concept into a business with\npurpose.\n\nThe resort was one of Thailand's first to earn LEED Gold Certification and today\nhouses the largest solar energy system of any property in Phuket, as well as\ncomprehensive recycling and wastewater treatment plants. Its culinary program is\nan exemplar of how gastronomy can be used as a tool to protect precious\nresources while also championing indigenous practices. Its signature restaurant\nTa Khai, which is targeted to transform as a business with purpose by end of\n2024, is helmed by local couple Uncle Nun and Aunt Yai and sources 100% of\ningredients locally, with many coming from Ta Khai’s own organic herb and\nvegetable garden.\n\n\nBUILDING BRIGHT FUTURES IN RIVIERA MAYA, MEXICO\n\nRosewood Empowers at its best is Rosewood Mayakoba’s work with Centro Educativo\nK’iin Beh, a non-profit school in the Riviera Maya. With a mission to support\nnot only the hotel associates who need adequate schooling for their children but\nalso the larger community, the resort’s leaders raised the resources required to\nreopen the school in 2017, after several challenges forced the original school\nto shutter. Today, the school welcomes over 450 students, all of whom receive\neconomic support for tuition and supplies funded by the Rosewood Mayakoba\ncommunity. Supplementing the contributions of the resort’s leadership, guests\nare brought into the journey through a special volunteer and donation program,\n“Padrino,” that ensures the continued development of the students.\n\nRosewood Mayakoba’s stretch goals as an Impact Trailblazer are development of a\nmeaningful long-term community investment, (achieved through its work with\nCentro Educativo K’iin Beh) and transformation of one restaurant concept into a\nbusiness with purpose by end of 2024.\n\n\nUPHOLDING AND HONORING TRADITIONS IN PHNOM PENH, CAMBODIA\n\nWith a goal of celebrating both the Cambodian capital’s longstanding cultural\ntraditions as well as its incredible evolution in recent years, Rosewood Phnom\nPenh’s Impacts mission prioritizes partnerships that uplift local livelihoods\nand care for the environment. The property’s stretch goals as an Impact\nTrailblazer are 90% waste diversion (achieved in 2023), 100% elimination of\nsingle-use plastics in both front and back of house, and development of a\nmeaningful long-term community investment by end of year 2024. Among the\nproperty’s most impactful community partnerships is that with Phare Ponleu\nSelpak, a local non-profit that offers artistic and vocational training to\nCambodian youth.\n\n\nCHAMPIONING CORAL CONSERVATION IN NASSAU, THE BAHAMAS\n\nGiven that 95% of The Bahamas’ territory is underwater and that the sea has long\nshaped life for Bahamian people, Rosewood Baha Mar is focused on the protecting\nits surrounding waters and championing coral reef conservation. In partnership\nwith the Bahamas Reef Environment Educational Foundation (BREEF), the resort\noffers immersive educational experiences at the Coral Reef Sculpture Garden—the\nworld’s largest underwater sculpture and living art gallery created by local\nvisionaries. In recognition that plastic pollution and carbon emissions are\nmajor factors affecting the ocean today, the resort’s stretch goal as an Impact\nTrailblazer is 100% elimination of single-use plastics in both front and back of\nhouse.\n\nBeyond working to keep The Bahamas physically healthy for future generations,\nthe resort also aims to be as authentically representative of the local\ncommunity as possible. 95% of associates at Rosewood Baha Mar are local\nBahamians, and the property is committed to building a diverse and inclusive\nworkplace by hiring from underserved groups such as single parents and\ncaretakers. The team is also invested in encouraging greater female\nrepresentation at the supervisory level; 61% of Rosewood Baha Mar’s staff at the\nsupervisory level and above are women, higher than the industry average.\n\n\nBUSINESS WITH A PURPOSE IN HONG KONG\n\nSince its inception, Rosewood Hong Kong has been recognized as an incubator of\ninnovation, championing initiatives that yield positive social, environmental,\nand financial results. The hotel’s most meaningful innovation to-date, BluHouse,\nRosewood Hotel Group’s first fully formed “business with purpose” achieved this\nImpact Trailblazers Stretch Goal in 2023. BluHouse is introducing new ways of\nworking that champion circular hospitality, opportunity employment, neighborhood\nresilience, and more. The restaurant is staffed by refugees and ethnic\nminorities, made possible through partnerships with local NGOs, and pledges 1%\nof revenue to support underserved groups in the hotel’s neighborhood. The team\nhas recently partnered with social enterprise LoveXpress to develop a training\nprogram for students with autism, wherein they will receive meaningful career\nexperience and support and be eligible for full-time employment upon graduation\nfrom the program.\n\n\nABOUT ROSEWOOD HOTEL GROUP\n\nRosewood Hotel Group, a privately owned company, is one of the world's leading\nglobal lifestyle and hospitality management groups. It encompasses four brands:\nultra-luxury Rosewood Hotels & Resorts®; upper-upscale New World Hotels &\nResorts; Asaya, an integrated well-being concept; and Carlyle & Co., a modern\nand progressive private members clubs. Its combined hotel portfolio consists of\n48 hotels in 23 countries with 35 new properties currently under\ndevelopment. For more information, please visit rosewoodhotelgroup.com. Connect\nwith us: Facebook, Twitter, Instagram, WeChat @RosewoodHotels",
        "summary": "Rosewood Hotel Group unveils the Impact Trailblazers, six properties that are upleveling the portfolio’s sustainability and socialresponsibility successes and ambitions. The six properties include Rosewood Hong Kong, Rosewood Baha Mar, and Rosewood São Paulo. They are leading the charge towards creating a future where people and place enrich one another, and setting a higher standard for their sister properties.",
        "source": "Hospitality Net",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-06-27",
        "title": "Rosewood Hotel Georgia unveils renovation results - Sleeper",
        "link": "https://www.sleepermagazine.com/stories/projects/rosewood-hotel-georgia-unveils-renovation-results/",
        "content": "Rosewood Hotel Georgia has reopened following an extensive five-month\nrenovation, with reimagined culinary concepts and accommodation. \n\nThe reopening also marks the debut of a new F&B destination, The Georgia Bar. \n\nNew York-based design firm Lillian Wu Studio was tapped for the redesign of the\nhotel’s 156 rooms and suites, with details such as leather-wrapped accessories,\nplush, tufted headboards, horn handles with bronze patina holders and hand-blown\nglass fixtures. Tranquil hues have been juxtaposed with patterned furnishings\nand jewel-toned accents, offering a sense of both serenity and luxury.\nReflecting Rosewood’s A Sense of Place® philosophy, elegant nods to the\nproperty’s location are woven throughout, such as silver leaf-painted glass\nresembling the Pacific Dogwood, the provincial flower of British Columbia, as\nwell as works of art curated by a local gallery. \n\n\n\nVancouver-based design firm Ste Marie Studio is at the helm of the redesigned\npublic spaces, including the lobby and its adjacent culinary concepts.\nChanneling the opulence of the Roaring Twenties, the lobby balances the\njubilance and elegance typical of that era with a sense of locality and warmth\nsynonymous with the Rosewood brand. Moody marbles and plush green velvets are\ncontrasted with contemporary notes and punches of colorful textile that\neffortlessly link both the front desk area and 1927 Lounge dining space.  \n\nDesigned to celebrate the rich history of the city, the newly refined bi-level\n1927 Lounge shines a light on the stories of downtown Vancouver, while\ncontinuing to offer fine dining and cocktails. The space features live\nperformances from musicians, with the musical soul of the space further\nemphasised by the sounds of a custom Fazioli Pianoforti Model F183 in California\nWalnut.\n\n\n\nCREDITS\nPHOTOGRAPHY: © NOE DEWITT",
        "summary": "New York-based design firm Lillian Wu Studio was tapped for the redesign of the 156 rooms and suites. Tranquil hues have been juxtaposed with patterned furnishings and jewel-toned accents. The newly refined bi-level 1927 Lounge shines a light on the stories of downtown Vancouver.",
        "source": "Sleeper Magazine",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-06-26",
        "title": "A reimagined Rosewood Hotel Georgia • Hotel Designs",
        "link": "https://hoteldesigns.net/industry-news/a-reimagined-rosewood-hotel-georgia-has-reopened/",
        "content": "A reimagined Rosewood Hotel Georgia\n\n\n\n\nRENOWNED AS VANCOUVER’S MOST FASHIONABLE RETREAT, ROSEWOOD HOTEL GEORGIA HAS\nREOPENED FOLLOWING AN EXTENSIVE FIVE-MONTH RENOVATION TO UNVEIL REIMAGINED\nCULINARY CONCEPTS AND LUXURY ROOMS AND SUITES…\n\n\n\n\n\nMeticulously curated to serve as the ultimate gathering place for culturally\nminded travellers and local aesthetes, Rosewood Hotel Georgia celebrates the\nhistory and heritage of Vancouver within a modern setting, complemented by an\narray of singular experiences. First opened in 1927 as Hotel Georgia, the\nproperty was last renovated in 2011 when it was introduced as Rosewood Hotel\nGeorgia. The reopening also marks the debut of an entirely new dining\ndestination, The Georgia Bar, further strengthening the property’s robust\nculinary program and paying homage to the iconic and beloved personalities that\nonce traversed through its corridors.\n\nImage credit: Rosewood Hotels & Resorts\n\nRosewood Hotel Georgia tapped New York-based design firm Lillian Wu Studio for\nthe redesign of its 156 rooms and suites. Reflecting the epitome of refined\ncomfort and sophistication, the accommodations were thoughtfully crafted as a\nsensorial experience with details such as leather wrapped accessories, plush,\ntufted headboards, horn handles with bronze patina holders, and hand-blown glass\nfixtures.\n\nWith a colour palette reflecting tranquil hues juxtaposed with patterned\nfurnishings and jewel-toned accents, the rooms and suites offer guests an\natmosphere of serenity and timeless luxury. Reflecting Rosewood’s A Sense of\nPlace philosophy, elegant nods to the property’s singular location are woven\nthroughout, such as silver leaf-painted glass resembling the Pacific Dogwood,\nthe provincial flower of British Columbia, as well as works of art curated by a\nlocal gallery.\n\nImage credit: Rosewood Hotels & Resorts\n\nServing as the crown jewels of the property, the Lord Stanley Suite and Rosewood\nSuite were renovated in 2021 and embody the bold spirit of the iconic guests who\nhave visited over the hotel’s almost hundred-year history. The 118 square-metre\n12th floor Lord Stanley Suite, adorned in gold and royal hues with distinctive\nfixtures, features two bedrooms, two bathrooms, a large living room, a dining\narea for up to six people, and a terrace with a private plunge pool, outdoor\nfireplace, and unobstructed views of Vancouver.\n\nSimilarly luxurious, the 138 square-metre Rosewood Suite, inspired by the\nverdant Pacific Northwest, offers two bedrooms, two baths, a spacious living\narea, and a rooftop garden terrace for up to 20 guests. Modern with sleek\nsilhouettes and graphic patterns, it can connect to an additional room for a\nthree-bedroom setup and includes a private plunge pool and fireplace with\nbird’s-eye views of Vancouver.\n\nImage credit: Rosewood Hotels & Resorts\n\nVancouver-based design firm Ste. Marie Studio is at the helm of the redesigned\npublic spaces including the lobby and adjacent culinary concepts. Channelling\nthe opulence of the Roaring ’20s, the Lobby balances the jubilance and elegance\ntypical of that era while layering in a sense of locality and warmth synonymous\nwith the Rosewood brand. Moody marbles and plush green velvets are contrasted\nwith contemporary flair and punches of colourful textile that effortlessly link\nboth the Front Desk area and 1927 Lounge dining space.\n\nImage credit: Rosewood Hotels & Resorts\n\nDesigned to celebrate the rich history of the city, the newly refined bi-level\n1927 Lounge shines a light on the prestigious narratives of downtown Vancouver\nwhile continuing to offer fine dining and artisanal cocktails. Creating a hub of\nactivity and entertainment for visiting guests and locals alike, the 1927 Lounge\nfeatures live performances from R&B, Jazz, and Soul artists on selective nights\nand special occasions. The musical soul of the space is further emphasised by\nthe sounds of a custom Fazioli Pianoforti Model F183 Art Case Edition in\nCalifornia Walnut, which serves as the perfect accompaniment for world-class\nacts that can be enjoyed from both 1927 as well as the new adjacent The Georgia\nBar.\n\nEmbodying the spirit of the gilded art deco era, The Georgia Bar is the hotel’s\nnew mixology-focused concept, centered around a dramatic, u-shaped Arabescatto\nOrobico marble-top bar with a backdrop of stately mahogany-panelled walls and\nmarble checkerboard floors. Cocooning guests are bespoke, custom furnishings\nproduced by artisan makers in Europe outfitted in soft upholsteries of crushed\nvelvets and rich leather, ornate crystal fixtures, unique archival objects, and\nan eclectic art collection, all infusing the ambiance with both elegance and\ncharacter.\n\nImage credit: Rosewood Hotels & Resorts\n\nThe Georgia Bar’s cocktail program transports guests to a storied world\nhonouring the luminaries and tales that are central to the hotel’s history.\nComplex in artistry and technique, the mixology program places the guest\nexperience first, with varying flavour profiles all centered around high quality\nand often painstakingly sourced ingredients. Taking guests on a journey through\nthe heart and history of Rosewood Hotel Georgia, the signature cocktail menu\nfeatures odes to the property’s heritage, with selections including the\nPatricia, a spirit forward cocktail that takes its name from the ‘Patricia\nRoom’, a dedicated space for HRH Edward, Prince of Wales, dating from the\noriginal hotel’s grand opening; and The Herrick, a wine-based cocktail with\nelements of Earl Grey tea and Verjus Blanc that pays tribute to Fred Herrick who\nserved as the property’s shoe shiner for 54 years.\n\nImage credit: Rosewood Hotels & Resorts\n\nFollowing the property’s initial reopening, Reflections Terrace will be\nreintroduced in the second half of 2024 as a year-round dining destination,\nmarking the rebirth of a local favourite. Upon its debut, Reflections will\nfeature a new, fully retractable roof and design elements inspired by\nVancouver’s surrounding landscapes, centered around a biophilic design that\nfurther brings the outdoors in.\n\nLocated in a storied space beneath the hotel, the recently opened Prophecy is a\nbrand-new concept designed to seamlessly blend classic sophistication with\nmodern allure, paying homage to the legacy of Rosewood Hotel Georgia and its\nrole in the past and future elegant nightlife in Vancouver. At the helm of its\ncocktail program is an award-winning team who have collaboratively created a\ncocktail menu inspired by writers, poets, musicians, and artists. Prophecy’s\nfood menu features a range of elevated, shareable options tailored to various\ntastes, ranging from familiar favourites to indulgent seafood selections.\nNoteworthy dishes include the decadent A5 Wagyu Katsu Sando. Adding to the food\nand beverage experience are state-of-the-art digital works by Apollo, a pioneer\nin progressive technology.\n\nBuilding upon the established collection at Rosewood Hotel Georgia, the\nproperty’s artwork has been seamlessly incorporated throughout the hotel to\nprovide guests with a unique cultural immersion. The collection showcases a\ndiverse array of modern artists – from blue-chip and mid-career to emerging\ncontemporary talents – across various mediums, including paintings, prints,\nphotography, and sculptures. Collaborating exclusively with local and national\nartists, the hotel leaned into the already present works from Canadian modern\nmasters and sought after artists like Guido Molinari, Marcel Barbeau, and Jack\nShadbolt, for inspiration. Directly influenced by those artists, the new pieces\nconverse together to create a cohesive collection that places Canadian art\nwithin a broader global dialogue.\n\nMain image credit: Rosewood Hotels & Resorts",
        "summary": "First opened in 1927 as Hotel Georgia, the property was last renovated in 2011 when it was introduced as Rosewood Hotel Georgia. The reopening also marks the debut of an entirely new dining destination, The Georgia Bar. The hotel’s luxury rooms and suites offer guests an atmosphere of serenity and timeless luxury.",
        "source": "Hotel Designs",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-09-19",
        "title": "Rosewood Hong Kong | The World's 50 Best Hotels 2023  | The Worlds 50 Best Hotels",
        "link": "https://www.theworlds50best.com/hotels/the-list/rosewood-hong-kong.html",
        "content": "2\n\nHong Kong\n\n * The Best Hotel in Asia 2023\n\n\nCONTEMPORARY WATERFRONT EXTRAVAGANCE IN HISTORIC KOWLOON\n\nA beacon of hospitality: When Rosewood Hong Kong opened in 2019, its 65-storey\ntower became an unmistakable feature of the city’s skyline. It’s the Rosewood\nHotel Group’s seventh location to open in Asia, delivering its signature luxe\nhospitality experience set to the stunning backdrop of Victoria Harbour and now\nnamed The Best Hotel in Asia 2023.\n\nArtful touch: The elegant interior of the hotel is the masterful work of\nTaiwanese-born designer Tony Chi, whose penchant for modern style and\nunderstated opulence is manifest throughout. Contemporary pieces accent its\nlobby and numerous hallways, including works by Damien Hirst and Henry Moore.\nOctagonal designs are also woven into the core of its design philosophy, drawn\nfrom the auspicious significance of the number eight in Chinese tradition.\n\nWhere am I sleeping? All 413 rooms in the hotel are a tale of two halves. The\nbedroom areas are all about neutral tones, plush seating and polished wood,\noffering a restrained aesthetic designed to encourage a state of total zen,\nrounded off by the floor-to-ceiling windows offering unparalleled vistas of Hong\nKong Island. Enter the bathrooms, however, to be greeted by symphony of marble\nand mirrors, eliciting the palatial feel of a bygone era. Perhaps a mismatch on\npaper, both work in total symbiosis to deliver a timeless and multi-faceted\ntaste of luxury across each guest’s stay.\n\nInternational dining: There are 11 restaurants housed within the hotel. From\nHolt’s Café, the Rosewood’s refined take on Hong Kong’s iconic cha chaan tengs,\nto the Italian-inspired Bluhouse and Indian eatery Chaat, there’s something for\nall tastes. Alongside its lauded dining outlets, the hotel is also home to one\nof Hong Kong’s most celebrated bars, Darkside, a high-ranking regular of the\nAsia’s 50 Best Bars annual list. Before departing, don’t leave without picking\nup one of its picture-perfect Parisian bites from the Butterfly Patisserie\ncounter adjacent to the lobby area.\n\nHong Kong homecoming: For Rosewood Hotel Group CEO and Hong Kong-native Sonia\nCheng, the Fragrant Harbour opening was a project decades in the making and is\nregarded as the brand’s flagship. Prior to the hotel’s construction, the area\nwas home to the New World Centre, a commercial and residential megacomplex built\nby Cheng’s grandfather in the 1970s. After its demolition in 2012, Cheng oversaw\nthe $2.5bn area redevelopment that would reinvigorate her family’s storied\nhistory with the waterside location.\n\n\nKEY INFORMATION\n\n * Rooms: 413\n * Starting Rate: $650\n * Dining: Bluhouse and The Dining Room\n * Drinking: Darkside\n * At the Hotel: Swimming pool, spa/wellness centre, fitness centre, family\n   friendly, Rosewood Explorers Club\n * 18 Salisbury Rd, Tsim Sha Tsui, Hong Kong\n * +852 3891 8888\n * Visit Rosewood Hong Kong's Website\n * Visit Rosewood Hong Kong on Facebook\n * Visit Rosewood Hong Kong on Instagram",
        "summary": "The 65-storey Rosewood Hong Kong opened in 2019. It is the Rosewood Hotel Group’s seventh location to open in Asia. The elegant interior of the hotel is the masterful work of Taiwanese-born designer Tony Chi. There are 11 restaurants housed within the hotel, including Bluhouse and Chaat.",
        "source": "The World's 50 Best Restaurants",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-06-18",
        "title": "Rosewood Hotel Georgia in Vancouver Reopens After Makeover",
        "link": "https://www.luxurytraveladvisor.com/hotels/rosewood-hotel-georgia-reopens-after-makeover",
        "content": "Rosewood Hotel Georgia in Vancouver has reopened following a five-month\nrenovation to unveil refreshed culinary concepts and accommodations, alongside a\nnew F&B option, The Georgia Bar. First opened in 1927 as Hotel Georgia, the\nproperty was last renovated in 2011 when it was introduced as Rosewood Hotel\nGeorgia.\n\nThe hotel tapped New York-based Lillian Wu Studio for the redesign of its 156\nrooms and suites, while Vancouver-based design firm Ste. Marie Studio redesigned\nthe hotel’s public spaces, including the lobby and culinary concepts. The newly\nrefreshed bi-level 1927 Lounge continues to offer fine dining and artisanal\ncocktails; open for guests and locals alike, the 1927 Lounge hosts live\nperformances from R&B, jazz and soul artists on select nights. The space also\nhouses a piano, which serves as an accompaniment for performances that can be\nenjoyed from both 1927 as well as The Georgia Bar, the hotel’s new\nmixology-focused concept. Its signature cocktail menu includes odes to the\nproperty’s heritage, complemented by a range of light bites.\n\n\n\nDeluxe King Preferred View Room (Photo by Rosewood Hotel Georgia)\n\nFollowing the property’s initial reopening, Reflections Terrace will be\nrelaunched in the second half of 2024 as a year-round dining destination. Upon\nits debut, Reflections will sport a biophilic design and a new, fully\nretractable roof.\n\nLocated in a space beneath the hotel, the newly opened Prophecy is a new F&B\nconcept that has a cocktail menu inspired by writers, poets, musicians and\nartists. Shareable plates are tailored to various tastes, and range from\nfamiliar favorites to seafood selections.\n\nRosewood Hotel Georgia has also introduced its bookable “Master Class” series\nled by the property’s food and beverage team. Guests will visit Vancouver’s\nGranville Market to select locally sourced, hyperseasonal ingredients that they\nwill then craft into both a signature dish and paired cocktail. Constantly\nshifting based on which Pacific Northwest delicacies are in prime harvest, the\nseries offers an immersive experience as well as a lesson in sustainable and\nhyperlocal cuisine.\n\n\nRELATED ARTICLES\n\nFairmont Empress Unveils Updated Fairmont Gold Experience\n\nKona Village, A Rosewood Resort Debuts New Signature Suites\n\nThe Spa at Four Seasons Hotel Toronto Unveils Wellness & Bio Bar\n\nRosewood Munich Unveils Five Signature Suites",
        "summary": "The Rosewood Hotel Georgia in Vancouver has reopened following a five-month renovation. The property was first opened in 1927 as Hotel Georgia, and was last renovated in 2011. The hotel tapped New York-based Lillian Wu Studio for the redesign of its 156 rooms and suites.",
        "source": "Luxury Travel Advisor",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-12-06",
        "title": "Latest news: Belmond adds in Mexico; group demand drives US profits; Rosewood to Barbuda",
        "link": "https://www.hotelinvestmenttoday.com/Development/Brands/Latest-news-Belmond-adds-in-Mexico-group-demand-drives-US-profits-Rosewood-to-Barbuda",
        "content": "Belmond adds in Mexico. Belmond has acquired Hacienda Katanchel, formerly a\nhacienda dating back to the 17th century situated near Merida, Yucátan in\nMexico. With an expanse of 220 hectares, the estate is home to a cenote\n(underground river), a sacred well, native flora and fauna, and the remains of\nan ancient Mayan pyramid, in addition to the historic hacienda, Katanchel, A\nBelmond Hotel, is planned to open in 2027 with 35 independent suites upon\ncompleting a comprehensive restoration program. On the Pacific Coast of\nMexico, Milaroca, A Belmond Hotel, Riviera Nayarit, will open in 2025.\n\nGroup drives US profits. Improvement in group demand across the Top 25 Markets\ndrove U.S. hotel revenue and profit growth, according to October P&L data from\nCoStar. October 2023 per-available-room metrics showed GOPPAR at $97.45 (+3.7%\nYOY); TRevPAR: $240.74 (+4% YOY); EBITDA PAR at $69.60 (-1.2% YOY); LPAR (Labor\nCosts) at $74.48 (+5.9% YOY). The industry saw its largest year-over-year\nincreases in GOPPAR and TRevPAR since March 2023. “The Top 25 Markets have\nshowed an 11% jump in GOPPAR year to date despite a 14% lift in labor costs,”\nsaid Audrey Kallman, research analyst at STR. “That double-digit GOPPAR growth\nwas more than 10 times the level seen in all other markets. New York City, an\nobvious business-centric market, led growth in the metric across the major\nmarkets on both a year-to-date and monthly basis.”\n\nHyatt's luxury pipeline. Hyatt Hotels Corp. reported a pipeline of more than 35\nluxury hotels and resorts globally through 2025. Hyatt said it has doubled the\nnumber of luxury rooms, tripled the number of resort rooms, and quadrupled the\nnumber of lifestyle rooms in five years. Fully, 70% of its rooms are categorized\nas luxury and upper upscale. Expansion includes the debut of Park Hyatt hotels\nin the UK, Mexico, and Malaysia; the Thompson Hotel brand’s expansion in Europe\nwith the first properties in Austria and Italy; the Andaz brand’s growth in the\nAmericas with its first hotel in the Caribbean; The Unbound Collection by Hyatt\nbrand’s first properties in the Nordics and India; as well as Hyatt luxury\ngrowth in Portugal, with the planned openings of Andaz Lisbon and Dreams Madeira\nResort, Spa & Marina.\n\nRosewood to Barbuda. Rosewood Hotels & Resorts will expand to the Caribbean\nisland of Barbuda in 2028 with developer Murbee Resorts. The beachfront Rosewood\nBarbuda will feature 50 resort suites and 35 Rosewood Residences.\nRosewood Barbuda will join Rosewood Baha Mar, Rosewood Little Dix Bay, and\nRosewood Le Guanahani St. Barth in the Caribbean.\n\nNew hotel coming to London Soho. Billionaire entrepreneur Asif Aziz has paid\naround £135 million for Haymarket House in Soho London with plans to convert the\nupper floors into a £400 million affordable hotel. The landmark ‘Happy’\nrestaurant and comedy club on the ground floor will remain.\n\nMarriott luxury milestone. Marriott International announced its 500th luxury\nhotel opening, The St. Regis Riyadh, with five more new hotels slated to open in\nthe final weeks of 2023. Over 200 luxury hotels and resorts across Marriott’s\nluxury portfolio are in the global development pipeline, including 24 properties\nexpected to open in 2024. Jenni Benzaquen, senior vice president of The\nRitz-Carlton and St. Regis Hotel & Resorts, said, “We are expanding the reaches\nof our portfolio to what we have coined ‘nu-luxury frontiers’ -\nboundary-breaking escapes that combine guests’ desires for authenticity,\nadventure, and exclusivity.”\n\nCrescent adds in Canada. Crescent Hotels & Resorts has added management of the\n106-room Josie Hotel, An Autograph Collection in Rossland, British Columbia, to\nits Latitudes: Lifestyles by Crescent portfolio.\n\nDavidson gets Salt Lake City hotel. The Athens Group and partner Hatteras Sky\nhave selected Pivot, the lifestyle operating vertical of Davidson Hospitality\nGroup, to operate and manage Asher Adams, its 225-room Marriott Autograph\nCollection hotel in downtown Salt Lake City. Opening in the fall of 2024, Asher\nAdams – which recently topped off construction – features the adaptive reuse of\nthe historic Union Pacific Depot Train Station which first opened its doors in\n1909. The hotel will consist of the historic train station as well as a new,\neight-story guestroom tower.\n\nSix Senses adds in Mexico. Six Senses has signed a management deal with Activos\nTuristicos de Mexico (ACTUR) for the development of Six Senses Xala in Mexico,\nwhich is scheduled to open in 2026 in the Costalegre or “Cheerful Coast” region\nof Jalisco. Six Senses Xala will comprise just 51 accommodations, all with\nprivate pools, ranging from beachfront and elevated guest rooms and suites to\none- to three-bedroom villas. Nearby, there will also be 25 four- and\nfive-bedroom branded residences.\n\nCliste Hospitality acquires in Belfast. Cork, Ireland-based Cliste Hospitaltiy\nhas acquired Belfast’s 120-room Radisson Blu Hotel for an undisclosed sum. The\ndeal was completed in partnership with real estate investment firm Warren\nPrivate. It is the second time these two companies have partnered on an\nacquisition. It is now set to be rebranded as The Gasworks Hotel and will\nundergo a £3.5 million refurbishment over the coming nine months. Once the\nrefurbishment is complete, the hotel will partner with InterContinental Hotels\nGroup, becoming part of the chain’s voco brand. Cliste Hospitality CEO Paul\nFitzgerald said the acquisition marks the company’s first hotel investment in\nthe North. Cliste Hospitality already manages 13 hotels in the Republic of\nIreland under the iNUA Collection brand.\n\nOmniyat, Dorchester partner again. Omniyat, Dubai, has initiated the\nconstruction of its latest project, Vela, in partnership with Dorchester\nCollection in Dubai. This development with 38 luxury, fully-furnished residences\ncomes on the heels of Omniyat’s recent acquisition of the Marasi Bay Marina in\nBusiness Bay. The 150-meter high structure will cover over 270,000 square feet\nacross 30 floors. The development, situated adjacent to Omniyat’s The Lana,\ngives Vela residents access to hotel services and a golf-buggy service along the\npromenade.\n\nMinor grows in Vienna. Minor Hotels will add an Anantara hotel in the Austrian\ncapital of Vienna. Transformed into a luxury hotel in 2013, the property\ncurrently operates as Palais Hansen Kempinski. As part of the group’s strategic\nexpansion across Europe, Anantara Palais Hansen Vienna Hotel will launch in\nMarch 2024 as it undergoes a significant renovation. The rebranded property will\nfeature 152 rooms and suites on three floors, including a 270-square meter\nPresidential Suite, the largest in the Austrian capital. Most recently in 2023\nAnantara has continued its strategic expansion in Europe with the launches of\nAnantara Plaza Nice Hotel in France, Anantara Convento di Amalfi Grand Hotel on\nthe famed Amalfi Coast in Italy and Anantara The Marker Dublin Hotel in Ireland.\n\nNew management for Canopy in Scottsdale. Lodging Dynamics Hospitality Group,\nProvo, Utah, has been appointed to manage the 177-room Canopy by Hilton\nScottsdale Old Town in Arizona.\n\nRenaissance to North Carolina development. The Research Triangle Foundation of\nNorth Carolina, stewards of Research Triangle Park, have announced plans to work\nwith Dallas-based developer Alamo Manhattan to develop a 250-room\nMarriott-branded Renaissance Hotel for its downtown Hub RTP. An affiliate of\nreal estate investment firm NexPoint Advisors, LP, recently completed the\npurchase of the site in the heart of the Hub RTP development. Renaissance RTP\nwill also offer more than 13,000 square feet of meeting space for the hotel\nslated to begin summer 2024.\n\nAccess Point works with Innisfree. Access Point Financial has arranged a $18.5\nmillion acquisition loan for the 94-room Hampton Inn & Suites St.\nAugustine-Vilano Beach, located in St. Augustine, Florida. APF quickly stepped\nup after another lender unexpectedly backed out and helped the sponsor,\nInnisfree Hotels, close in less than three weeks as Hurricane Idalia was making\nlandfall and headed towards St. Augustine, Florida.",
        "summary": "Belmond has acquired Hacienda Katanchel, formerly a 17th century hacienda in Mexico. Hyatt Hotels Corp. reported a pipeline of more than 35 luxury hotels and resorts globally through 2025. Rosewood Hotels & Resorts will expand to the Caribbean island of Barbuda.",
        "source": "Hotel Investment Today",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-05-01",
        "title": "Rosewood Hotels Aims to Double Luxury Footprint This Decade",
        "link": "https://skift.com/2022/12/07/rosewood-hotels-aims-to-double-luxury-footprint-this-decade/",
        "content": "The formula for luxury hotels has typically had two key ingredients. First,\nchoose locations in the districts where the elite live. Second, focus on\nhigh-touch services encouraging guests to linger, and spend, at the property.\n\nBut Rosewood Hotels & Resorts has taken somewhat alternative approaches when it\ncreated the 30 luxury hotels it operates today — and as it builds the 25 luxury\nhotels it has in the pipeline. Its strategy responds to shifts in consumer\ntastes.\n\n“Today’s client is looking for an immersive, stand-out experience,” said Radha\nArora, president and co-chief development officer. “Gone are the days when you\ngo and build right smack in the middle of the obvious epicenter of fashion,\nshopping, or nightlife.”\n\nTo be sure, Rosewood Hotel Group does broadly target major tourist destinations.\nNext year, the brand plans to open Rosewood Munich, the brand’s first property\nin Germany, and Rosewood Schloss Fuschl, the group’s second property in Austria.\nIn 2024, Rosewood Rome aims to debut. In 2025, Rosewood Milan and Rosewood Hotel\nBauer near Venice are slated to open. The company also intends to expand in\nAsia, with nine announced openings, and in Latin America, where it debuted\nRosewood São Paulo this year. It’s also growing a branded residential offering\nworldwide.\n\n\nGEOGRAPHIC ARBITRAGE AND THE NEW LUXURY\n\nBut the difference is in the nuance. The conventional wisdom in building luxury\nhotels has been to go to the traditionally most desirable neighborhoods in\npopular destinations because being seen by the right people is often what guests\nwant most. Yet Rosewood often takes a contrarian approach.\n\nWhen it opened in London, for example, it took on a property in “the City,” or\nfinancial district, rather than a district like Mayfair or Knightsbridge. The\nbrand bet that its core customer, the next-generation elite, would put an\nespecially high value on memorable experiences, which it believed the character\nof the building lent itself to creating.\n\nA flamboyantly decorated, Edwardian-era insurance office was reconfigured as\nRosewood London. Its central carriageway entrance is where the gates open up and\ntraditionally glad staff welcome guests to enter through doors that look like\nthe front door to number 10 Downing Street.\n\n“Creating the sense you’re arriving into a manor or estate in an intimate way\nlike we did there isn’t possible to do elsewhere in central London,” Arora said.\n\n\nOFF-CENTER TARGETS\n\nAs money earmarked to chase high-end real estate assets expands, targets can\nbecome elusive. Part of the Rosewood formula has been finding properties away\nfrom tourist epicenters that can be converted in a lightweight way and can drive\nhigh average daily rates under the Rosewood brand.\n\nA case in point: Creating Rosewood Castiglion del Bosco involved transforming a\nproperty that wasn’t located in one of Tuscany’s most sought-after areas.\n\n“It wasn’t capital intensive because the project was already built,” Arora said.\n“The Cheng family did take 50 percent ownership at first but then sold that at a\ngood price, and the project didn’t need any capital injection. All it needed was\nthe power of the brand. When we took over Castiglion del Bosco, within the first\ndays we were almost $2 million, I mean, €2 million, up on what the property had\nbeen generating before.”\n\nIn Saint Barts, the group worked with real estate mogul David Bonderman who was\nthen the owner of Le Guanahani, located on the less visited northern side of the\nisland. Four years of renovations on the three-decade-old family resort\ntransformed it into Rosewood Le Guanahani.\n\n“We’ve seen the revenues in the festive season to be 70 percent higher than\nbefore the property was branded Rosewood,” Arora said.\n\nBy choosing locations that haven’t yet been dominated by the scenesters,\nRosewood has a shot at creating the new local scene while also working with\ncapital partners to buy buildings at relatively cheaper prices than properties\nin more central locations.\n\n“If you take Rosewood Mayakoba, for instance, there was nothing there in that\npart of the Riviera in the luxury end,” Arora said. “We built and it became the\ndestination.”\n\n\nLUXURY LAND GRAB\n\nCreating anything in famously expensive cities such as Hong Kong, London, or New\nYork will involve expense. But Rosewood tries to find undervalued assets to give\nit a margin cushion after revitalization. Its developers divide and conquer\npotential luxury travel fiefdoms.\n\nTo encourage repeat visits by past customers, which is cheaper than acquiring\nnew guests, the company believes building a network of properties that are all\ndistinctive creates a virtuous cycle of surprise and delight.\n\nA Rosewood customer that liked staying in a hale, or a glamorous beach bungalow\nin Hawaiʻi’s Kona Village, A Rosewood Resort (which aims to open on the big\nisland in summer 2023), may like the contrast with the very urban and old-school\nRosewood Vienna, which has only 99 guest rooms and suites in a residential-style\nAustrian neighborhood.\n\nThe Vienna property has furniture meant to evoke past local aesthetics, such as\nthe Wiener Werkstätte style at the turn of the 20th century.\n\n“In choosing the pieces of furniture for Vienna, we had a thoughtful designer\nwork with local partners and the ownership to make sure we curated something\nmindful of what the returns would be insofar as revenues are concerned after\neffectively attracting a clientele that could support the desire rate,” Arora\nsaid.\n\nA representation of the planned Kona Village, A Rosewood Resort. Source:\nRosewood.\n\n\nCREATING OFF-PROPERTY EXPERIENCES\n\nMost of Rosewood’s customers are leisure travelers who care more about the\nexperiential aspect of trips than business travelers ordinarily do.\nHigh-net-worth travelers make up the most profitable segment of its customer\ndatabase. Many of these travelers seek “the new luxury” defined more by\nexperiences than showing off status symbols and checking boxes on seeing\nparticular sights.\n\nOne of Rosewood’s calling cards is having staff talk to guests and offering to\ninvent relevant, bespoke experiences for them. If guests are foodies, it might\npropose a multi-day excursion to Oaxaca, Mexico, with Rosewood staff guiding an\nexploration of the food scene — even though Rosewood doesn’t have a property\nthere.\n\n“We don’t just arrange it,” Arora said. “We will go with you. We’re not just\nselling someone else’s private tours. We want to help like-minded guests really\nget to know each other, so we have a small nucleus of a client database that’s\nbecome friends through Rosewood experiences.”\n\nRosewood São Paulo opened this year. Source: Rosewood.\n\n\nEXPANDING WORLDWIDE\n\nLike many China-based companies, Rosewood is part of a conglomerate, New World,\nwith interests in multiple sectors. Rosewood Hotels Group is led by CEO Sonia\nCheng, a member of the billionaire Cheng family that runs parent conglomerate\nNew World.\n\nIn the 2021 fiscal year, the hotel operations segment of New World reported\nrevenue of approximately $100 million (807.6 million Hong Kong Dollars), which\naccounted for 1.2 percent of the conglomerate’s revenue.\n\n“I want to ensure that wherever we build Rosewood properties, ‘sense of place’\nis not just a tagline but infused into every aspect,” Arora said.",
        "summary": "Rosewood Hotels & Resorts has taken somewhat alternative approaches when it created the 30 luxury hotels it operates today. Next year, the brand plans to open Rosewood Munich and Rosewood Schloss Fuschl. The company also intends to expand in Asia, Latin America, and in Latin America.",
        "source": "Skift",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-05-30",
        "title": "Edouard Grosmangin has been appointed Regional Vice President, Mexico and South America at Rosewood Hotels & Resorts, Mexico and South America",
        "link": "https://www.hospitalitynet.org/appointment/79028341.html",
        "content": "Rosewood Hotels & Resorts® is pleased to announce the appointment of Edouard\nGrosmangin as Regional Vice President, Mexico and South America, effective May\n1, 2024. This strategic move comes after Edouard's remarkable leadership as\nManaging Director of Rosewood São Paulo, where he has played a pivotal role in\nthe continued success of the renowned hotel since its launch in 2022.\n\nEdouard brings a wealth of experience and a proven track record of excellence in\nthe hospitality industry. Under his leadership, Rosewood São Paulo has been\ncemented as a global icon, recognized for its innovative approach and\nexceptional guest experiences. The hotel has garnered numerous accolades,\nincluding being named Best Hotel in South America 2023 by The World's 50 Best\nHotels. A visionary hotelier with a strong commitment to sustainability and\nsocial impact, Edouard's dedication to purpose-led initiatives further earned\nthe property recognition as one of Rosewood's Impact Trailblazers, leading the\ncharge towards creating a future where people and planet enrich one another by\nfostering sustainable practices and empowering individuals across our ecosystem.\n\n\"We are thrilled to recognize Edouard and the many achievements and milestones\nhe has accomplished since joining our group by naming him as our Regional Vice\nPresident for Mexico and South America,\" said Joerg Zobel, Chief Operating\nOfficer of Rosewood Hotel Group. \"His passion for hospitality, coupled with his\ncollaborative spirit and limitless creativity, makes him the ideal leader to\nguide our properties in these key markets, where we are anticipating a great\ndeal of growth. We thank Edouard for his immeasurable contributions to the\nRosewood brand to-date and look forward to the region's continued success under\nthis leadership.\"\n\nPrior to his role at Rosewood São Paulo, Edouard held key leadership positions\nin renowned properties across Asia, the Middle East, and Europe. His tenure as\nGeneral Manager at Raffles Seychelles and Six Senses Zil Pasyon and Con Dao\nshowcased his ability to drive performance and strategic direction, further\nsolidifying his reputation as a leader in the industry.\n\nIn his new role as Regional Vice President, Mexico and South America, Edouard\nwill oversee the operations and strategies of Rosewood properties across the\nregion including Rosewood Mayakoba, Las Ventanas al Paraíso, A Rosewood Resort,\nRosewood San Miguel de Allende and Rosewood São Palo, as well as the upcoming\nRosewood Mandarina in Riviera Nayarit and Rosewood Mexico City. With a focus on\nfostering excellence and synergy, he is poised to continue driving growth and\nelevating Rosewood's brand presence and positioning in Mexico and South America.",
        "summary": "Edouard Grosmangin has been named Regional Vice President, Mexico and South America. He will oversee the operations and strategies of Rosewood properties across the region. Edouard brings a wealth of experience and a proven track record of excellence in the hospitality industry.",
        "source": "Hospitality Net",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-06-03",
        "title": "Rosewood Hotels & Resorts appoints new Regional Vice President for Mexico and South America - Sleeper",
        "link": "https://www.sleepermagazine.com/stories/people/rosewood-hotels-resorts-appoints-new-regional-vice-president-for-mexico-and-south-america/",
        "content": "Rosewood Hotels & Resorts has announced the appointment of Edouard Grosmangin as\nRegional Vice President in Mexico and South America.\n\nIn his new role, Grosmangin will oversee the operations and strategies of\nRosewood properties across the region, poised to continue driving growth in the\nregion. \n\nGrosmangin brings a wealth of hospitality experience, having held the position\nof Managing Director of Rosewood São Paulo since its launch in 2022. A hotelier\nwith a commitment to sustainability and social impact, his dedication to\npurpose-led initiatives earned the property recognition as one of Rosewood’s\nImpact Trailblazers.\n\nPrior to his role at Rosewood São Paulo, Grosmangin also held key leadership\npositions in properties across Asia, the Middle East and Europe, including\nGeneral Manager at Raffles Seychelles and Six Senses Zil Pasyon. \n\n“We are thrilled to recognize Edouard and the many achievements and milestones\nhe has accomplished since joining our group by naming him as our Regional Vice\nPresident for Mexico and South America,” says Joerg Zobel, Chief Operating\nOfficer of Rosewood Hotel Group. “His passion for hospitality, coupled with his\ncollaborative spirit and limitless creativity, makes him the ideal leader to\nguide our properties in these key markets, where we are anticipating a great\ndeal of growth. We thank Edouard for his immeasurable contributions to the\nRosewood brand to-date and look forward to the region’s continued success under\nthis leadership.”",
        "summary": "Edouard Grosmangin has been appointed Regional Vice President in Mexico and South America. He will oversee the operations and strategies of Rosewood properties across the region. Gros mangin brings a wealth of hospitality experience, having held the position of Managing Director at Rosewood São Paulo.",
        "source": "Sleeper Magazine",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-10-31",
        "title": "Rosewood Hotels & Resorts announces plans for first Greek hotel - Sleeper",
        "link": "https://www.sleepermagazine.com/stories/projects/rosewood-hotels-resorts-announces-plans-for-first-greek-hotel/",
        "content": "Rosewood Hotels & Resorts is making its debut in Greece, opening Rosewood Blue\nPalace in Crete.  \n\nA reincarnation of an existing resort, Crete’s Blue Palace will reopen as part\nof the Rosewood portfolio in 2025, following redesign. Nestled between the small\nfishing village of Plaka and the elegant port of Elounda, Rosewood Blue Palace\nwill be seamlessly integrated into its surroundings, offering an oasis that\nconnects guests to Crete’s culture and history.  \n\nOwned by Phāea Resorts, the property will comprise 154 rooms and suites – 85 of\nwhich will be accompanied by private pools. Grecian firm K-Studio are at the\nhelm of interior design, realising a vision informed by Cretan traditions.\nTaking care of the food and beverage venues, Greek-born, London-based Afroditi\nKrassa has been tapped to create the interiors of the resort’s six restaurants\nand bars. \n\nThe resort will feature an Asaya spa – Rosewood’s signature – alongside a\nfitness centre, movement studio, yoga pavilion and dedicated areas for guests to\nexplore hydrotherapy treatments. Three outdoor pools meanwhile will offer\npanoramic ocean views. \n\n\n\n“With a compelling landscape that has fascinated explorers for centuries, we are\ndelighted to mark our entrance into Greece with this stunning resort,” said\nSonia Cheng, Chief Executive Officer of Rosewood Hotel Group. “Crete is an ideal\nlocation for creating meaningful connections that bring our guests closer to the\nsoul of the destination and takes them far beyond their expectations.” \n\nAgapi and Constanza Sbokou, Co-Chief Executive Officers, Phāea Resorts add:\n“Through two decades of dedication, Blue Palace has been our heart’s endeavor,\nour family’s legacy, and a testament to the true soul of Crete – a history\nmarked by exceptional service and attention to detail. We could not have found a\nbetter partner than Rosewood, known for their mindful approach, timeless\nelegance and extraordinary experiences, for Blue Palace’s next chapter. \n\n“Rosewood’s commitment to preserving the essence of each destination aligns\nseamlessly with our vision for the resort, ensuring that every guest is\nenveloped in the warmth of genuine hospitality. Entrusting Blue Palace’s legacy\nto Rosewood Hotels & Resorts allows us to embark on a new journey, nurturing our\nvision with Phāea.” \n\nRosewood Blue Palace will add to the group’s existing collection of European\nproperties, including Rosewood London, Hôtel de Crillon, A Rosewood Hotel,\nRosewood Vienna and Rosewood Munich, with Rosewood Amsterdam and Rosewood\nSchloss Fuschl set to open over the next year.",
        "summary": "Rosewood Hotels & Resorts will open Rosewood Blue Palace in Crete in 2025. The property will comprise 154 rooms and suites, 85 of which will be accompanied by private pools. The resort will feature an Asaya spa – Rosewood’s signature – alongside a fitness centre, movement studio, yoga pavilion and dedicated areas for hydrotherapy treatments.",
        "source": "Sleeper Magazine",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-06-12",
        "title": "Six Rosewood Hotels Aim to Blend Luxury Travel With Positive Social Impact",
        "link": "https://skift.com/2024/06/12/six-rosewood-hotels-aim-to-blend-luxury-travel-with-positive-social-impact/",
        "content": "SKIFT TAKE\n\nCan you combine indulgence with making a meaningful difference? Rosewood\nbelieves it will at a half-dozen of its ultra-luxury hotels.\n\nSean O'Neill\n\nRosewood Hotel Group, the ultra-luxury brand, has quietly launched a program\nthat sets a higher bar for meeting environmental, social, and governance (ESG)\ngoals.\n\nThe initiative, called Impact Trailblazers, spotlights hotels that pledge to\nachieve at least one of six stretch goals by 2025. Goals include reducing waste\nlike single-use plastics, sourcing supplies locally, and developing community\npartnerships to hire locally.\n\n“These properties are not just meeting our ambitious sustainability goals —\nthey’re exceeding them, showcasing that luxury and positive impact can be\nsynonymous,” said Mehvesh Mumtaz Ahmed, vice president of social impact at\nRosewood Hotel Group, in an exclusive interview.\n\nRosewood hopes its half-dozen top performers inspire all of its hotels and the\nbroader industry. It operates 44 hotels and has over 30 in development.\n\nThe program claims to have some early results. Rosewood São Paulo has achieved\n90% waste diversion, operates on 100% renewable energy, and has hired 45% of its\nworkforce from underserved groups. Rosewood Phuket sources all ingredients for\nits signature restaurant locally. Rosewood Mayakoba in Mexico supports a\nnon-profit school, while Rosewood Phnom Penh partners with a vocational training\nnon-profit in Cambodia.\n\nRosewood Mayakoba. Source: Rosewood.\n\n\nROSEWOOD’S IMPACT\n\nHere are some of the early successes claimed by these hotels.\n\n * Rosewood São Paulo has achieved 90% waste diversion and operates on 100%\n   renewable energy. It has hired 45% of its workforce from underserved local\n   groups.\n\n * Rosewood Phuket has been one of the local pioneers in environmental\n   sustainability, earning LEED Gold Certification and achieving local sourcing\n   goals. Its signature restaurant, Ta Khai, sources all ingredients locally,\n   supporting community farmers using sustainable practices.\n\n * Rosewood Mayakoba revived a non-profit school in Riviera Maya that had\n   stopped functioning and now supports over 450 students. It recently added a\n   separate building for a new secondary school.\n\n * Rosewood Phnom Penh partners with a local non-profit offering vocational\n   training to Cambodian youth, bringing in students for performances and\n   demonstrations of local artistic traditions.\n\n * Rosewood Baha Mar focuses on coral conservation in The Bahamas, partnering\n   with the Bahamas Reef Environment Educational Foundation. The resort employs\n   95% local staff and promotes diversity and female representation at\n   supervisory levels.\n\n * Rosewood Hong Kong introduced BluHouse, a restaurant concept that employs\n   refugees and ethnic minorities.\n\n\nHOTEL BUSINESS BENEFITS\n\nAhmed challenged the notion that doing good compromises business performance.\n\n“The travel sector accepts that there’s a trade-off between doing well and doing\ngood far too easily,” Ahmed said. “The fact that two of our Impact Trailblazers\nproperties — Rosewood Hong Kong and Rosewood São Paulo — were recently featured\nin the latest 50 Best Hotels list shows that there’s definitely not a trade-off\nin delivering luxury and having a positive social impact.”\n\nThe efforts can also translate into enhancing guest loyalty.\n\n“Luxury is a feeling,” Ahmed said. “It’s about the connection we create with our\nguests, and this can be fostered even without spelling out the social impact\npiece.”\n\n“If you’ve stayed at Rosewood Mayakoba, you’ll know that each guest receives a\nbeautiful little, colorful, folklore animal representative of Mayan culture,”\nAhmed said. “Guests have commented positively on these figurines. But what most\ndon’t know is that these figures are special because they are carved through a\npartnership with a social enterprise that hires women recovery from domestic\nabuse.”\n\nRosewood executives also believe that hotels with a social impact work have a\nbetter chance of attracting and retaining top talent.\n\n“The pandemic has accelerated this trend of people wanting to know that the work\nthat they are doing most of the hours of their day is doing something positive\nfor the world,” Ahmed said.\n\n\nACCOMMODATIONS SECTOR STOCK INDEX PERFORMANCE YEAR-TO-DATE\n\nWhat am I looking at? The performance of hotels and short-term rental sector\nstocks within the ST200. The index includes companies publicly traded across\nglobal markets, including international and regional hotel brands, hotel REITs,\nhotel management companies, alternative accommodations, and timeshares.\n\nThe Skift Travel 200 (ST200) combines the financial performance of nearly 200\ntravel companies worth more than a trillion dollars into a single number. See\nmore hotels and short-term rental financial sector performance.\n\nRead the full methodology behind the Skift Travel 200.",
        "summary": "Rosewood Hotel Group has quietly launched a program that sets a higher bar for meeting environmental, social, and governance (ESG) goals. The initiative, called Impact Trailblazers, spotlights hotels that pledge to achieve at least one of six stretch goals by 2025. Rosewood São Paulo has achieved 90% waste diversion and operates on 100% renewable energy.",
        "source": "Skift",
        "sentiment": 0.0,
        "keywords": [],
        "categories": [],
        "image": null
    }
]