[
    {
        "publication_date": "2023-09-26",
        "title": "Bloomberg - Are you a robot?",
        "link": "https://www.bloomberg.com/news/articles/2023-09-26/arcelormittal-ceo-sees-global-steelmakers-buoyed-by-china-output-limits",
        "content": "WHY DID THIS HAPPEN?\n\nPlease make sure your browser supports JavaScript and cookies and that you are\nnot blocking them from loading. For more information you can review our Terms of\nService and Cookie Policy.\n\n\nNEED HELP?\n\nFor inquiries related to this message please contact our support team and\nprovide the reference ID below.\n\nBlock reference ID:",
        "summary": "summarize: WHY DID THIS HAPPEN? Please make sure your browser supports JavaScript and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy. For inquiries related to this message please contact our support team and provide a reference ID.",
        "source": "Bloomberg",
        "sentiment": -0.04044743813574314,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-07-20",
        "title": "Best Chess Players Share $90,000 Prize Fund at International Chess Festival - The Astana Times",
        "link": "https://astanatimes.com/2023/07/best-chess-players-share-90000-prize-fund-at-international-chess-festival/",
        "content": "ASTANA – The strongest chess players shared a record prize fund of 40 million\ntenge ($90,094) at the Astana Zhuldyzdary (Stars of Astana) International Chess\nFestival, the tournament’s press service reported on July 19.\n\nClosing ceremony of Astana Zhuldyzdary International Chess Festival on July 19.\nPhoto credit: festival’s press service.\n\nAstana Zhuldyzdary, hosted on July 11-19 to mark the capital’s 25th anniversary\nand headed by well-known Kazakh chess player Dinara Saduakassova, featured\nincredible chess battles, where many players bestowed new international titles,\nand some became grandmasters (GMs). It contributed to boosting chess development\nby involving new players and discovering new talents.\n\nAditya Mittal of India won a four million tenge ($9,009) cash prize for taking\nfirst place at the tournament. Ukrainian GM Alexander Moiseenko took silver and\nreceived 3.5 million tenge ($7,883), while Israel’s Evgeny Alexeev got the\nbronze and three million tenge ($6,757).\n\nThe winners were awarded by the Kazakh Minister of Culture and Sports Askhat\nOralov, Kazakh Olympic champion Serik Sapiyev, representatives of the Kazakhstan\nChess Federation, and other renowned public figures and athletes.\n\nMore than 800 chess players from 16 countries, most of whom are children,\nparticipated in the festival in Astana and showcased their skills and\nexperience.\n\nChildren and adults with special needs, including musculoskeletal, vision,\nhearing, and other impairments, also competed at the tournament.\n\n“It was a real festival of intelligence, victories, and new achievements. Astana\nZhuldyzdary was a vivid example of how chess can unite people of different ages,\nnationalities, and cultures, creating strong ties and friendly relations,”\nSaduakassova said at the closing ceremony.\n\nThe festival hosted four tournaments, including the Kazakhstan Cup stage among\nmen and women, amateur, junior, and blitz. Some of the games lasted for three to\nfive hours.\n\nParticipants included top chess players, including GM Hans Moke Niemann of the\nUnited States, Armenian GMs Shant Sargsyan and Manuel Petrosyan, Asian women’s\nchess champion Divya Deshmukh of India, and other players from Azerbaijan,\nIsrael and Ukraine.\n\nThe festival included a first seminar for the title of the International Chess\nFederation (FIDE) Organizer in Kazakhstan, headed by international arbiter and\nFIDE lecturer Vadim Tsypin from Canada, aimed at training Kazakh professionals\nwho can conduct world-class chess tournaments according to FIDE standards.\n\nAzamat Zhamanchinov, Child Protection Officer of the United Nations Children’s\nFund in Kazakhstan, taught parents about the principles of positive parenthood\nand trust building in relationships with children.\n\nHe emphasized that violence can be both physical and psychological, stressing\nthe dangers of ignoring children’s needs.\n\nThe festival organized games between children and high-ranking players,\nincluding Saduakassova, Kazakh GM Murtas Kazhgaleyev, Ukrainian GM Vitaliy\nBernadskiy and Belarusian GM Vladislav Kovalev.\n\nThe festival organizers also offered children tours to the National Museum of\nKazakhstan, the Nur-Alem EXPO spherical museum, the oceanarium, and the Atameken\nEthno-Memorial Complex.\n\nGet The Astana Times stories sent directly to you! Sign up via the website or\nsubscribe to our Twitter, Facebook, Instagram, Telegram, YouTube and Tiktok!",
        "summary": "Astana Zhuldyzdary (Stars of Astana) International Chess Festival held from July 11-19. More than 800 chess players from 16 countries took part in the festival in Astana. Children and adults with special needs, including musculoskeletal, vision and other impairments, also competed.",
        "source": "The Astana Times",
        "sentiment": 0.06892454624176025,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-11-02",
        "title": "Aditya Mittal triumphs at Pavlodar Open 2023 with a 2722 performance - ChessBase India",
        "link": "https://www.chessbase.in/news/Aditya-Mittal-triumphs-at-Pavlodar-Open-2023-",
        "content": "by Shahid Ahmed - 02/11/2023\n\nGM Aditya Mittal scored an unbeaten 8/10 to win Pavlodar Open 2023. He also made\nthe exact same score few months when he won Astana Zhuldyzdary International\nChess Festival Open A 2023. The 16-year-old finished a half point ahead of a\nstrong field which featured 14 more GMs from all over the world. He performed at\n2722 and gained 18.4 Elo rating points. GM Mihail Nikitenko and GM Dmitry\nBocharov scored 7.5/10 each. They were placed second and third respectively\naccording to tie-breaks. The total prize fund of the festival was 23000000\nTenge. The top three prizes were 4000000, 3000000 and 2500000 each respectively.\nAditya won approx. ₹710800. This is his second triumph of the year in\nKazakhstan. Overall he has won three tournaments in 2023 so far. Photos: Islam\nDakhayev/Chess Kazakhstan\n\n\nADITYA WINS HIS SECOND EVENT OF THE YEAR IN KAZAKHSTAN\n\nGM Aditya Mittal headed into the final round with a sole lead 7.5/9. He drew his\nfinal round game against GM Zhamsaran Tsydypov to become a clear champion.\nEarlier this year, Aditya won Astana Zhuldyzdary Open 2023 in July with an\nidentical unbeaten 8/10 score and becoming a clear champion. The teenager\nbettered his previous triumph in Kazakhstan as he performed at 2722 which was\n2668 last time. It goes without saying that Kazakhstan is really a great place\nfor India's 77th GM.\n\n\n\nChampion - GM Aditya Mittal 8/10\n\n\n\nTop 3: 2nd GM Mihail Nikitenko 7.5/10, 1st GM Aditya Mittal 8/10 and 3rd GM\nDmitry Bocharov 7.5/10\n\n\n\nTournament banner\n\n\n\nGM Aditya Mittal deep in thought\n\n\n\nAditya Mittal scored an unbeaten 8/10 to win the tournament with a performance\nof 2722 and gained 18.4 Elo rating points\n\n\n\nGM Aditya Mittal with his mother Kusum Mittal\n\n\n\n\n\nThe tournament hall\n\nThe legend, Vishy Anand congratulated Aditya Mittal on his triumph\n\n> \n\nOpening Ceremony | Video: Dastan Kapaev\n\nRound 10 Highlights | Video: Dastan Kapaev\n\nA total of 84 players including 15 GMs, 21 IMs and 2 WIMs took part from 15\ncountries across the world in the Masters A (≥ 2000) category. The tournament\nwas organized by Kazakhstan Chess Federation and Chess Federation of Pavlodar\nRegion in Pavlodar, Kazakhstan from 22nd to 31st October 2023. The time control\nwas 90 minutes + 30 seconds increment from move no.1.\n\n\nROUND 10 RESULTS\n\nBo.No. NameRtgPts.ResultPts.NameRtg No.15GMAditya, Mittal25727½½ -\n½6½GMTsydypov, Zhamsaran25487210GMLintchevski, Daniil25426½½ - ½7GMNikitenko,\nMihail252711313GMBocharov, Dmitry25196½1 - 06GMTiviakov,\nSergei2543941GMDemchenko, Anton260861 - 06Sviridov,\nValery252612520IMFaizrakhmanov, Ramil24606½ - ½6GMAlekseev,\nEvgeny2573466GMRasulov, Vugar256060 - 16GMMakhnev, Denis246619721IMAgmanov,\nZhandos24526½ - ½5½GMSavchenko, Boris251314827IMSamusenko, Maksim24275½0 -\n15½GMSuleymenov, Alisher251215975Zheenbekov, Nurgazy20605½0 - 15½GMZierk,\nSteven2488171018IMUrazayev, Arystanbek24785½½ - ½5½IMZarubitski,\nViachaslau242926\n\nDetails\n\n\nFINAL STANDINGS\n\nRk.SNo NameTypsexFEDRtgPts. TB1  TB2  TB3 15GMAditya,\nMittalIND2572858,560211GMNikitenko, MihailBLR25277,56060313GMBocharov,\nDmitryRUS25197,555,56041GMDemchenko, AntonSLO260875850510GMLintchevski,\nDaniilRUS254275740619GMMakhnev, DenisKAZ24667555077GMTsydypov,\nZhamsaranRUS254875250820IMFaizrakhmanov, RamilRUS24606,55540915GMSuleymenov,\nAlisherKAZ25126,554,5501021IMAgmanov, ZhandosKAZ24526,552,530\n\nDetails\n\n\nLINKS\n\nOfficial site\n\nTournament details\n\n--------------------------------------------------------------------------------\n",
        "summary": "GM Aditya Mittal scored an unbeaten 8/10 to win the tournament with a performance of 2722 and gained 18.4 Elo rating points. The 16-year-old finished a half point ahead of a strong field which featured 14 more GMs from all over the world. GM Mihail Nikitenko and GM Dmitry Bocharov scored 7.5/10 each.",
        "source": "ChessBase India",
        "sentiment": 0.01712338626384735,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-07-30",
        "title": "Meet Usha Mittal’s son and CEO of ArcelorMittal, Aditya Mittal; know about his journey and how he took forward the legacy built by his father Lakshmi Mittal",
        "link": "https://www.financialexpress.com/life/lifestyle-meet-usha-mittals-son-and-ceo-of-arcelormittal-aditya-mittal-know-about-his-journey-and-how-he-took-forward-the-legacy-built-by-his-father-lakshmi-mittal-3191898/",
        "content": "USHA MITTAL HAS BEEN INFLUENTIAL IN ENCOURAGING WOMEN’S EDUCATION IN INDIA AND\nPROPAGATES THE NEED TO EDUCATE THE YOUTH.\n\n\n\nThere is no greater joy than having a family who are your biggest cheerleaders.\nParents often go out of their way to support their children to help them reach\ngreater heights. One such family who has stuck together and has only grown\nstronger is the Mittals. And, the driving force behind them is Usha Mittal, she\nis not only the wife of steel baron, Lakshmi Mittal but is also a prominent\nmember of the business, ArcelorMittal. Their son and the present CEO of the\ncompany, Aditya Mittal has taken the helm of the business.\n\nUsha and Lakshmi Mittal’s son, Aditya Mittal born in 1976 in India and raised in\nIndonesia. After completing his education from Wharton School of Business,\nUniversity of Pennsylvania, he reportedly worked in investments before joining\nthe family firm in 1997. He was named Head of Mergers and Acquisitions in 1999\nand has been an influential member of the company.\n\nAditya played a key role in Mittal Steel’s acquisition of Arcelor and its\nmerging with Mittal Steel in 2006. The name of the business, ArcelorMittal was a\nresult of this merger.\n\nMukesh Ambani hires 100 planes, including 3 Falcon 2000 Jets, to transport\nguests to Anant Ambani and Radhika Merchant’s wedding\n\nAnant Ambani gifts customised luxury watches worth Rs 1.5 crore to Shah Rukh\nKhan, Vicky Kaushal, Ranveer Singh, and other guests\n\nMeet the rich in-laws of Mukesh Ambani and Nita Ambani’s children: The Piramals,\nMehtas, and Merchants\n\nThe ultra-luxurious houses of the Ambani family – Mukesh Ambani’s Rs 15,000\ncrore Antilia to Anil Ambani’s Rs 5000 crore Abode\n\nForbes reported that in 2022, ArcelorMittal generated a net income of USD 9.3\nbillion. In 2022, this amounted to about Rs 73,090 crore. Aditya served as\nPresident and Chief Financial Officer (CFO) of ArcelorMittal before to taking\nthe helm as the company’s CEO. Lakshmi Mittal, according to Forbes, has a net\nworth of over $16.8 billion (as of July 29, 2023) and is India’s second-richest\nmetal and mining billionaire.\n\nBased in London, this 47-year-old CEO is also an active philanthropist with is\nkeen on working towards healthcare, in children’s health. He wedded Megha Mittal\nand have three children. The couple tied the knot in a dreamy wedding that was a\nstar-studded affair held in Victoria Memorial, Kolkata according to India Times.\n\nUsha Mittal’s contribution to the family and to bringing up her kids is\nextremely important when we talk about their professional achievements.\n\nUsha has supported her husband in his business for nearly 15 years and also had\nthe authority to take decisions in the absence of the managing board of\ndirectors. The Lakshmi Mittal Foundation made a generous donation to the\nInstitute of Technology for Women (ITW), which was therefore renamed as Usha\nMittal Institute of Technology. Mrs. Mittal has been influential in encouraging\nwomen’s education in India and propagates the need to educate the youth.",
        "summary": "Usha Mittal is the wife of steel baron, Lakshmi Mittal. She is also a prominentmember of the business, ArcelorMittal. Their son and the present CEO of the company, Aditya Mittal has taken the helm.",
        "source": "The Financial Express",
        "sentiment": 0.08924500457942486,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-03-11",
        "title": "Aditya Mittal clear winner of the Werder Bremen Jubilee Tournament",
        "link": "https://en.chessbase.com/post/aditya-mittal-wins-werder-bremen-tournament-2024",
        "content": "3/11/2024 – The Jubilee Tournament of the Werder sports club in Bremen’s\n“Werder-Halle” came to an end on Sunday with a victory for India’s Aditya\nMittal. For the 17-year-old, who is also a member of the Werder Bremen team in\nthe Bundesliga, a draw against Czech GM Vojtech Plat was enough to win the\ntournament with a full-point advantage over Polish GM Pawel Teclaf. | Photos:\nWerder Bremen Sports Club\n\n\nTHE RATING FAVOURITE EMERGES VICTORIOUS\n\nThe SV Werder Bremen, internationally known for its many successes in football,\nis celebrating its 125th anniversary and the club’s chess department is\ncelebrating its 75th anniversary. To mark the jubilee, the chess players\norganised a strong tournament on March 2-10 with a mixed field of participants.\n\nAfter grabbing a crucial win with the white pieces over Jakob Pakejen in round\n7, top seed Aditya Mittal entered the two final rounds of the event with a\nfull-point lead over Pawel Teclaf, who stood in sole second place.\n\n\n\nAditya Mital playing white against Jakob Pakejen | Photo: Werder Bremen Chess\nClub\n\nIn the 8th round on Saturday, Teclaf missed a chance to catch Aditya atop the\nstandings. With a quick draw while playing white, the Polish GM kept his second\nplace in the table, but at the same time remained a full point behind the rating\nfavourite.\n\nIt was therefore not very surprising that Aditya won the tournament on Sunday.\nHe got the half point he needed to obtain overall victory, but even in the event\nof a surprising defeat, Teclaf would not have been able to catch him, as he also\nhad to be satisfied with a draw against Zahar Efimenko.\n\nAditya’s win in the 4th round was a turning point in the event. Aditya defeated\nAustralian GM Bobby Cheng, who also plays for Werder Bremen in the Bundesliga.\nThe game featured one or two small tactical wobbles, but was brilliantly\nexecuted from a strategic point of view.\n\nFINAL STANDINGS\n\nRg. Snr Name Elo Club Pts 1 1 GM Mittal, Aditya IND 2594 SAbt SV Werder Bremen 7\n2 5 GM Teclaf, Pawel POL 2556 SK Doppelbauer Kiel von 1910 e.V 6 3 3 GM Cheng,\nBobby Sky AUS 2584 SAbt SV Werder Bremen 5,5 4 2 GM Gumularz, Szymon POL 2590 SK\nDoppelbauer Kiel von 1910 e.V 5,5 5 4 GM Efimenko, Zahar UKR 2568 SAbt SV Werder\nBremen 5,5 6 7 GM Plat, Vojtech CZE 2528 SC Remagen-Sinzig e.V. 5,5 7 15 FM\nColbow, Collin GER 2373 SAbt SV Werder Bremen 5 8 22 FM Schneider, Jana GER 2303\nSC 1957 Bad Königshofen e.V. 5 9 6 GM Pruijssers, Roeland NED 2537 SAbt SV\nWerder Bremen 5 10 10 IM Wachinger, Nikolas GER 2442 SAbt SV Werder Bremen 4,5\n11 18 FM Gloeckler, Christian GER 2356 Wiesbadener SV 1885 4,5 12 20 FM Kopylov,\nDaniel GER 2346 SK Doppelbauer Kiel von 1910 e.V 4,5 13 17 WGM Hejazipour, Mitra\nFRA 2356 4,5 14 19 IM Kopylov, Michael UKR 2352 SK Norderstedt von 1975 4,5 15\n11 IM Pajeken, Jakob Leon GER 2424 SK Doppelbauer Kiel von 1910 e.V 4,5 16 8 IM\nKrastev, Alexander GER 2457 SG Solingen e. V 4,5 17 9 GM Knaak, Rainer GER 2450\nSAbt SV Werder Bremen 4,5 18 12 IM Meins, Gerlef GER 2390 SAbt SV Werder Bremen\n4 19 16 IM Breutigam, Martin GER 2359 SAbt SV Werder Bremen 4 20 14 IM Reuker,\nJari GER 2383 SAbt SV Werder Bremen 3,5 21 21 WGM Radeva, Viktoria BUL 2325 SC\n1957 Bad Königshofen e.V. 3,5 22 23 FM Wiegmann, Sascha GER 2297 Post SV Uelzen\n3 23 13 IM Guichard, Pauline FRA 2385 SK Schwäbisch Hall 2 24 24 FM Söderström,\nAdrian SWE 2288 FC Bayern München e.V. 2\n\nALL GAMES\n\nLINKS\n\n * Official website\n * Full technical information on Chess-Results\n\n--------------------------------------------------------------------------------\n\nKlaus Besenthal Klaus Besenthal is computer scientist, has followed and still\nfollows the chess scene avidly since 1972 and since then has also regularly\nplayed in tournaments.\n\n--------------------------------------------------------------------------------",
        "summary": "The Jubilee Tournament of the Werder sports club in Bremen’s ‘Werder-Halle’ came to an end on Sunday with a victory for India's Aditya Mittal. For the 17-year-old, a draw against Czech GM Vojtech Plat was enough to win the tournament with a full-point advantage.",
        "source": "Chess News | ChessBase",
        "sentiment": 0.09097312018275261,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-02-08",
        "title": "ArcelorMittal net income plunges in 2023",
        "link": "https://www.mining-technology.com/news/arcelormittal-net-income/",
        "content": "The company’s earnings before interest, taxes, depreciation and amortisation\n(EBITDA) was $7.6bn for the full year 2023 (FY2023) and net debt was $2.9bn at\nyear-end.\n\nFebruary 8, 2024\n\nArcelorMittal’s operating income for 2023 was $2.3bn. Credit: Mr. Tempter/\nshutterstock.com.\n\nIntegrated steel and mining company ArcelorMittal has reported net income\nattributable to equity holders of the parent for FY2023 of $919m, a drop from\n$9.3bn a year ago.\n\nThe net income included a negative $2.4bn impact from the disposal of assets in\nKazakhstan and a $1.4bn impairment of Acciaierie d’Italia in Italy.\n\nIn 2023, ArcelorMittal divested its Kazakh steel and mining business to\nstate-run direct investment fund Qazaqstan Investment Corporation (QIC).\n\nFor Q4 2023, the company recorded a net loss of $2.96bn compared with a net\nincome of $261m in Q4 2022.\n\nArcelorMittal posted EBITDA of $7.6bn for FY2023, down from $14.16bn in the\nprior year.\n\nSee Also:\n\n * Algorithms and the modern mine\n * Madison expands mining footprint in Namibia with new licence\n\nFor the quarter ending 31 December 2024, EBITDA was $1.26bn compared with\n$1.25bn in the same period in 2022.        \n\n\nHOW WELL DO YOU REALLY KNOW YOUR COMPETITORS?\n\nAccess the most comprehensive Company Profiles on the market, powered by\nGlobalData. Save hours of research. Gain competitive edge.\n\nCompany Profile – free sample\n\n\nTHANK YOU!\n\nYour download email will arrive shortly\n\n\nNOT READY TO BUY YET? DOWNLOAD A FREE SAMPLE\n\nWe are confident about the unique quality of our Company Profiles. However, we\nwant you to make the most beneficial decision for your business, so we offer a\nfree sample that you can download by submitting the below form\n\nBy GlobalData\n\nTick here to opt out of curated industry news, reports, and event updates from\nMining Technology.\n\nVisit our Privacy Policy for more information about our services, how we may\nuse, process and share your personal data, including information of your rights\nin respect of your personal data and how you can unsubscribe from future\nmarketing communications. Our services are intended for corporate subscribers\nand you warrant that the email address submitted is your corporate email\naddress.\n\nThe company’s free cash flow for 2023 stood at $2.9bn while net debt was $2.9bn\nat year-end.\n\nSales for the 12 months of 2023 decreased 14.5% to $68.3bn, primarily due to a\n13.5% drop in average steel selling prices, while shipments remained stable.\n\nOperating income for 2023 was $2.3bn, a decrease from $10.3bn in 2022, driven by\nthe negative price-cost effect, impairment charges and the impact of the\ndisposal of Kazakhstan operations.\n\nArcelorMittal CEO Aditya Mittal said: “Turning to our financial performance, our\nresults for the full year reflect the benefits of the structural improvements we\nhave made to our cost base, asset portfolio and balance sheet in recent years.\n\n“Despite the operating environment becoming increasingly challenging as the year\nprogressed, our profitability per tonne is healthy and well above long-term\naverages.\n\n“Looking ahead, there are early signs of a more constructive industry backdrop.\nThis, alongside the progress we are making with our portfolio of strategic\ngrowth projects – several of which will complete this year – means the company\nwill continue to take important steps forward in its drive to be a stronger,\nmore profitable, and of course safer, company.”",
        "summary": "ArcelorMittal posted EBITDA of $7.6bn for FY2023, down from $14.16bn in the previous year. For Q4 2023, the company recorded a net loss of $2.96bn compared with $261m in Q4 2022.",
        "source": "Mining Technology",
        "sentiment": -0.7421224117279053,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-02-08",
        "title": "ArcelorMittal posts ‘healthy’ 2023 results despite poor fourth quarter",
        "link": "https://www.luxtimes.lu/businessandfinance/arcelormittal-posts-healthy-2023-results-despite-poor-fourth-quarter/8158497.html",
        "content": "ArcelorMittal’s exit from Kazakhstan and the nationalisation of the Acciaierie\nd’Italia plant in Italy significantly affected its fourth quarter earnings in\n2023, the company said in its annual report published on Thursday morning.\n\nThe Luxembourg-based steel giant booked a fourth-quarter net loss of $2.97\nbillion, a swing from $261 million in net profit for the same quarter in 2022.\n\nThe company recorded a net income of $919 million for 2023 compared to $9.3\nbillion in 2022. Adjusted net income was $4.87 billion compared to $10.61\nbillion for the previous year. Nevertheless, the 2023 number represents\none-and-a-half times the average levels achieved during the 2012 to 2022 period,\nArcelorMittal said. \n\nThe Luxembourg-based steel giant said it was taking $2.4 billion of losses on\nits Kazakh operations after it was cast out from the country following a series\nof work accidents that prompted an investigation by local authorities.\n\n160 workers have been killed in ArcelorMittal mines in Kazakhstan in less than a\ndecade, according to the Qaraqar Foundation, which raises money to bring legal\ncases against the company on behalf of Kazakh workers.\n\nThe company is also booking a further $1.4 billion impairment at its\nmajority-controlled Acciaierie d’Italia business after Giorgia Meloni’s\ngovernment started formal proceedings to put Europe’s largest steelworks under\nspecial administration.\n\nArcelorMittal CEO Aditya Mittal said that the 2023 results reflect the benefits\nof the structural improvements the company had made to its cost base, asset\nportfolio and balance sheet in recent years.\n\n> Looking ahead, there are early signs of a more constructive industry backdrop.\n\nAditya Mittal\n\nArcelorMittal CEO\n\n“Despite the operating environment becoming increasingly challenging as the year\nprogressed, our profitability per tonne is healthy and well above long-term\naverages,” Mittal said. “Looking ahead, there are early signs of a more\nconstructive industry backdrop.”\n\nIn its analysis, the company said it expected global demand (excluding China) to\nrecover in 2024 and grow by between 3-4% compared to 2023. Looking further\nahead, demand for steel will grow by some 300 million tonnes – around 35% - over\nthe next decade, the company said.\n\nThis will be driven not only by population growth, but also by factors including\nnew mobility systems, growing demand for supply chain security and the energy\ntransition, for which steel is a crucial enabler, according to ArcelorMittal.\n\nStrategic investments are estimated to add approximately $1.8 billion to\nEBITDA (earnings before interest, taxes, depreciation, and amortization) growth\nby the end of 2026, the company said. \n\nNew projects expected to be commissioned in 2024 include the first phase of new\nelectrical steels capacity in Europe, additional capacity to existing plants in\nBrazil, the first iron ore concentrate in Liberia and projects in India and the\nUnited States.  \n\n\nHEALTH AND SAFETY\n\nFollowing outcry over its safety record in Kazakhstan, in October last year the\ncompany had pledged to commission an independent third party global audit of its\nsafety related practices and actions. “This audit is now underway and I am\ndetermined its findings and recommendations, combined with the considerable\nefforts we are already implementing across the group, will make us a safer and\nultimately accident free company,” said Aditya Mittal.\n\nThe company even managed to take a positive spin on the sale of its assets in\nKazakhstan, by stating that it now no longer owns and operates coal mines - the\nKazakh operations represented approximately 16.5% of the group’s scope 1 and\nscope 2 carbon emissions.",
        "summary": "The Luxembourg-based steel giant said it was taking $2.4 billion of losses onits Kazakh operations after it was cast out from the country following a series of work accidents. The company recorded a net income of $919 million for 2023 compared to $9.3billion in 2022.",
        "source": "Luxembourg Times",
        "sentiment": 0.6930320858955383,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-04-03",
        "title": "Lakshmi Mittal’s net worth: Here’s a look at India’s tenth richest man’s lifestyle, family, journey, and more",
        "link": "https://www.financialexpress.com/life/lifestyle-lakshmi-mittals-net-worth-heres-a-look-at-indias-tenth-richest-mans-lifestyle-family-journey-and-more-3433110/",
        "content": "AS PER FORBES, LAKSHMI MITTAL’S NET WORTH IS ESTIMATED TO BE $17 BILLION.\n\n\n\nLakshmi Mittal, an icon in the steel industry, is a visionary industrialist\nwhose ascent from modest origins to global eminence is truly extraordinary. As\nthe chairman of ArcelorMittal, the world’s leading steel and mining corporation\nby output, his leadership has reshaped the industry. While previously serving as\nthe company’s CEO, in 2021, he delegated the role to his son, Aditya Mittal.\nRenowned as one of the world’s foremost billionaires, Lakshmi Mittal is equally\nrecognized for his philanthropic endeavors, particularly in the areas of\nchildren’s health and education.\n\n\nEARLY LIFE AND EDUCATION:\n\nBorn into a modest family in 1950 in Sadulpur, Rajasthan, Lakshmi Mittal was\nacquainted with the steel industry from an early age, as his father operated a\nsmall steel business. Educated at St. Xavier’s College in Kolkata, Mittal gained\nfirsthand experience by working in the mill. Fueled by ambition and foresight,\nhe ventured to Indonesia in 1976 to establish his own steel company.\n\nWith unwavering determination, Mittal expanded his steel empire globally,\nacquiring struggling steel plants and transforming them into prosperous\nenterprises. His most significant achievement occurred in 2006 when he\norchestrated the merger of his company, Mittal Steel, with Arcelor, forming\nArcelorMittal, the world’s largest steel producer with a revenue of $68 billion.\n\nMukesh Ambani hires 100 planes, including 3 Falcon 2000 Jets, to transport\nguests to Anant Ambani and Radhika Merchant’s wedding\n\nAnant Ambani gifts customised luxury watches worth Rs 1.5 crore to Shah Rukh\nKhan, Vicky Kaushal, Ranveer Singh, and other guests\n\nMeet the rich in-laws of Mukesh Ambani and Nita Ambani’s children: The Piramals,\nMehtas, and Merchants\n\nThe ultra-luxurious houses of the Ambani family – Mukesh Ambani’s Rs 15,000\ncrore Antilia to Anil Ambani’s Rs 5000 crore Abode\n\n\nPHILANTHROPY AND SOCIAL WORK:\n\nIn addition to his business pursuits, Mittal demonstrates a profound dedication\nto philanthropy and social welfare. He has founded several charitable\norganizations and generously contributed to Harvard University, where he serves\nas a member of the Global Advisory Council. Notably, he has made substantial\ndonations to UNICEF to address child malnutrition in India. As a resident of the\nUnited Kingdom, Lakshmi Mittal has also supported the Great Ormond Street\nHospital through his philanthropic contributions.\n\n\nHIS NET WORTH:\n\nAccording to Forbes, Lakshmi Mittal’s net worth is currently estimated at $17\nbillion as of April 2, 2024. He holds the position of the 110th richest\nindividual globally and ranks as the 10th wealthiest person in India. Mittal’s\nsignificant ownership in ArcelorMittal serves as a primary source of his wealth.\nAdditionally, he holds a 3% stake in the EFL Championship Club Queens Park\nRangers F.C. and holds positions on various boards worldwide.\n\n\nHIS HOUSE AND OTHER ASSETS:\n\nLakshmi Mittal’s residence is nothing short of opulent luxury. His property at\n18-19 Kensington Palace Gardens is valued at $128 million, ranking among the\nmost expensive houses globally. This lavish palace boasts 12 bedrooms, an indoor\npool, and Turkish baths, adorned with marbles sourced from the supplier of the\nTaj Mahal. Additionally, Mittal possesses a colonial bungalow valued at $30\nmillion on New Delhi’s Dr. APJ Abdul Kalam Road. His impressive collection of\nassets includes numerous cars, yachts, and planes, featuring the Amevi—a\n267.5-foot-long yacht valued at $150 million—and a Gulfstream 550 private jet.\n\n\nLEGACY AND IMPACT:\n\nLakshmi Mittal’s impact transcends the confines of the steel industry. Through\nhis visionary foresight and relentless dedication, he has carved out a prominent\nposition for himself on the global stage of steel production. Throughout his\ncareer, Mittal has garnered numerous accolades, including the Steelmaker of the\nYear award from New Steel in 1996, Fortune magazine’s European Businessman of\nthe Year in 2004, and Person of the Year by the Financial Times in 2006. In\nrecognition of his achievements, he was honored with a Doctor Honoris Causa from\nthe AGH University of Science and Technology in Krakow, Poland, in 2013.",
        "summary": "Lakshmi Mittal is the chairman of ArcelorMittal, the world’s leading steel and mining corporation. His net worth is currently estimated at $17 billion. He is the 110th richest individual globally and the 10th wealthiest person in India.",
        "source": "The Financial Express",
        "sentiment": 0.11560326255857944,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-01-21",
        "title": "ArcelorMittal wants 'amicable' deal on Italy steelworks",
        "link": "https://www.newindianexpress.com/business/2024/Jan/21/arcelormittal-wants-amicable-deal-on-italy-steelworks",
        "content": "ROME, ITALY: ArcelorMittal has offered to sell its stake or become a minority\nshareholder in an Italian steelworks after Rome moved to put the plant under\nstate supervision, the chief executive said in a letter seen by AFP Saturday.\n\nAditya Mittal wrote to Italian Prime Minister Giorgia Meloni to press for an\n\"amicable solution\" to the crisis over the struggling ex-Ilva plant, one of\nEurope's largest steelworks.\n\nThe letter was dated Thursday, the day Meloni's hard right government announced\nit had taken the first step towards putting the plant under state supervision.\n\nTalks with ArcelorMittal, which owns a 62-percent stake, had broken down over\nhow to keep production going and secure thousands of jobs at the plant in the\nsouthern city of Taranto.\n\nIn the letter, initially reported by the ANSA news agency but then obtained by\nAFP, Mittal said he was keen to avoid \"extreme unilateral actions\".\n\nHe says the government appears to want to end its joint venture with\nArcelorMittal, the world's largest steelmaker, in which state investment body\nInvitalia has a 38-percent stake.\n\nTo make a \"clean break\", ArcelorMittal has \"offered to sell our entire stake to\nInvitalia for a fraction of our cash investment\", the chief executive wrote, in\nEnglish and Italian.\n\n\"Although Invitalia has refused, this offer remains on the table should the\ngovernment wish to consider it.\"\n\nAlternatively, \"we are prepared to remain as a minority strategic partner... as\nthe Italian government decides on a permanent solution\", Mittal wrote.\n\nDebt problems\n\nRome considers the steelworks a strategic asset, but it has long been plagued by\nfinancial problems and environmental concerns.\n\nThe operating company, named Acciaierie d'Italia, is no longer able to pay many\nof its suppliers or utility bills, and the plant is at risk of having its gas\nshut off.\n\nItalian Enterprise Minister Adolfo Urso earlier told reporters that \"we cannot\nlose any time\".\n\n\"We have activated the procedure that could lead to special administration in a\nfew weeks,\" he said.\n\n\"On the other hand, if ArcelorMittal makes proposals that are in line with what\nthe government considers absolutely necessary, for the protection of the plant\nand the relaunch of production, the shareholders can obviously discuss it,\" he\nsaid.\n\nSpecial administration would involve appointing commissioners to manage the\ncompany and draw up a rescue plan, pending the arrival of a new investor.\n\nIn the meantime, the government said it stood ready to guarantee \"current\nliquidity\" at the plant with a bridge loan of 320 million euros ($347 million).\n\nMittal said that if it stayed, his company could contribute up to one-third of\nthe state's contribution towards purchase of assets in the joint venture, to\navoid any concerns about state aid.\n\nArcelorMittal had responded to a call for tenders after the site was last put\ninto extraordinary administration in 2015, taking over the Ilva group and its\n10,700 employees -- including 8,200 in Taranto -- at the end of 2018.",
        "summary": "ArcelorMittal has offered to sell its stake or become a minority shareholder in an Italian steelworks. Chief executive Aditya Mittal wrote to Italian Prime Minister Giorgia Meloni to press for an \"amicable solution\" to the crisis over the struggling ex-Ilva plant. The letter was dated Thursday, the day Meloni's hard right government announced first step towards putting the plant under state supervision.",
        "source": "The New Indian Express",
        "sentiment": -0.2713474631309509,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-01-26",
        "title": "Meet woman, a fashion designer, daughter-in-law of Indian billionaire with Rs 141279 crore net worth, she is married...",
        "link": "https://www.dnaindia.com/business/report-meet-megha-mittal-married-aditya-mittal-daughter-in-law-lakshmi-mittal-net-worth-rs-141279-crore-business-news-3075640",
        "content": "Business\n\nThis woman is married to the son of an Indian billionaire, whose whopping net\nworth is Rs 141279 crore. Know all about her here.\n\n\n\n\nTRENDING NOW\n\nMegha Mittal is an Indian fashion entrepreneur who was the chairperson and\nmanaging director of the German fashion and luxury brand Escada. Megha was born\nin Kolkata to a Hyderabadi family. \n\nShe did her schooling at Hyderabad Public School. Megha went to Penneslyvia to\npursue her higher studies in Finance and Management at the Wharton School of\nBusiness. After graduation, she bagged the job of an analyst in the research\ndepartment of Investment Bank Goldman Sachs. \n\nHowever, in 2003, she enrolled herself in the Inchbald School of Design in\nLondon to do a PG in Architectural Interior Design. After her PG was over, she\nwas hired as the chairperson and DM of the German Luxury brand Escada in 2009. \n\nRead: Shark Tank S3: Meet woman who built Rs 12 crore company with just Rs\n50000; is being called 'Real Shark' due to...\n\nMegha Mittal is married to Aditya Mittal, son of Indian billionaire businessman\nLakshmi Mittal. Lakshmi Mittal has a net worth of Rs 141279 crore, as per\nForbes.  Aditya Mittal is currently the CEO of ArcelorMittal, which was founded\nby his father.\n\nAditya and Megha Mittal tied the knot in 1998. They are parents to two children.\nAditya and Megha both actively donate to child health causes in India and the\nUK. \n\nFind your daily dose of news & explainers in your WhatsApp. Stay updated, Stay\ninformed-  Follow DNA on WhatsApp.",
        "summary": "Megha Mittal is an Indian fashion entrepreneur. She is married to Aditya Mittal, son of Indian billionaire businessman Lakshmi Mittal. Lakshmi has a net worth of Rs 141279 crore, according to Forbes. Megha was the chairperson and DM of the German luxury brand Escada.",
        "source": "DNA India",
        "sentiment": 0.010160418227314949,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-01-11",
        "title": "ArcelorMittal to build world's single largest steel manufacturing site at Hazira by 2029, says Lakshmi Mittal",
        "link": "https://www.businesstoday.in/latest/corporate/story/arcelormittal-to-build-worlds-single-largest-steel-manufacturing-site-at-hazira-by-2029-says-lakshmi-mittal-412601-2024-01-10",
        "content": "Lakshmi Mittal, the executive chairperson of steel manufacturing corporation\nArcelorMittal, on Wednesday announced that the corporation will build the\nworld's single largest steel manufacturing site at Gujarat's Hazira by 2029.\nMittal was addressing the ongoing Vibrant Gujarat Global Summit (VGGS) 2024\nwhile making the announcement.\n\nThe steel baron said that the first phase of the steel manufacturing site will\nbe completed by 2026 whereas the second phase, marked by a Memorandum of\nUnderstanding (MoU), will be completed by 2029. Once operational, the expanded\nmanufacturing facility will produce around 24 million tonnes (MT) of steel,\nmaking it the world's largest steel manufacturing site.\n\n\"Hazira expansion was inaugurated by PM in 2021. Phase one will be completed by\n2026, 2nd phase MoU signed, will be completed by 2029 and will produce 24 mn\ntonnes steel and it will become the world's biggest plant,\" Lakshmi Mittal said\nat the summit.\n\nIn October 2022, ArcelorMittal arm ArcelorMittal Nippon Steel (AMNS) India had\nannounced an investment of around Rs 60,000 crore to scale up the capacity of\nthe steel plant to 15 MT, company chairman Aditya Mittal told PTI at the time.\nThe investment was for installation of new steel making technologies, setting up\nnew-age machineries and increasing product mix.\n\nThe announcement came days after AMNS received environmental clearance for the\nplant's expansion. The Hazira steel plant expansion was inaugurated by Prime\nMinister Narendra Modi in 2021. In 2019, ArcelorMittal and Japan's Nippon Steel\nacquired the Essar Steel Limited plant located in Hazira and renamed it to\nArcelorMittal Nippon Steel (AMNS) India.\n\nHe added that the expansion of steel manufacturing site at Hazira is in\nalignment with India's commitment to industrial growth. Not only steel, the\nArcelorMittal chairperson also said that the corporation is investing in the\nrealms of renewable energy and green hydrogen.\n\nMeanwhile, Lakshmi Mittal also recounted the last time he attended the summit\nand Prime Minister Narendra Modi's brief for business and world leaders at the\ntime. \"I had come here in September last year for Vibrant Gujarat. PM Modi then\nbriefed us on how this mega-global event has institutionalised structure on the\nbasis of ideas, imagination and process continuity. The PM had then said that\nIndia's pride will increase with the theme of 'One Earth, One Family and One\nFuture'.\"\n\nAlso Read: Vibrant Gujarat Summit 2024: Reliance is, was and will always remain\na Gujarati company, says Mukesh Ambani\n\nAlso Read: Adani Group to invest Rs 2 lakh crore, create over 1 lakh jobs in\nGujarat in next 5 years",
        "summary": "Lakshmi Mittal, the executive chairperson of steel manufacturing corporation ArcelorMittal, on Wednesday announced that the corporation will build the world's single largest steel manufacturing site at Gujarat's Hazira by 2029. The steel baron was addressing the ongoing Vibrant Gujarat Global Summit (VGGS) 2024. Once operational, the expanded manufacturing facility will produce around 24 million tonnes (MT) of steel.",
        "source": "Business Today",
        "sentiment": 0.357127352617681,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-05-03",
        "title": "Bloomberg - Are you a robot?",
        "link": "https://www.bloomberg.com/profile/person/1814239",
        "content": "WHY DID THIS HAPPEN?\n\nPlease make sure your browser supports JavaScript and cookies and that you are\nnot blocking them from loading. For more information you can review our Terms of\nService and Cookie Policy.\n\n\nNEED HELP?\n\nFor inquiries related to this message please contact our support team and\nprovide the reference ID below.\n\nBlock reference ID:",
        "summary": "summarize: WHY DID THIS HAPPEN? Please make sure your browser supports JavaScript and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy. For inquiries related to this message please contact our support team and provide a reference ID.",
        "source": "bloomberg.com",
        "sentiment": -0.04044743813574314,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-05-03",
        "title": "Bloomberg - Are you a robot?",
        "link": "https://www.bloomberg.com/news/articles/2024-05-02/arcelormittal-positive-on-steel-outlook-as-profit-beats-estimate",
        "content": "WHY DID THIS HAPPEN?\n\nPlease make sure your browser supports JavaScript and cookies and that you are\nnot blocking them from loading. For more information you can review our Terms of\nService and Cookie Policy.\n\n\nNEED HELP?\n\nFor inquiries related to this message please contact our support team and\nprovide the reference ID below.\n\nBlock reference ID:",
        "summary": "summarize: WHY DID THIS HAPPEN? Please make sure your browser supports JavaScript and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy. For inquiries related to this message please contact our support team and provide a reference ID.",
        "source": "Bloomberg.com",
        "sentiment": -0.04044743813574314,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-01-21",
        "title": "“The Times”: Lakshmi Mittal accused of profiting from the conflict in Ukraine",
        "link": "https://www.agenzianova.com/en/news/the-timeslakshmi-mittal-accused-of-profiting-from-the-conflict-in-ukraine/",
        "content": "Lakshmi mittal, the executive chairman of the steel group ArcelorMittal, would\nhave profited from the conflict in Ukraine. This is what emerges from a joint\ninvestigation conducted by the Sunday edition of the British newspaper \"The\nTimes\" and the non-governmental organization Global Witness. The Indian\nbillionaire, the main shareholder of the world's second largest steel producer,\nowns part of a company - of which his son is president - which has purchased\nRussian oil for 2,75 million euros since the invasion of Ukraine began. These\nimports, according to the investigation, have brought the equivalent of hundreds\nof millions of euros into the Kremlin's coffers, according to estimates based on\nRussian export duties. In 2007 Mittal helped found Hpcl-Mittal Energy Limited\n(Hmel), a joint venture between the public company Hindustan Petroleum\nCorporation Limited and Mittal Energy Investments, a company owned by the\nentrepreneur's family. Both parties own 49 percent of HMEL, with the rest held\nby financial institutions in New Delhi. Lakshmi's son Aditya is both the CEO of\nArcelorMittal and the chairman of Hmel.\n\nBefore the invasion of Ukraine, the company imported small quantities of Russian\ncrude oil, but in May 2022, three months after the invasion of Ukraine, Hmel\nbegan importing large amounts of oil. Last month, according to Kpler, the\ncompany that monitors the traffic of raw materials, Hmel imported around 232\nthousand barrels of Russian crude per day. Kpler data shows that the\nMittal-linked company imported around seven million tonnes of Russian crude in\nthe first 18 months of the war alone. Based on tariffs imposed by Russia on its\noil exports, it is estimated that in the first seven months of 2023 Hmel's\npurchases brought the Kremlin the equivalent of approximately 722,8 million\neuros. These operations do not violate any law or sanctions as India has not\njoined the financial measures adopted against Russia since the beginning of the\nconflict in Ukraine but, on the contrary, has become one of the main importing\ncountries of Russian oil. In fact, India currently accounts for about a quarter\nof all Russian exports of crude and refined oil.\n\nRead also other news on Nova News\nFollow us on the social channels of Nova News on Facebook, Twitter, LinkedIn,\nInstagram, Telegram",
        "summary": "Lakshmi mittal is the executive chairman of the steel group ArcelorMittal. His company has purchased Russian oil for 2,75 million euros since the invasion of Ukraine began. These imports have brought the equivalent of hundreds of millions of euros into the Kremlin's coffers.",
        "source": "Agenzia Nova",
        "sentiment": -0.006050541996955872,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-05-02",
        "title": "Meet man, son of Indian mining billionaire, who leads Rs 7660 crore company, he is...",
        "link": "https://www.dnaindia.com/business/report-meet-man-aditya-mittal-son-of-indian-mining-billionaire-lakshmi-mittal-who-leads-rs-7660-crore-company-3087755",
        "content": "Business\n\nHis father is India's second-richest metal and mining billionaire with a net\nworth of Rs 135190 crore.\n\nPrashant Tamta\n\nUpdated : May 02, 2024, 04:30 PM IST | Edited by : Prashant Tamta\n\n\n\n\nTRENDING NOW\n\n\n * ANANT AMBANI WEDDING: MUKESH AMBANI GIVES GIFT TO RELIANCE EMPLOYEES, IT\n   CONTAINS...\n\n\n * NOT TATA, AMBANI OR ADANI, THIS IS THE OLDEST RUNNING BUSINESS GROUP IN INDIA\n\n\n * KHLOE KARDASHIAN CALLS MANISH MALHOTRA 'LOCAL DESIGNER' IN VIRAL VIDEO,\n   NETIZENS REACT: 'SHE WILL GET...'\n\n\n * MEET ACTOR, WHO WAS TOUTED AS NEXT SUPERSTAR AFTER SHAH RUKH, SALMAN, AAMIR;\n   LATER QUIT INDUSTRY, NOW WORKS AS...\n\n\n * MEET ACTOR WHO WAS BEATEN BY SADHU, BULLIED IN SCHOOL, REMOVED FROM FILMS;\n   NOW GIVES RS 100-CRORE BLOCKBUSTERS\n\n\n * MEET INDIA'S NEWEST BILLIONAIRE WHO RUNS RS 199000 CRORE COMPANY, HIS NET\n   WORTH IS...\n\n\n * INDIA'S HIGHEST-PAID LYRICIST CHARGES RS 25 LAKH PER SONG; IT'S NOT GULZAR,\n   MANOJ MUNTASHIR, VARUN GROVER, IRSHAD KAMIL\n\n\n * MEET HIJAB CLAD WOMAN WHO STOLE THE SHOW AT MUKESH AMBANI AND NITA AMBANI'S\n   SON ANANT AMBANI'S WEDDING\n\n\n * MEET INDIA'S BIGGEST FLOP ACTOR, DID 23 FLOP FILMS, HAS NOT WORKED IN 7\n   YEARS, WILL NOW STAR IN RANVEER, SANJAY DUTT'S..\n\n\n * JAAVED JAAFERI REACTS TO KRK'S CLAIM OF MUKESH AMBANI GIFTING SON MEEZAAN RS\n   30 CRORE APARTMENT FOR...\n\n\n * THIS IS WHY IIT-JEE TOPPER CHIRAG FALOR, WHO SECURED 100 PERCENTILE, DIDN'T\n   TAKE ADMISSION IN IIT\n\n\n * BCCI SECRETARY JAY SHAH INSTRUCTS IMMEDIATE AID OF RS 1 CRORE FOR EX-INDIA\n   CRICKETER\n\n\n * MEET ACTOR, WHO WAS REPLACED FROM SHOW IN 3 DAYS, HAD NO INCOME, STRUGGLED\n   FOR RS 500; LATER BECAME INDIAN'S TOP...\n\n\n * IF MUKESH AMBANI SPENDS RS 3 CRORE EVERYDAY, HIS WEALTH WILL END IN...\n\nMany children of Indian billionaires are working in their family businesses.\nAfter completing their study, they decided to help in the family business to\ntake it to new heights. One such person who is successfully leading his family's\nRs 7660 crore company is Aditya Mittal. He is the son of Indian steel and mining\nmagnate Lakshmi Mittal, executive chairman of ArcelorMittal. Lakshmi is India's\nsecond-richest metal and mining billionaire.\n\nAccording to Forbes, Lakshmi Mittal has a real-time net worth of Rs 135190 crore\n(USD 16.2 billion) as of May 2. He ceded the CEO's position to his son in 2021.\nSince then, Aditya has been leading the firm as chief executive officer (CEO).\nAditya was previously president and Chief Financial Officer (CFO) of\nArcelorMittal.\n\nAditya holds a Bachelor’s degree in Economics from the Wharton School in\nPennsylvania, US. He was born in India and raised in Indonesia. The 48-year-old\nAditya is married to Megha Mittal. The duo have three children. \n\nHe joined the family business in 1997 and was appointed Head of Mergers and\nAcquisitions in 1999. After formation of ArcelorMittal in 2006, Aditya held\nvarious senior leadership roles, including managerial oversight of the Group’s\nflat carbon steel businesses in the US and Europe.\n\nREAD | Meet man, Harvard alumnus, who is set to lead Mukesh Ambani's Rs 240000\ncrore company as... \n\nArcelorMittal is a Luxembourg-based firm and is the world's largest integrated\nsteel and mining company. In India, ArcelorMittal in a joint venture with Nippon\nSteel of Japan owns and operates about 9 million tonne steel plant in Gujarat.\nIn 2019, ArcelorMittal along with Nippon Steel completed the acquisition of the\nEssar Steel Limited plant located at Hazira in Gujarat. They later renamed it to\nArcelorMIttal Nippon Steel (AMNS) India. \n\nThe steel maker reported a net income of USD 919 million (around Rs 7660 crore)\nin 2023, a massive drop from USD 9.3 billion in 2022 after it sold its troubled\nplants in Kazakhstan and Italy at a loss. Global steel giant on Thursday posted\n10 per cent fall in net income at USD 900 million for the first quarter ended\nMarch 31, 2024. It follows January-December fiscal year.\n\nFind your daily dose of news & explainers in your WhatsApp. Stay updated, Stay\ninformed-  Follow DNA on WhatsApp.",
        "summary": "Aditya Mittal is the son of Indian steel and mining billionaire Lakshmi Mittal. He joined the family business in 1997 and was appointed Head of Mergers and Acquisitions in 1999. Aditya was previously president and Chief Financial Officer of ArcelorMittal.",
        "source": "DNA India",
        "sentiment": -0.4542643837630749,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-07-05",
        "title": "Drama-Free Succession: Ten Families Who Made it Work",
        "link": "https://www.tharawat-magazine.com/facts/drama-free-succession-strategies/",
        "content": "Succession planning is critical for multi-generational family businesses. When\nplans succeed its thanks to organisation, open communication, and a shared\nvision for a seamless transition. When they fail, they become the inspiration\nbehind popular shows like HBO’s Succession, which follows the complicated\ndynamics of a family struggling to move through a leadership transition. \n\nThe real-life stories in this collection highlight the significance of the\nstrategies, principles, and values that allow family firms to preserve the\nentrepreneurial spirit behind their founding while embracing new ideas and\nperspectives. \n\nHere are 10 examples that put the success back into succession: \n\nImage via Shutterstock\n\n\n10. FIDELITY INVESTMENTS INC.\n\nFamily: Johnson\n\nAnnual Revenue: $25 Billion\n\nCountry/Region: USA\n\nIn 2014, one of the world’s largest mutual fund groups addressed the dip in\npopularity of actively managed funds while also solidifying its succession plans\nfor the future. Abigail Johnson took over the position of president and CEO from\nher father, Edward Johnson III, of the firm her grandfather founded in 1946.\nAbigail Johnson diversified and modernised Fidelity’s financial products and\nservices, making it the first investment company to offer bitcoin options, and\nestablished Fidelity Digital Assets in 2018. Today, Abigail Johnson serves as\nFidelity’s chair, CEO, and president, overseeing the company’s $11 trillion in\nassets and 40 million investors.\n\nImage via Shutterstock\n\n\n9. CH BOEHRINGER SOHN AG & CO KG\n\nFamily: Boehringer\n\nAnnual Revenue: $24.4 Billion\n\nCountry/Region: Germany\n\nContending with falling revenues, patent losses, and pricing pressures,\nBoehringer Ingelheim, Germany’s second-largest drugmaker, selected a member from\nits founding family to serve as CEO for the first time in 25 years – a move\nintended to help steer the business through a challenging period. Hubertus von\nBaumbach, great-grandson of founder Albert Boehringer, assumed the job in 2016,\nlaunching the largest acquisition in the firm’s history and restructuring the\norganisation’s operations.\n\nFamily-owned since its founding in 1885, Boehringer Ingelheim operates in over\n130 markets in the areas of human pharma, animal health, and biopharmaceutical\ncontract manufacturing. CH Boehringer Sohn AG & Co KG is the parent company of\nBoehringer Ingelheim Group which ranks in the top 20 biopharmaceutical companies\nglobally. Hubertus von Baumbach remains the group’s CEO and chairman today.\n\nImage via Shutterstock\n\n\n8. JARDINE MATHESON HOLDINGS LTD.\n\nFamily: Keswick\n\nAnnual Revenue: $37.7 Billion\n\nCountry/Region: Hong Kong\n\nWhen taking over the executive chairman’s position in 2019, Ben Keswick became\nthe second member of the family’s fifth generation to lead the business as\ntai-pan (top boss.) Holding various key posts in the firm since his mid-20s,\nKeswick’s rise within the organisation was part of the family’s succession\nstrategy. In 2021, less than two years after taking over the top job at Jardine\nMatheson, Ben Keswick initiated one of the biggest corporate restructurings in\nthe company’s nearly 200-year history. The move was seen as a rapid measure to\nmodernise the business and set ambitious performance goals for the conglomerate.\n\nJardine Matheson employs over 400,000 people and operates a wide range of\nbusinesses in several sectors, including motor vehicles, property development,\nconstruction, financial services, and luxury hotels.\n\nImage via Shutterstock\n\n\n7. AMERICA MOVIL SA DE CV\n\nFamily: Slim\n\nAnnual Revenue: $41.6 Billion\n\nCountry/Region: Mexico\n\nMexican telecom magnate Carlos Slim appointed his sons, Carlos Slim Domit and\nPatrick Slim Domit to the board of the family’s expansive business empire in the\nearly 2000’s. Following this, Carlos Slim stated that his succession plan was\ncomplete. However, in 2017, Slim revealed his continued strategy for\nmultigenerational succession when he made his grandsons, Daniel and Rodrigo Hajj\nSlim, directors at subsidiaries of America Movil mining firm, Minera Frisco, and\nreal estate company Soinmob Inmobiliaria Espanola. The move was seen as the\ncreation of a generational bridge to ensure future family leadership in one of\nthe world’s biggest companies. Excluding China and India, America Movil is the\nlargest wireless service provider with over 300 million subscribers.\n\nImage via Shutterstock\n\n\n6. CK HUTCHISON HOLDINGS\n\nFamily: Li\n\nAnnual Revenue: $58 Billion\n\nCountry/Region: Hong Kong\n\nLi Ka-shing founded Cheung Kong Holdings in 1950, growing the business into one\nof Hong Kong’s largest multinational conglomerates. The company’s interests\nrange from telecommunications to infrastructure. In 2015, he combined his\nbusiness activities with a merger that produced CK Hutchison Holdings but the\nbillionaire investor began formulating his succession plan as early as 2000.\nLi’s long-term approach to leadership was considered unusual in Hong Kong, where\nsuccession strategies of many family firms were seen as lacking, or absent all\ntogether.\n\nLi stepped away from the chairmanship of CK Hutchison Holdings in 2018,\npromoting his son, Victor Li Tzar-Kuoi to the firm’s top position. Li Ka-shing\nremains an advisor to his son, as their business empire looks to leverage new\nideas for the future. CK Hutchison is one of the largest companies listed on\nHong Kong’s stock exchange and operates in four core segments: ports, retail,\ninfrastructure, and telecommunications.\n\nImage via Shutterstock\n\n\n5. ARCELOR MITTAL\n\nFamily: Mittal\n\nAnnual Revenue: $79.8 Billion\n\nCountry/Region: Luxembourg\n\nAfter transforming his company into the largest steel manufacturer in Europe,\nNorth America, and South America in 2021, Lakshmi Mittal passed the role of CEO\nover to his son, Aditya Mittal. CNBC Europe named Aditya Mittal ‘European\nBusiness Leader of the Future’ in 2018.\n\nAlthough Lakshmi Mittal remains Arcelor Mittal’s chairman, his son’s succession\nto chief executive officer from his previous position as president and chief\nfinancial officer reflects the family firm’s forward-looking leadership\nstrategy. Arcelor Mittal produces over 69.1 million tonnes of crude steel\nannually and operates in 155 countries globally.\n\nImage via Shutterstock\n\n\n4. A.P. MØLLER – MAERSK GROUP\n\nFamily: Maersk Mc-Kinney Uggla\n\nAnnual Revenue: $81.5 Billion\n\nCountry/Region: Denmark\n\nA.P. Møller – Maersk appointed Robert Maersk Uggla as its board chair in 2022;\nan important move in a restructuring plan that began in 2016. The former CEO and\nfifth-generation family member was considered an ideal fit to lead the shipping\nfirm’s transformation into a fully integrated container logistics company. In\nthe management shuffle, Robert’s mother, Ane Maersk Mc-Kinney Uggla stepped down\nfrom her position as vice-chair, making her son the Maersk family’s sole\nrepresentative on the company’s board.\n\nThe A.P. Møller – Maersk Group handles around 16 per cent of all ocean-faring\nshipping containers, operating in over 130 countries with more than 700 vessels.\n\nImage via Shutterstock\n\n\n3. LOUIS VUITTON MOËT HENNESSY (LVMH)\n\nFamily: Arnault\n\nAnnual Revenue: $85.6 Billion\n\nCountry/Region: France\n\nLVMH chairman, Bernard Arnault, appointed his daughter, Delphine Arnault to the\ntop leadership job at Christian Dior Couture in 2023. The move was part of a\nlongstanding commitment to strategic succession planning has helped the luxury\ngroup grow and expand its key brands. As chair and CEO of one of the group’s\nlargest houses, Delphine Arnault is expected to apply the same managerial\napproach that enabled her to establish new sales records and advance the\ndesirability of Louis Vuitton products in her former post at the iconic luxury\nbrand.\n\nChristian Dior operates 245 boutiques around the world.\n\nImage via Shutterstock\n\n\n2. COMCAST CORPORATION\n\nFamily: Roberts\n\nAnnual Revenue: $121.4 billion\n\nCountry/Region: USA\n\nAfter graduating from business school, Brian Roberts learned the ropes at his\nfather’s cable company, first as a line installer, working his way up to head of\noperations. After succeeding his father, Comcast founder, Ralph J. Roberts as\npresident, Brian Roberts led the company into a new era of expansion during the\n1990s. He continued to grow Comcast as its chairman and CEO after his father\nstepped away from day-to-day activities in 2002. The company is now America’s\nlargest multinational telecommunications and media conglomerate.\n\nToday, Comcast reaches hundreds of millions of customers globally through its\nbrands, which include NBC, Universal, Sky Sports, A+E Networks, and DreamWorks\nAnimation. The company’s Xfinity segment is the largest provider of cable\ninternet access in the United States.\n\nImage via Shutterstock\n\n\n1. WALMART\n\nFamily: Walton\n\nAnnual Revenue: $572.8 billion\n\nCountry/Region: USA\n\nWith the planned appointment of Greg Penner to succeed his retiring\nfather-in-law Rob Walton as the retail giant’s Chairman in 2015, the world’s\nlargest family business maintained its long-term succession strategy. Penner is\nWalmart’s third chairman in its over 60-year history and previously served as\nchair of the company’s technology and commerce committee. Both the Walton family\nand Walmart’s board pointed to Penner’s technological, financial, investment,\nand international business experience as a key factor to ensure future\nopportunities in the evolving retail landscape.\n\nWalmart is the world’s largest company by revenue, operating approximately\n10,500 stores and clubs in 20 countries and eCommerce websites. Walmart employs\n2.1 million associates globally.",
        "summary": "Succession planning is critical for multi-generational family businesses. When plans succeed its thanks to organisation, open communication, and a shared vision for a seamless transition. When they fail, they become the inspiration behind popular shows like HBO’s Succession.",
        "source": "Tharawat Magazine",
        "sentiment": 0.13933118991553783,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-02-22",
        "title": "ArcelorMittal's XCarb® India Accelerator unveils pioneering startups for industrial decarboniSation - Manufacturing Today India",
        "link": "https://www.manufacturingtodayindia.com/arcelormittals-xcarb-india-accelerator-unveils-pioneering-startups-for-industrial-decarbonisation/",
        "content": "ArcelorMittal’s XCarb® India Accelerator programme, a collaboration with the\nIndian Institute of Technology Madras (IIT Madras), has identified three\nfinalists as part of its initiative to support startups focused on industrial\ndecarbonisation technologies in India. The programme was launched in July 2023\nrecognising India’s potential in playing a crucial role in the global climate\ntransition. The collaboration aligns with the country’s goal of becoming a\nglobal hub for electronics manufacturing, with a focus on semiconductors. \n\nThe finalists emerged from eight startups that underwent mentorship at IIT\nMadras, facilitated by the Centre of Innovation & Entrepreneurship at IIT\nMadras. With the support of ArcelorMittal Nippon Steel India (AM/NS India), the\nprogramme seeks to commercialise scalable technologies for decarbonising\nsteelmaking.\n\nThe substantial financial allocation of Rs 2,30,000 crore in December 2021\nunderscores the government’s commitment to fostering the semiconductor and\ndisplay manufacturing ecosystem in the country.\n\nThe programme invited applications across various technology domains, aiming to\nidentify commercially scalable technologies capable of significantly\ndecarbonising steelmaking.Following mentorship, the finalists, AgroMorph\nTechnosolutions Private Limited, Susstains Engineering Solutions LLP, and\nUrjanovaC Private Limited, visited AM/NS India’s Hazira steel making facility to\npresent their technologies to ArcelorMittal and AM/NS India management.\n\nThe three finalists are now in consideration for equity investment or research\ncollaboration through the XCarbTM Innovation Fund Investment Committee, chaired\nby Aditya Mittal, CEO of ArcelorMittal. The programme’s success is attributed to\nthe technical insight and support provided by IIT Madras, contributing to the\ndevelopment of innovative technologies and business models. The collaboration\nserves as a model for open innovation between the corporate sector and\nuniversities in India, addressing technological challenges and fostering\nbreakthrough solutions for climate change.\n\nIrina Gorbounova, Head of the XCarb® Innovation Fund, expressed the project’s\nsuccess in funding and supporting breakthrough ideas on decarbonisation emerging\nfrom India. The mentorship provided by IIT Madras has been instrumental in\nsupporting participants in developing their technologies and business models.\nRaghuttama Rao, CEO of GDC, IIT Madras, highlighted the project’s role in\ndiscovering and nurturing startups, emphasising its potential as a model for\nopen innovation between corporations and universities in India to address\ncomplex technological challenges.\n\n\nPOST NAVIGATION",
        "summary": "ArcelorMittal’s XCarb® India Accelerator programme has identified three finalists as part of its initiative to support startups focused on industrialdecarbonisation technologies in India. The finalists emerged from eight startups that underwent mentorship at IIT Madras, facilitated by the Centre of Innovation & Entrepreneurship.",
        "source": "Manufacturing Today India",
        "sentiment": 0.5548962382599711,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-02-23",
        "title": "XCarb India Accelerator programme: finalists announced",
        "link": "https://www.steeltimesint.com/news/xcarb-india-accelerator-programme-finalists-announced",
        "content": "ArcelorMittal's XCarb India Accelerator programme, launched last summer in\ncollaboration with the Indian Institute of Technology (IIT Madras) and supported\nby ArcelorMittal Nippon Steel in India, has announced three finalists.\n\nThe programme had invited applications from across four distinct technology\ndomains with the aim of identifying the most promising concepts for commercially\nsustainable technologies that hold strong potential to decarbonize steelmaking.\n\nInitially, finalists were selected from eight start-ups that received mentorship\nand guidance on the commercial development of their disruptive technologies\nduring a workshop at IIT Madras in October 2023 and an eight-week mentorship\nprogramme that followed. The mentorship was provided by GDC – a Centre of\nInnovation & Entrepreneurship at IIT Madras.\n\n\n> “WE LAUNCHED THE XCARB® ACCELERATOR PROGRAMME IN INDIA TO FUND AND SUPPORT THE\n> NEXT WAVE OF BREAKTHROUGH IDEAS ON DECARBONISATION EMERGING FROM INDIA.\"\n> \n> Irina Gorbounova, head of the XCarb® Innovation Fund.\n\nIn under a year, the initiative has produced three finalists from a total of\nover 50 applications.\n\nThe three finalists are: AgroMorph Technosolutions Private Ltd, Susstains\nEngineering Solutions LLP and UrjanovaC Private Ltd.\n\nAgroMorph has developed an algae-based CCUS solution, Susstains Engineering\nSolutions invented a novel biochar production technology andUrjanovaC pioneered\nan innovative CCUS technology.\n\nThe finalists were invited for a two-day site visit to AM/NS India’s steelmaking\nfacility in Hazira, following which they presented their respective technologies\nto management from both ArcelorMittal and AM/NS India.\n\n\nThe technology and business models of these finalists are being reviewed by the\nXCarb™ Innovation Fund Investment Committee, chaired by Aditya Mittal, CEO of\nArcelorMittal. The finalists can potentially be awarded an equity investment or\na research collaboration.\n\n\n\n> \"WE ARE THRILLED THAT UNDER THE TECHNOLOGY AND BUSINESS MENTORSHIP OF GDC, IIT\n> MADRAS, THE XCARB® INDIA ACCELERATOR PROGRAMME OF ARCELORMITTAL HAS SUCCEEDED\n> IN DISCOVERING EIGHT START-UPS, OF WHICH THREE HAVE BEEN SELECTED AS\n> FINALISTS.\"\n> \n> Raghuttama Rao, CEO of GDC, IIT Madras.\n\nArcelorMittal Nippon Steel India (AM/NS India) is actively developing its own\ndecarbonisation strategy and initiatives for lower emissions in domestic steel\nmanufacturing, as outlined in its own inaugural Climate Action Report, which can\nbe viewed here.\n\nIrina Gorbounova, head of the XCarb® Innovation Fund, commented: “We launched\nthe XCarb® Accelerator programme in India to fund and support the next wave of\nbreakthrough ideas on decarbonisation emerging from India. This has provided us\nwith the opportunity to interact with high-quality participants and support them\nin developing their technologies and business models. The technical insight and\nsupport provided by IIT Madras has been invaluable and contributed to the\nsuccessful delivery of the workshop and mentorship programme. We hope that\nparticipants have benefited as much from this mentorship programme as we have\nfrom our increased understanding of the vast potential of the country’s start-up\necosystem and we look forward to engaging further with our finalists.”\n\n\nRaghuttama Rao, CEO of GDC, IIT Madras, said: \"We are thrilled that under the\ntechnology and business mentorship of GDC, IIT Madras, the XCarb® India\nAccelerator Programme of ArcelorMittal has succeeded in discovering eight\nstart-ups, of which three have been selected as finalists. This is a telling\ncomment on the high quality of translational research and disruptive start-ups\nto be found across India. The XCarb® India Accelerator Programme speaks volumes\nabout ArcelorMittal's commitment to India and finding breakthrough solutions to\nthe challenging problem of climate change. Going forward, we feel that this\nsuccessful collaboration between ArcelorMittal and IIT Madras will serve as a\nrole model for open innovation between the corporate sector and universities in\nIndia to solve technologically challenging problems.”",
        "summary": "ArcelorMittal's XCarb India Accelerator programme has announced three finalists. The three finalists are: AgroMorph Technosolutions Private Ltd, Susstains Engineering Solutions LLP and UrjanovaC Private Ltd. The finalists can potentially be awarded an equity investment or research collaboration.",
        "source": "Steel Times International",
        "sentiment": 0.5381704494357109,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-03-27",
        "title": "Lakshmi and Aditya Mittal - EasternEye",
        "link": "https://www.easterneye.biz/?lists_2024=lakshmi-and-aditya-mittal",
        "content": "CELEBRATING BRITAIN'S 101 MOST INFLUENTIAL ASIANS 2024\n\n© Asian Media Group - 2024\n\n--------------------------------------------------------------------------------\n\n--------------------------------------------------------------------------------\n\n\n\nLAKSHMI MITTAL was allocated a prestigious spot to stand, right next to the\nBollywood superstar Amitabh Bachchan, when the Indian prime minister Narendra\nModi consecrated the Shri Ram Janmabhoomi Temple in Ayodhya on January 22. There\nwas a pecking order among the 8,000 top industrialists, sports and film stars,\npoliticians and other celebrities invited to the historic ceremony. Afterwards,\nModi passed down the front line with folded hands greeting favoured guests,\namong them Mittal who had come with his wife, Usha. The executive chairman of\nArcelorMittal, one of the few Indians to be invited from abroad, was dressed\nappropriately in a white kurta with a fetching dark red waistcoat. It is fair to\nsay that Mittal normally “doesn’t do God”, as was once memorably said of Tony\nBlair, when the Labour prime minister was prevented from talking about his faith\nby Alastair Campbell, his then director of communications and strategy at 10,\nDowning Street. It is easy to understand why Mittal would not want to inaugurate\na steel plant by smashing a coconut, displaying marigolds and putting up an “Om”\nsymbol. ArcelorMittal, which describes itself as “the world’s largest steel and\nmining company”, undertakes manufacturing in 16 countries with many religions,\nhas customers in 155 countries, has over 150,000 employees, produces 59 million\ntonnes of crude steel and mines 45 million tonnes of iron ore. While Mittal has\nkept his faith private, his father, Mohan Lal Mittal – he turned 97 last October\n– has been almost evangelical in his approach to Hinduism. He also passed on his\nbusiness acumen to his son. Lakshmi Niwas Mittal was born in Sadulpur in the\ndesert kingdom of Rajasthan on June 15, 1950. Like so many others from the\nMarwari community, which is known for its business skills, Mohan Lal moved to\nCalcutta.\n\nAlready register? Login",
        "summary": "Lakshmi Niwas Mittal was allocated a prestigious spot to stand next to Amitabh Bachchan. The executive chairman of ArcelorMittal is one of the few Indians to be invited from abroad. His father, Mohan Lal Mittal, has been almost evangelical in his approach to Hinduism.",
        "source": "EasternEye",
        "sentiment": -0.012380797415971756,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-07-09",
        "title": "Sina Movahed triumphs at Baku Open 2024, Abhimanyu Puranik second and Aditya Mittal third - ChessBase India",
        "link": "https://www.chessbase.in/news/Sina-Movahed-triumphs-at-Baku-Open-2024-Abhimanyu-Puranik-second-and-Aditya-Mittal-third",
        "content": "by Shahid Ahmed - 09/07/2024\n\nFour players - IM Sina Movahed (IRI), GM Abhimanyu Puranik, GM Aditya Mittal and\nGM S L Narayanan scored 7/9 each at Baku Open 2024 Group A. Sina won the\ntournament due to better tie-break score. Abhimanyu, Aditya and Narayanan\nsecured second, third and fourth place respectively. Abhimanyu's sole loss of\nthe event was against the eventual champion, Sina. Aditya remained undefeated.\nTop seed of the tournament, Narayanan started with a loss. Then he won six games\nin-a-row including a win over the champion, Sina in Round 7. IM Ilamparthi A R\nand GM Shyam Sundar M scored 6.5/9 each. They were placed eighth and ninth\nrespectively. The total prize fund of the tournament was US$ 50000. The top\nthree prizes were $12000 + Cup, $8000 and $6000 each. Photo: Azerbaijan Chess\nFederation\n\n\nINDIANS CLAIM FIVE OUT OF TOP TEN\n\nTop seed GM S L Narayanan did not have the best start. However, he made great\nrecovery. The next best thing to winning the tournament is beating the eventual\nchampion. He was the only player to beat IM Sina Movahed (IRI) in the\ntournament.\n\n\n\nTop 3 (L to R): 2nd GM Abhimaynu Puranik 7/9, 1st IM Sina Movahed (IRI) 7/9 and\n3rd GM Aditya Mittal 7/9 | Photo: Azerbaijan Chess Federation\n\n\n\nGM Abhimanyu Puranik suffered his sole loss against the eventual champion, IM\nSina Movahed (IRI). He gained 7.4 Elo rating points | Photo: Azerbaijan Chess\nFederation\n\n\n\nGM Aditya Mittal scored an unbeaten 7/9, finished third on tie-breaks and\ncrossed 2600 again\n\n\n\nTop seed GM S L Narayanan made a good recovery after a first round loss, won the\nnext six games in-a-row, scored 7/9 to finish fourth | Photo: Azerbaijan Chess\nFederation\n\nReplay Round 9 Live Commentary | Video: Azerbaijan Chess Federation\n\nClosing Ceremony | Video: Azerbaijan Chess Federation\n\nA total of 122 players including 16 GMs, 26 IMs and 6 WIMs took part from eight\ncountries across the world in Group A. The nine-day nine-round Swiss League\ntournament was organized by the Ministry of Youth & Sport of the Republic of\nAzerbaijan and Azerbaijan Chess Federation from 29th June to 7th July 2024 at\nBaku Sport Hall in Baku, Azerbaijan. The time control of the tournament was 90\nminutes + 30 seconds increment from move no.1.\n\n\nREPLAY ALL AVAILABLE GROUP A GAMES\n\n\nFINAL STANDINGS\n\nRk.SNo NameTypsexFEDRtgPts. TB1  TB2  TB3  TB4 116IMMovahed,\nSinaU14IRI248270247765124GMPuranik, AbhimanyuIND263270247265037GMAditya,\nMittalU18IND259570243055041GMNarayanan, S LIND2668702384650,559GMAsadli,\nVugarAZE25606,502380546613IMSamadov, ReadU18AZE25036,502379545,5721IMShuvalova,\nPolinawFID24676,502349544,5824IMIlamparthi, A\nRU16IND24466,502348546,5915GMShyam, Sundar\nM.IND24936,502310544,51019IMAssaubayeva,\nBibisaraU20wKAZ24726,502310449112GMMamedov, RaufAZE2651602439451125GMSuleymanli,\nAydinU20AZE2626602429449,51317GMAhmadzada, AhmadU20AZE2481602427549146GMAbasov,\nNijatAZE2621602393446,51526IMManafov, VugarU20AZE24306023914481628IMStribuk,\nArtiomU18FID2422602375547173GMPranav, VU18IND26326023544481840FMTalibov,\nShiroghlanU18AZE2361602345546,51956FMNovozhilov,\nSemenU14FID22886023116402029IMAradhya, GargIND2418602207441\n\nDetails\n\n\nLINKS\n\nOfficial site\n\nTournament regulations\n\n--------------------------------------------------------------------------------",
        "summary": "Four players - IM Sina Movahed (IRI), GM Abhimanyu Puranik, GM Aditya Mittal andGM S L Narayanan scored 7/9 each at Baku Open 2024 Group A. Sina won the tournament due to better tie-break score. IM Ilamparthi A R and GM Shyam Sundar M were placed eighth and ninth respectively. The total prize fund of the tournament was US$ 50000.",
        "source": "ChessBase India",
        "sentiment": -0.007713038474321365,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-10-14",
        "title": "Qatar Masters 2023 R3: Aditya Mittal defies World no.7 Anish Giri - ChessBase India",
        "link": "https://www.chessbase.in/news/Qatar-Masters-2023-Round-3-report",
        "content": "by Shahid Ahmed - 14/10/2023\n\nMagnus Carlsen (NOR) bounced back with a victory over IM FT Muthaiah Al in the\nthird round of Qatar Masters 2023. Muthaiah did not go down easily. He put up a\nvery good fight. Only in the complex queen and minor piece endgame, he made an\ninaccuracy which was enough for the World no.1 to seize. GM Aditya Mittal held\nGM Anish Giri (NED) to a draw. The teenager played really well against the World\nno.7. GM Arjun Erigaisi and GM S L Narayanan are the only two Indians at 3/3.\nThey are going to face each other in the fourth round. IM Vaishali R continues\nher good run. She drew against GM Temur Kuybokarov (AUS). Round 4 starts today\nat 3 p.m. local time, 5:30 p.m. IST. Photos: Aditya Sur Roy\n\n\nARJUN AND S L NARAYANAN IN A FIVE-WAY LEAD\n\n\n\nGM Aditya Mittal held the World no.7 and Netherlands no.1 - GM Anish Giri to a\ndraw\n\nBefore Round 3, an important announcement was shared on the official website:\n\n\n\nFair play measure and playing procedures | Source: Official site\n\n\nCARLSEN - MUTHAIAH: 1-0\n\nIt is well known by now that after a loss, GM Magnus Carlsen (NOR, 2839) is a\nfierce opponent to face in the following round. IM Muthaiah Al (2470) managed to\nhold his own. The game reached a queen and minor piece endgame where the IM was\ndown by two pawns.\n\n\n\nPosition after 43.Qxd4\n\nIt was extremely to figure out that 43...Qe7 saves the game as 44.Ne5 Qxg5\ntactically defends the bishop. Instead, the game continued with the humane\n43...Qe6? 44.Ne5 Qxh3+ 45.Ke1 Qh1+ 46.Kd2 Bf3 47.Nd7 White is making some\ncheckmate threats in the back rank. 47...Qd1+ 48.Ke3 Qxb3+ 49.Kf4 Bc6 50.Nf6+\nKg7 51.Nh5+ Kf8 52.Qd6+ Kg8 53.Qd8+ and checkmate is unstoppable.\n\nWhat did Magnus Carlsen tell IM FT Muthaiah Al? Commentary by IM Sagar Shah |\nVideo: ChessBase India\n\nThe experience of playing Magnus Carlsen - IM Muthaiah Al at the Qatar Masters\n2023 | Video: ChessBase India\n\nWe tried to decode the post-game analysis of Magnus Carlsen and Muthaiah Al |\nVideo: ChessBase India\n\n\n\nIM Muthaiah Al played really well against the World no.1 Magnus Carlsen\n\nHikaru takes on Olympiad Gold Medalist Shamsiddin | Video: ChessBase India\n\nHikaru Nakamura speaks about fans, recaps and tightened security measures at\nQatar Masters 2023 | Video: ChessBase India\n\nHikaru Interview From Qatar Masters Day 2 re Drama & Win | Video: GMHikaru\n\nAditya Mittal on his phenomenal preparation against Anish Giri | Video:\nChessBase India\n\nGetting 37 minutes more on the clock over Anish Giri in the opening -\nCommentary by IM Sagar Shah | Video: ChessBase India\n\n\n\nGM Anish Giri (NED) was denied a hat-trick by GM Aditya Mittal\n\n\nRASULOV - ARJUN\n\n\n\nPosition after 37...d5!\n\nGM Arjun Erigaisi (2712) played an excellent move 37...d5! in response to GM\nVugar Rasulov's (AZE, 2560) incorrect decision to sideline his knight 37.Nxa4.\n38.Rd3 dxc4 39.Rxd8+ Nxd8 40.Nxb2 c3 and it's over for White.\n\nArjun Erigaisi makes a scintillating 3/3 start at the Qatar Masters Open 2023 |\nVideo: ChessBase India\n\nArjun Erigaisi is a tactical beast - Vugar Rasulov vs Arjun Erigaisi | Video:\nChessBase India\n\n\n\nGM Arjun Erigaisi scored a comfortable win over GM Vugar Rasulov (AZE)\n\n\nS L NARAYANAN - ALISHER\n\n\n\nPosition after 29.Kg2\n\nIn a complex position, GM Alisher Suleymenov (KAZ, 2512) made an incorrect\ndecision to go after f3-pawn by giving up his e5. 29...Nd4? 30.Rxe5 Nxf3 31.Rf1\ng4 32.Re4 Rdd8 33.Qe3 White is in no hurry to take the g4-pawn. First,\nhe increases his firm grip on the position before going for the pawn. White went\non to win the game in a little over dozen moves.\n\n\n\nGM S L Narayanan defeated the Magnus slayer GM Alisher Suleymenov (KAZ) to\nbecome one of the five leaders\n\n\n\nIM Vaishali R - GM Temur Kuybokarov (AUS): 0.5-0.5\n\n\nSANDIPAN - GUKESH: 0-1\n\nIn a battle of trainer vs student, GM Sandipan Chanda (2496) was the one who\nfirst gained an upper hand against his WACA mentee, GM D Gukesh (2758).\n\n\n\nPosition after 17...Rfd8\n\n18.Ba6 Qa3 19.Qd3 or 18...Qf8 19.Rc7 would have put White in a commanding\nposition. The game continued 18.Bd3 Qf8 19.Qa1 Ne4 20.Rc7 Rac8 21.Rxc8 Rxc8\n22.Ba6 Rd8 23.f3 Nc5 soon Black equalized and turned things around. Black could\nhave probably finished things earlier if he had captured the e3-pawn on move\nno.37.\n\nTeacher vs Student: Sandipan Chanda vs D Gukesh - Commentary by IM Sagar Shah |\nVideo: ChessBase India\n\n\n\nIndia no.1 GM D Gukesh prevailed the test against GM Sandipan Chanda\n\n\nLAXMAN - ABHIMANYU\n\n\n\nPosition after 40...Qd4\n\n40...Bd4?? is a blunder. Try to find out why.\n\n\n\nGM Laxman R R defeated the in-form GM Abhimanyu Puranik\n\n\n\nIM Rakesh Kumar Jena - GM Adhiban B: 0.5-0.5\n\n\n\nGM Iniyan P - FM Vedant Panesar: 0.5-0.5\n\n\n\nIM Nitin S - GM Raja Rithvik R: 1-0\n\n\n\nFM Gaurang Bagwe - IM Read Samadov (AZE): 0.5-0.5\n\n\n\nGM Stany G A - WGM Rakshitta Ravi: 0.5-0.5\n\n\n\nFM Kashish Manoj Jain - IM P Shyam Nikhil: 1-0\n\n\n\nGM Venkatesh M R - IM Raahul V S: 0-1\n\n\nVIDEOS\n\nGM Laxman on his win over Abhimanyu Puranik | Video: ChessBase India\n\nI didn't expect to draw against both India and South Korea no.1 - IM Nubairshah\n| Video: ChessBase India\n\n\"There's no pressure to win every game!\" - IM Eric Rosen | Video: ChessBase\nIndia\n\n\nSCHEDULE\n\nThere are one round every day from 11th to 20th October 2023 starting from 3\np.m. local time, 5:30 p.m. IST. Monday 16th October 2023 is a rest day. Only\nlast round on 20th October starts at 12 p.m. local time, 2:30 p.m. IST.\n\n\nTIME CONTROL\n\nTime control for each tournament game is 90 minutes for the first 40 moves, plus\n30 minutes for the rest of the game, with an increment of 30 seconds per move\nstarting from move 1.\n\n\nPRIZES\n\nThe total prize fund of the tournament is US$ 108250. The top three prizes are\n$25000, $15000 and $10000 each.\n\n\nREPLAY LIVE STREAM\n\nReplay Round 3 Live Commentary by IM Sagar Shah and Amruta Mokal | Video:\nChessBase India\n\nReplay Round 3 Live Commentary by GM Evgenij Miroshnichenko, IM Jovanka Houska,\nand IM Irene Sukandar | Video: Qatar Chess Association\n\n\nREPLAY ROUND 3 GAMES\n\n\nROUND 3 RESULTS\n\nBo.No. NameTypRtgPts.ResultPts.NameTypRtg No.11GMCarlsen, Magnus *)283911 -\n01½IMMuthaiah, Al247066228GMVokhidov, Shamsiddin25782½ - ½2GMNakamura, Hikaru\n*)2780233GMGiri, Anish27602½ - ½2GMAditya, MittalU18257230434GMRasulov,\nVugar256020 - 12GMErigaisi, ArjunU2027126535GMKaidanov, Gregory255420 -\n12GMSindarov, JavokhirU18265812613GMNarayanan.S.L,265121 - 02GMSuleymenov,\nAlisher251247741GMYilmazyerli, Mert25332½ - ½2GMSalem, A.R.\nSaleh263216819GMYakubboev, Nodirbek26162½ - ½2IMMadaminov,\nMukhiddinU18248461943GMKevlishvili, Robby252121 - 02GMVakhidov,\nJakhongir2607221025GMJumabayev, Rinat258521 - 02IMBaskin,\nRobert2451721175IMVaishali, Rameshbabu24482½ - ½2GMKuybokarov,\nTemur258426125GMAbdusattorov, NodirbekU2027161½1 - 02FMBakhrillaev,\nBakhromU1623021491353GMChanda, Sandipan24961½0 - 11½GMGukesh,\nDU18275841455IMAhmadzada, AhmadU2024941½½ - ½1½GMVan Foreest,\nJorden27078159GMNihal, SarinU2026941½½ - ½1½GMVignesh, N R2527421663Xiao,\nTong(Qd)U1624761½½ - ½1½GMAravindh, Chithambaram Vr.2649141715GMAryan,\nChopra26341½½ - ½1½GMPranesh, MU182515461817GMMendonca, Leon LukeU1826221½½ -\n½1½IMSamant, Aditya SU1825114819142GMLaxman, R.R.23221½1 - 01½GMPuranik,\nAbhimanyu2618182069IMChen, Qi B24651½0 - 11½GMKarthikeyan, Murali261120\n\nDetails\n\n\nSTANDINGS AFTER ROUND 3\n\nRk.SNo NameTypsexFEDRtgIPts. TB1  TB2 16GMErigaisi,\nArjunU20IND2712363292212GMSindarov,\nJavokhirU18UZB26583123278313GMNarayanan.S.L,IND26513133266425GMJumabayev,\nRinatKAZ25853253229543GMKevlishvili, RobbyNED2521343319762GMNakamura,\nHikaruUSA27802,52278073GMGiri, AnishNED27602,53277584GMGukesh,\nDU18IND27582,54267895GMAbdusattorov, NodirbekU20UZB27162,5526811016GMSalem, A.R.\nSalehUAE26322,51627431119GMYakubboev, NodirbekUZB26162,51927211220GMKarthikeyan,\nMuraliIND26112,52026971326GMKuybokarov, TemurAUS25842,52626911428GMVokhidov,\nShamsiddinUZB25782,52827881530GMAditya, MittalU18IND25722,5302771\n\nDetails\n\n\nROUND 4 PAIRINGS\n\nBo.No. NameTypRtgPts.ResultPts.NameTypRtg No.146GMPranesh, MU18251522GMCarlsen,\nMagnus *)2839122GMNakamura, Hikaru *)27802½3GMKevlishvili,\nRobby25214336GMErigaisi, ArjunU20271233GMNarayanan.S.L,265113412GMSindarov,\nJavokhirU18265833GMJumabayev, Rinat25852553GMGiri, Anish27602½2½GMVokhidov,\nShamsiddin25782864GMGukesh, DU1827582½2½GMYilmazyerli, Mert253341730GMAditya,\nMittalU1825722½2½GMAbdusattorov, NodirbekU2027165816GMSalem, A.R.\nSaleh26322½2½IMMadaminov, MukhiddinU18248461940GMFawzy,\nAdham25352½2½GMYakubboev, Nodirbek2616191020GMKarthikeyan,\nMurali26112½2½IMVaishali, Rameshbabu2448751126GMKuybokarov,\nTemur25842½2½GMLaxman, R.R.23221421247GMSuleymenov, Alisher251222GMMaghsoodloo,\nParham27077138GMVan Foreest, Jorden270722GMMousavi, Seyed\nKhalil2492571448IMSamant, Aditya SU18251122GMNihal, SarinU20269491514GMAravindh,\nChithambaram Vr.264922IMAhmadzada, AhmadU202494551650IMPrraneeth,\nVuppalaU16251022GMAryan, Chopra2634151752GMBharath, Subramaniyam\nHU16250022GMMendonca, Leon LukeU182622171822GMVakhidov,\nJakhongir260722GMAbdisalimov, Abdimalik2487591962IMStearman,\nJosiahU20247622GMParavyan, David2599232024GMSethuraman, S.P.259822Xiao,\nTong(Qd)U16247663\n\nDetails\n\n\nLINKS\n\nOfficial site\n\nTournament Regulations: Open A and Open B\n\nQatar Chess Association: facebook, instagram and twitter\n\n--------------------------------------------------------------------------------\n",
        "summary": "Magnus Carlsen (NOR) bounced back with a victory over IM FT Muthaiah Al. GM Aditya Mittal held GM Anish Giri (NED) to a draw. GM Arjun Erigaisi and GM S L Narayanan are the only two Indians at 3/3. IM Vaishali R continues her good run. She drew against GM Temur Kuybokarov (AUS)",
        "source": "ChessBase India",
        "sentiment": -0.009074099361896515,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-02-06",
        "title": "An Opportunity and an Imperative: Decarbonizing India's Development: AM/NS India Chairman Aditya Mittal I India CSR",
        "link": "https://indiacsr.in/opportunity-imperative-decarbonizing-aditya-mittal/",
        "content": "NEW DELHI (India CSR): In an era marked by rapid industrial growth and\nescalating climate concerns, India stands at a crucial juncture. ArcelorMittal\nNippon Steel India (AM/NS India), a joint venture between ArcelorMittal and\nNippon Steel, two of the world’s leading steel manufacturing organisations has\nreleased its inaugural Climate Action Report, marking a pivotal step in its\njourney towards sustainable development.\n\nThe report, introduced by Chairman Aditya Mittal, underscores the company’s\ncommitment to decarbonizing its operations amidst a rapidly evolving global\nlandscape that demands net-zero emissions.\n\nThe report has outlined a strategic plan to decarbonise its operations. This\nambitious initiative is set against the backdrop of India’s journey towards\nbecoming a $5 trillion economy, with steel playing a pivotal role in the\nnation’s developmental narrative.\n\nA leading integrated flat carbon steel producer in India, the company has a\ncrude steel capacity of 9 million tonnes per annum with state-of-the-art\ndownstream facilities. It produces a fully diversified range of flat steel\nproducts, including value-added steel, and has a pellet capacity of 20 million\ntonnes. \n\nFor more than 100 years, since the first\nIndian steel plant was set up, steel has\nhelped build some of India’s most remarkable\nand enduring projects. Now once again, an\nopportunity presents for our company, and\nour industry – the opportunity for our most\ndefining act yet: producing net-zero steel\nto support a net-zero economy.\n\n\nSETTING THE STAGE FOR SUSTAINABLE GROWTH\n\nIn his Chairman’s Letter, Aditya Mittal highlights the significant strides made\nby AM/NS India since its inception at Hazira. With plans to boost annual\nproduction to 15 million tonnes, the focus is not just on expansion but on\nsustainable growth. “As our company and country grow, we also push ourselves to\nconfront a parallel challenge: decoupling development from emissions,” says\nAditya Mittal.\n\n\nSTEEL: THE BACKBONE OF INDIA’S DEVELOPMENT\n\nThe steel industry, integral to India’s infrastructure boom, faces the challenge\nof doubling its capacity by 2030 while mitigating its environmental impact.\n“Steelmaking will be integral – the backbone of the houses and highways, bridges\nand buildings that will define a more competitive manufacturing economy,” Mittal\nemphasizes.\n\n\nINNOVATING TOWARDS A GREENER FUTURE\n\nAM/NS India’s Climate Action Report lays out a roadmap to reduce emission\nintensity by 20% by 2030. This includes scaling up renewable energy usage,\nmaximizing scrap steel use, and investing in green hydrogen and carbon capture,\nutilization, and storage (CCUS) technologies. “We are working hard to make green\nhydrogen viable for steel and studying Indian geology to improve the feasibility\nof CCUS,” Aditya Mittal states, underscoring the company’s commitment to\ninnovation.\n\n\nTHE ECONOMIC IMPERATIVE OF SUSTAINABLE PRACTICES\n\nThe journey to net-zero steel is fraught with economic challenges, particularly\nin India where low-carbon alternatives are costlier. Despite these challenges,\nAM/NS India remains steadfast in its commitment. Mittal remarks, “The pathway to\nnet zero has to be economically viable and the industry must remain\ncompetitive.”\n\n\nA COLLABORATIVE EFFORT FOR A NET-ZERO FUTURE\n\nThe transition to net-zero steelmaking demands multi-stakeholder collaboration,\nincluding supportive policies, incentives, and investment. “Transformational\nsteps by the industry, with support and leadership from the government, can\nclose the gap to net-zero steel,” affirms Aditya Mittal.\n\n\nAM/NS INDIA’S ROLE IN INDIA’S GROWTH AND DECARBONISATION CHALLENGE\n\nGROWTH TRAJECTORY AND ENVIRONMENTAL RESPONSIBILITY\n\nSince commencing operations at Hazira over four years ago, AM/NS India has\nplayed a significant role in supporting India’s growth trajectory, focusing on\nself-reliance and resilience. As the company aims to increase production to 15\nmillion tonnes annually, it simultaneously faces the dual challenge of fostering\neconomic development and reducing emissions.\n\nTHE LINK BETWEEN STEEL PRODUCTION AND ENVIRONMENTAL IMPACT\n\nSteel production is integral to India’s development, forming the backbone of\ninfrastructure projects. However, this necessitates a substantial increase in\nsteel capacity, potentially tripling by mid-century. Such growth, if unchecked,\ncould lead to a 200% rise in sector emissions by 2050, contradicting\nenvironmental goals.\n\n\nTHE PATH TO NET-ZERO: STRATEGY AND ACTIONS\n\nIMMEDIATE GOALS AND LONG-TERM VISION\n\nAM/NS India sets an ambitious target to reduce emission intensity by 20% by\n2030, from 2021 levels. This goal will be pursued through operational\nefficiency, increased use of renewable energy, and maximizing scrap steel usage.\n\nPIONEERING TECHNOLOGIES AND STRATEGIC PARTNERSHIPS\n\nThe report highlights the company’s focus on green hydrogen and carbon capture,\nutilization, and storage (CCUS) technologies. Efforts include strategic\npartnerships, geological studies for CCUS feasibility, and leveraging\nArcelorMittal’s global innovations like ‘smart carbon’.\n\nADVERTISEMENT\n\n\nOVERCOMING ECONOMIC CHALLENGES AND COLLABORATIVE EFFORTS\n\nECONOMIC VIABILITY AND INDUSTRY COMPETITIVENESS\n\nRecognizing the higher costs of lower carbon production methods in India, AM/NS\nIndia emphasizes the need for economically viable pathways. The company plans to\nmaintain its gas-based Electric Arc Furnace capacity, despite cost disparities,\nand prepare for future technologies like hydrogen-based steelmaking.\n\nGOVERNMENT AND INDUSTRY COLLABORATION\n\nThe report calls for industry and government collaboration to bridge the gap to\nnet-zero steel production. It underscores the importance of policies and\nfinancial support in fostering technological breakthroughs and ensuring industry\ncompetitiveness.\n\n\nA COLLECTIVE VISION FOR A NET-ZERO FUTURE\n\nBy sharing this report, the company aims to inspire customers, government, and\npeers to accelerate the transition to a net-zero economy. Embracing the\nchallenges and opportunities, AM/NS India is committed to leading the charge in\nproducing net-zero steel, contributing to a sustainable future for India.\n\nAlso Read:\n\nADVERTISEMENT\n\nAlso Read:\n\n(CopyRight@India CSR)",
        "summary": "A joint venture between ArcelorMittal and Nippon Steel has released its inaugural Climate Action Report. The report has outlined a strategic plan to decarbonise its operations. This is set against the backdrop of India’s journey towards becoming a $5 trillion economy. Steel playing a pivotal role in the developmental narrative.",
        "source": "India CSR",
        "sentiment": 0.7572545725852251,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-02-08",
        "title": "AM/NS India achieves record production - Manufacturing Today India",
        "link": "https://www.manufacturingtodayindia.com/am-ns-india-achieves-record-production/",
        "content": "ArcelorMittal, the leading integrated steel and mining company, announced its\nfinancial results for the fourth quarter (Q4) and full year (FY) 2023.\n\nKey highlights:\n\n * FY23 EBITDA: $7.6 billion, with an EBITDA/tonne of $136.\n * FY23 Net Income: $0.9 billion.\n * Adjusted Net Income: $4.9 billion.\n * FY23 Free Cash Flow: $2.9 billion.\n * Net Debt: $2.9 billion.\n * Liquidity: $13.2 billion.\n * Share Repurchases: 45.4 million shares repurchased in 2023.\n * Decarbonization Leadership: 2030 targets set for a 25% CO2e reduction\n   globally.\n\nAM/NS India performance:\n\n * Operational Performance: Record crude steel production in December 2023,\n   reaching an 8.1Mt run-rate.\n * EBITDA: $499 million in Q4 2023, down 6.4% from Q3 2023.\n * Steel Shipments: 7,251 kt in 2023, compared to 6,470 kt in 2022.\n * Climate Action: Targeting a 20% reduction in emissions intensity by 2030\n   (from 2021 levels).\n\nArcelorMittal’s CEO, Aditya Mittal, commented: “Our strong performance in 2023\nreflects the resilience of our business model and the dedication of our\nemployees. We remain focused on delivering value to our stakeholders and driving\nsustainable growth.”\n\n\nPOST NAVIGATION\n\nPosted inSectors\n\nFebruary 5, 2024February 5, 2024\n\n\n",
        "summary": "ArcelorMittal announced its financial results for the fourth quarter (Q4) and full year (FY) 2023. The company reported record crude steel production in December 2023, reaching an 8.1Mt run-rate. The CEO, Aditya Mittal, commented: “Our strong performance in 2023reflects the resilience of our business model and the dedication of our employees”",
        "source": "Manufacturing Today India",
        "sentiment": -0.6968738585710526,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-03-14",
        "title": "ArcelorMittal to acquire 28.4% stake in Vallourec",
        "link": "https://www.steeltimesint.com/news/arcelormittal-to-acquire-28-4-stake-in-vallourec",
        "content": "ArcelorMittal has signed a share purchase agreement to acquire a 28.4% equity\ninterest in manufacturing company Vallourec, for a total consideration of\napproximately €955 million.\n\nVallourec, which specializes in the production of seamless and welded steel tube\nproducts for industrial applications, said it expects to generate strong EBITDA\nfor the full year due to robust tubes pricing in backlog and operational\nimprovement.\n\n85% of Vallourec’s 2.2Mt of annual rolling capacity is focused around\nlow-carbon, integrated productions hubs in US and Brazil, both of which are\nimportant strategic markets for ArcelorMittal.\n\n\n> ''AS A PRODUCER OF PREMIUM TUBULAR SOLUTIONS, [VALLOUREC] HAS A CRITICAL ROLE\n> TO PLAY IN THE ENERGY TRANSITION, PRODUCING VITAL PRODUCTS FOR HYDROGEN, CCS\n> AND GEOTHERMAL APPLICATIONS, FOR WHICH DEMAND IS EXPECTED TO GROW.''\n> \n> Aditya Mittal, CEO, ArcelorMittal\n\nAditya Mittal, CEO, ArcelorMittal, said: “Vallourec is a quality, high\nadded-value tubular business, with established positions of strength in the\nattractive Brazilian and US markets. As a producer of premium tubular solutions,\nit has a critical role to play in the energy transition, producing vital\nproducts for hydrogen, CCS and geothermal applications, for which demand is\nexpected to grow. It also has a comparatively low carbon footprint with\nambitious improvement targets. We look forward to being part of the company’s\nfuture.”",
        "summary": "Vallourec specializes in the production of seamless and welded steel tube products for industrial applications. The company expects to generate strong EBITDA for the full year. 85% of Vallourec’s 2.2Mt of annual rolling capacity is focused around integrated productions hubs in US and Brazil.",
        "source": "Steel Times International",
        "sentiment": 0.8901854008436203,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-10-29",
        "title": "Megha Mittal: Meet Lakshmi Mittal’s daughter-in-law and Aditya Mittal’s wife; Know about her career, lifestyle, and more",
        "link": "https://www.financialexpress.com/life/lifestyle-megha-mittal-meet-lakshmi-mittals-daughter-in-law-and-aditya-mittals-wife-know-about-her-career-lifestyle-and-more-3289964/",
        "content": "MEGHA IS THE DAUGHTER OF MAHENDRA KUMAR PATODIA OF HYDERABAD.\n\n\n\nMegha Mittal, the daughter-in-law of Indian billionaire businessman Lakshmi\nMittal and wife of Aditya Mittal, Chief Executive Officer (CEO) and Director of\nArcelorMittal, is a fashion entrepreneur. The duo have three children.\n\nFor the unversed, Lakshmi Mittal has an estimated net worth of Rs 1,24,280\ncrore, as per Forbes.\n\n\nMEGHA MITTAL’S CAREER\n\nShe once headed Escada, a German fashion luxury brand as chairperson and\nmanaging director. She has also worked at Goldman Sachs in investment research.\nShe left the company after one year.\n\nMukesh Ambani hires 100 planes, including 3 Falcon 2000 Jets, to transport\nguests to Anant Ambani and Radhika Merchant’s wedding\n\nAnant Ambani gifts customised luxury watches worth Rs 1.5 crore to Shah Rukh\nKhan, Vicky Kaushal, Ranveer Singh, and other guests\n\nMeet the rich in-laws of Mukesh Ambani and Nita Ambani’s children: The Piramals,\nMehtas, and Merchants\n\nThe ultra-luxurious houses of the Ambani family – Mukesh Ambani’s Rs 15,000\ncrore Antilia to Anil Ambani’s Rs 5000 crore Abode\n\n\nMEGHA MITTAL’S FATHER\n\nMegha is the daughter of Mahendra Kumar Patodia of Hyderabad. He is the Exec.\nChairman, CEO & MD at GTN Industries. GTN Industries Limited engages in the\nmanufacture and sale of cotton yarn in India. The company offers medium, fine,\nand superfine combed yarn.\n\nMegha Mittal and her husband, Aditya, actively donate to philanthropic causes\nrelated to child health both in India and the UK.\n\n\nMEGHA MITTAL’S EDUCATION\n\nBorn in Kolkata, Megha Mittal completed her schooling at Hyderabad Public\nSchool. She then went to the Wharton School of Business for her graduation in\nFinance and Management. She is also a member of the Board of Advisors of the\nWharton School.\n\nIn 2003, she obtained a Postgraduate Degree in Architectural Interior Design at\nthe Inchbald School of Design in London.",
        "summary": "Megha Mittal is the daughter-in-law of Indian billionaire businessman LakshmiMittal. She is the wife of Aditya Mittal, Chief Executive Officer (CEO) and Director ofArcelorMittal, is a fashion entrepreneur. She once headed Escada, a German fashion luxury brand.",
        "source": "The Financial Express",
        "sentiment": 0.0135071761906147,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-05-03",
        "title": "Bloomberg - Are you a robot?",
        "link": "https://www.bloomberg.com/news/articles/2023-05-04/arcelormittal-profit-beats-forecasts-after-steel-market-improves",
        "content": "WHY DID THIS HAPPEN?\n\nPlease make sure your browser supports JavaScript and cookies and that you are\nnot blocking them from loading. For more information you can review our Terms of\nService and Cookie Policy.\n\n\nNEED HELP?\n\nFor inquiries related to this message please contact our support team and\nprovide the reference ID below.\n\nBlock reference ID:",
        "summary": "summarize: WHY DID THIS HAPPEN? Please make sure your browser supports JavaScript and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy. For inquiries related to this message please contact our support team and provide a reference ID.",
        "source": "Bloomberg",
        "sentiment": -0.04044743813574314,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-02-27",
        "title": "Analysis: ‘India has arrived.’ Why Modi’s economy offers a real alternative to China | CNN Business",
        "link": "https://www.cnn.com/2024/02/26/business/modi-india-economy-growth-optimism-hnk-intl/index.html",
        "content": "New Delhi CNN  — \n\nFor the last three decades, Peeyush Mittal has frequently driven the 185 miles\nfrom the Indian capital to the city of Jaipur. The journey always took him six\nhours.\n\n“For 30 years there’s been this promise of doing that journey in three hours. It\nhas never been possible,” said Mittal, a portfolio manager at Matthews Asia, a\nSan Francisco-based investment fund. “They’ve expanded the highway, gone from\none lane to two lane to three lane, everything has been done. But that journey\nhas always remained six hours.”\n\nExcept last year, when he cruised at 75 miles per hour on a new expressway\nconnecting the two cities, and made the trip in half the time.\n\n“My jaw dropped when I first time got on that highway. I was like, ‘Wow, man,\nhow is this even possible … in India?” he said.\n\nThe quality of India’s new infrastructure is just one of many reasons why\nMittal, who manages funds focussed on emerging markets, and other investors are\nexcited about the country’s growth prospects.\n\nFinancial professionals around the world are noticing India’s development since\n2014 under two-term Prime Minister Narendra Modi, who has said he wants the\nSouth Asian nation to become a $5 trillion economy by 2025.\n\nThe optimism around the world’s most populous nation is in stark contrast to the\nmood found in China, which is grappling with a myriad of economic challenges,\nincluding an accelerated flight of capital from the country.\n\nIts stock markets have suffered a protracted slump since recent peaks in 2021,\nwith more than $5 trillion in market value having been wiped out from the\nShanghai, Shenzhen and Hong Kong bourses. Foreign direct investment (FDI)\nplunged last year, and fell again in January, down nearly 12% compared to the\nsame month in 2023.\n\nIndia’s stock market, meanwhile, is hitting record highs. The value of companies\nlisted on India’s exchanges surpassed $4 trillion late last year.\n\nThe future appears even brighter. India’s market value is expected to more than\ndouble to $10 trillion by 2030, according to a Thursday report by Jefferies,\nwhich would make it “impossible for large global investors to ignore.”\n\n“China is a no go, so … which is the other country that can maybe replace\nChina?” said Mittal. “There’s no country like China other than India … in some\nform or fashion, it is the substitute that maybe the world is looking for to\ndrive growth.”\n\nJapan has benefited from investors seeking an alternative to China — Tokyo’s\nbenchmark index hit a new high for the first time in 34 years last week, helped\nby improving corporate profits and a weak yen. But the country is stuck in\nrecession and recently lost its position as the world’s third biggest economy to\nGermany.\n\nThe latest revision by global stock index compiler MSCI reflects the bullishness\ntowards India. MSCI said this month that it would increase India’s weighting in\nits emerging markets index to 18.06% from 17.98%, while reducing China’s to\n24.77%.\n\nMSCI’s indexes help institutional investors worldwide decide how to allocate\nmoney and where to focus their research.\n\n“India’s weight in the MSCI emerging market index was about 7% a couple of years\nback,” said Aditya Suresh, head of India equity research at Macquarie\nCapital. “Do I think that 18% [in the MSCI index] is naturally gravitating more\ntowards 25%? Yeah, that’s kind of clearly where our conversations are leading us\nto believe.”\n\nAs India heads towards national elections in the coming months, market watchers\nare hoping that Modi’s ruling Bharatiya Janata Party wins a third term, bringing\ngreater predictability to economic policies for the next five years.\n\n“If Modi is back with a majority and political stability is there, then I can\ncertainly say with confidence that there’ll be a lot more investor interest in\nIndia on a more sustainable basis,” said Mittal.\n\nThere are good reasons for the euphoria around India. From a surging young\npopulation to humming factories, the country has a lot going in its favor.\n\nThe International Monetary Fund expects India to grow by 6.5% next financial\nyear compared to 4.6% for China. Analysts at Jefferies expect the country to\nbecome the world’s third largest economy by 2027.\n\nMuch like China more than three decades ago, India is only at the beginning of a\ninfrastructure transformation, spending billions on building roads, ports,\nairports and railways.\n\nThere is a “very strong multiplier effect” on the economy from the investments\nin digital and physical infrastructure, which “you cannot roll back,” Suresh\nsaid.\n\n\n\nThe world’s fastest growing major economy is also trying to capitalize on the\nrethink underway among companies on supply chains. Global businesses want to\ndiversify operations away from China, where they faced obstacles during the\npandemic and are exposed to risks arising from tension between Beijing and\nWashington.\n\n“India is a prime candidate to benefit from the ‘friend-shoring’ of supply\nchains, notably at the expense of China,” wrote Hubert de Barochez, a market\neconomist at Capital Economics, in January.\n\nAs a result, some of the world’s biggest companies, including Apple (AAPL)\nsupplier Foxconn, are expanding their operations in India. Tesla (TSLA) CEO Elon\nMusk said last June his company is looking to invest in India “as soon as\nhumanly possible.”\n\n“[Modi] really cares about India because he’s pushing us to make significant\ninvestments in India, which is something we intend to do,” Musk told reporters.\n\nBut some worry that India’s confidence may be bordering on hubris.\n\nWhile interest in the world’s fifth largest economy is rising, the lofty prices\nof India’s stocks are scaring some international investors away.\n\nIndian shares have always been expensive compared to other emerging economies,\nsaid Suresh, but now “the premium on the premium has expanded.”\n\nDomestic investors, both retail and institutional, seem to be brushing aside\nthese high valuations, driving India’s stock market to unprecedented peaks.\n\nAccording to Macquarie, retail investors alone own 9% of India’s equity market\nvalue versus foreign investors at slightly under 20%. Analysts, however, expect\nforeign investments to pick up in the second half of 2024, once the election is\nout of the way.\n\n\n\nThere’s another potential challenge. Despite its new economic swagger, India\ndoes not have the capacity to absorb all the money that is flowing out of China,\nwhose economy is still about five times bigger.\n\nChina “has a few too many companies which are $100 and $200 billion plus [in\nvalue],” Mittal said. “It is difficult to find home for that kind of chunk of\nmoney in India.”\n\nBut the fact that India’s sizzling rally is driven by domestic investors adds to\nthe country’s strengths and reduces its dependence on foreign fund flows.\n\n“It just massively insulates India from global dynamics,” Suresh said.\n\nApart from geopolitical rifts and an uncertain economic outlook, foreign\ncompanies and investors have grown increasingly wary of domestic political risks\nin China, including the possibility of raids and detentions. Institutional\ninvestors are still very wary about buying Chinese stocks, even though many now\nlook like a bargain.\n\n“There are many good businesses in China, but with all the regulatory issues it\nbecomes very difficult to predict what they will look like in the long run,”\nsaid Priyanka Agnihotri, portfolio manager at Baltimore-based Brown Advisory.\n\nIndia, on the other hand, enjoys healthy relations with the West and other major\neconomies, and is aggressively wooing large firms to set up factories in the\ncountry.\n\nIn her budget speech in February, Indian Finance Minister Nirmala Sitharaman\nsaid FDI inflows since Modi first came to power in 2014 stood at nearly $600\nbillion, which is twice the amount during the previous decade.\n\n“For encouraging sustained foreign investment, we are negotiating bilateral\ninvestment treaties with our foreign partners, in the spirit of first develop\nIndia,” she added.\n\nAnalysts say that it would hard to stop the economic juggernaut India has set in\nmotion, irrespective of what happens to China.\n\n“Even if China comes back to the table and resolves a lot of problems, I don’t\nthink India is going back into the background anymore,” said Mittal. “It has\narrived.”\n\nLaura He and Anna Cooban contributed to this report.",
        "summary": "India's stock market is hitting record highs. The value of companies listed on India’s exchanges surpassed $4 trillion late last year. The optimism is in stark contrast to the mood found in China, which is grappling with a myriad of economic challenges.",
        "source": "CNN",
        "sentiment": 0.24512240290641785,
        "keywords": [],
        "categories": [],
        "image": null
    }
]