[
    {
        "publication_date": "2024-05-30",
        "title": "F1 not interested in divide and conquer tactics for next Concorde",
        "link": "https://www.autosport.com/f1/news/f1-not-interested-in-divide-and-conquer-tactics-for-next-concorde/10617361/",
        "content": "Grand Prix racing's key stakeholders have begun discussions to frame the next\nConcorde Agreement, the document by which F1 is run, that is set to cover the\nperiod 2026 to 2030.\n\nHistory has shown that the Concorde discussions are often extremely fraught, as\nteams vie for greater commercial rights income from the promoter as well as over\nother teams.\n\nWhen Ecclestone was F1 supremo he often pitched teams against each other –\nknowing that the negotiating hand of the competitors was much weaker if he could\npick them off as individuals rather than give them power as a group.\n\nIt was through enticing teams with extra secret bonuses to play them off each\nother, for example, that he helped accelerate the demise of the Formula One\nTeams’ Association more than a decade ago.\n\nGreg Maffei, CEO of the Liberty Media company that owns F1, says such divide and\nconquer tactics will not be employed this time around – even though he expects\nsome fraught negotiations over some aspects of the next Concorde Agreement.\n\nAutosport has already revealed, for example, that one controversial aspect of\nConcordes of the past, an extra historic bonus that Ferrari gets, is to remain.\nHowever, it will be capped – something which is understood not to have delighted\nthe Italian squad.\n\nSpeaking at an F1 in Depth event in Monaco, which was co-hosted by Autosport\nBusiness, Maffei pointed to the approach of the next Concorde Agreement\ndiscussions being a world away from how they were in the past.\n\n“The prior regime really did put a lot of time in having the teams compete\nagainst each other,” he said. “In many cases, they enjoyed just getting an edge\non each other, rather than thinking about how to grow the sport.\n\n“We've tried to take really a page out of, I'd say in some ways, the NFL in the\nUnited States: compete hard on Sunday, but on Monday league first.\n\n“We really want to grow the sport together. The teams have embraced that, and\nprofited from that, because they've not only seen the growth in F1 revenues and\ntheir share of the profits in their own sponsorship, but we’ve also seen growth\nin the value of teams.”\n\n\n\nMaffei went on to cite the fact that the commercial boom that F1 has enjoyed\nover recent years, allied to the positive impact of the cost cap, means that the\nhealth of the grid has never been as strong as it is now.\n\n“When we got involved in late 2016, and we made our first investment close in\nJanuary 2017, the bottom teams were literally worthless,” he explained.\n\n“Manor had been sold for one pound the prior summer. And now there isn't a team\nthat's worth less than a billion dollars, maybe more, and they raise money at\nthose numbers.\n\n“We've seen enormous growth in the value of the teams, just as we've seen growth\nin the value of F1. But actually, the teams' values have probably increased\nmore. And that was important: we needed to have a mentality of investment and\nmentality that these were franchises that they could really have true value. And\ntoday that's happened.”\n\nBut equally, with the Concorde Agreement being such an important document for\nteams’ long-term financial security, Maffei says he is not naive enough to\nbelieve that discussions will be a walk in the park.\n\n“There are surely issues we're going to fight over. [And] what a surprise: they\nwould like to make more money. I don't begrudge them that.\n\n“I suspect some of that, they wish, might come out of our pocket. But in\ngeneral, they appreciate we've tried to take the long view, and we try to take\nthe view that we should all profit together.”\n\nWatch: F1 2024 Monaco GP Review – Leclerc Finally Breaks the Curse",
        "summary": "The next Concorde Agreement is set to cover the period 2026 to 2030. Liberty Media CEO Greg Maffei says F1 teams will not be pitted against each other. Ferrari's historic bonus is to remain, but will be capped. F1's commercial boom means that the health of the grid has never been as strong.",
        "source": "Autosport",
        "sentiment": 0.3335346430540085,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-10-12",
        "title": "Bernie Ecclestone pleads guilty to fraud",
        "link": "https://www.bbc.com/news/uk-67088503",
        "content": "EPA\n\n\n\nEcclestone agreed to repay almost £653m to HM Revenue and Customs\n\n\n\nBernie Ecclestone, the former boss of Formula 1, has been given a suspended\nsentence after pleading guilty to fraud.\n\nThe 92-year-old did not declare more than £400m held in a trust in Singapore\nwhen asked by tax authorities in 2015.\n\nEcclestone has agreed in a civil settlement to repay almost £653m to HM Revenue\nand Customs (HMRC), a court heard.\n\nHe was sentenced to 17 months in prison, suspended for two years.\n\nThe billionaire had originally been due to stand trial next month after\ninitially pleading not guilty.\n\nThe settlement covers Ecclestone's tax affairs over the past 18 years, including\ninterest and civil penalties.\n\nThe court was told that a meeting took place between Ecclestone and HMRC\nofficers in July 2015.\n\nIt heard that Ecclestone was \"seeking to a draw a line under investigations into\nhis tax affairs\" because he \"was fed up of paying huge bills for advice\".\n\nAt the time, he declared he had only one trust which was established on behalf\nof his daughters.\n\nAccording to the charge, he had told HMRC he was \"not the settlor nor\nbeneficiary of any trust in or outside the UK\".\n\nBut following an investigation which HMRC has previously described as \"complex\nand worldwide\", that answer proved to be inaccurate.\n\nOn Thursday, Ecclestone arrived at Southwark Crown Court with his wife Fabiana\nand spoke only to tell the judge \"I plead guilty\" and to confirm basic details.\n\nHe appeared frail as he rose to address the judge in court.\n\nHis legal team argued that the former F1 boss should not face a prison term,\nowing to his advanced age, medical issues, and low level of risk to the public.\n\nDefending Ecclestone, Clare Montgomery said the defendant \"bitterly regrets the\nevents that led to this criminal trial\".\n\nSpeaking in court following Ecclestone's guilty plea, prosecutor Richard Wright\nsaid the defendant had knowingly given an \"untrue or misleading\" answer to HMRC\nwhen he told them he had no further trusts outside the UK.\n\nHe continued: \"As of 7 July 2015, Mr Ecclestone did not know the truth of the\nposition, so was not able to give an answer to the question.\n\n\"Mr Ecclestone was not entirely clear on how ownership of the accounts in\nquestion were structured.\n\n\"He therefore did not know whether it was liable for tax, interest or penalties\nin relation to amounts passing through the accounts.\n\n\"Mr Ecclestone recognises it was wrong to answer the questions he did because it\nran the risk that HMRC would not continue to investigate his affairs.\n\n\"He now accepts that some tax is due in relation to these matters.\"",
        "summary": "Bernie Ecclestone pleaded guilty to fraud at Southwark Crown Court. The 92-year-old did not declare more than £400m held in a trust in Singapore. He was sentenced to 17 months in prison, suspended for two years.",
        "source": "bbc.com",
        "sentiment": -0.5482775643467903,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-10-12",
        "title": "Ex-F1 boss Bernie Ecclestone spared jail after admitting tax fraud | CNN",
        "link": "https://www.cnn.com/2023/10/12/sport/f1-boss-bernie-ecclestone-spared-jail-spt-intl/index.html",
        "content": "Reuters  — \n\nEx-Formula One boss Bernie Ecclestone was spared an immediate prison sentence on\nThursday after he pleaded guilty to misleading Britain’s tax authority about\noverseas assets worth more than 400 million pounds ($492 million).\n\nEcclestone has also agreed a civil settlement with HM Revenue and Customs\n(HMRC), under which he will pay 652.6 million pounds covering tax, interest and\npenalties for 18 tax years between 1994 and 2022, prosecutor Richard Wright\nsaid.\n\nThe 92-year-old appeared at London’s Southwark Crown Court and pleaded guilty to\none count of fraud by false representation, just over a month before he was due\nto stand trial.\n\nEcclestone admitted giving a misleading answer to HMRC at a July 2015 meeting,\nwhen he said he had established only a single trust in favor of his daughters\nand was not a beneficiary or settlor of any other trust.\n\nHe was in fact the settlor and beneficiary of various trusts, including one\nwhich held a company that sent 416 million pounds to a bank account in Singapore\nin 2010, HMRC said.\n\n\n\nJudge Simon Bryan gave Ecclestone a 17-month prison sentence suspended for two\nyears, meaning he will only go to jail if he commits another criminal offense\nduring that time.\n\nEcclestone’s lawyer Clare Montgomery told the court Ecclestone “did not know the\ntrue position” about whether he was the beneficiary or settlor of any other\ntrust, saying his answer to HMRC was an “impulsive lapse of judgment.”\n\nEcclestone gave an unintelligible response to reporters as he left the court and\ngot into a waiting Range Rover.\n\nAndrew Penhale, chief crown prosecutor at the Crown Prosecution Service, said in\na statement: “All members of UK society, regardless of how wealthy or famous\nthey are, must pay their taxes and be transparent and open with HMRC about their\nfinancial affairs.”\n\nRichard Las, chief investigation officer and director of the Fraud Investigation\nService at HMRC, said Ecclestone had “lied to HMRC.”\n\n“This conviction demonstrates no-one is above the law and HMRC will work\ntirelessly to ensure the tax system is fair to all and pays for our vital public\nservices,” he added.\n\n\n\nEcclestone had attempted to stop the prosecution earlier this year, with his\nlawyers arguing that putting him on trial posed a serious risk to his life.\n\nA cardiologist gave evidence that the stress of the trial meant that Ecclestone\nwas “more likely to die than not during the trial,” according to a June ruling.\n\nHowever, Bryan said there was “no real and immediate threat to the life of Mr\nEcclestone by reason of the trial process.”\n\nThe decision also states that Ecclestone paid around 250 million pounds in\nincome and capital gains tax to HMRC between 1999 and 2017.\n\nHis lawyer Montgomery had noted at a previous hearing in January that Ecclestone\nwas charged shortly after he made “unpopular” comments about Russian President\nVladimir Putin.",
        "summary": "Ex-Formula One boss Bernie Ecclestone was spared an immediate prison sentence. He pleaded guilty to misleading Britain’s tax authority about assets worth more than 400 million pounds ($492 million) The 92-year-old has also agreed a civil settlement with HM Revenue and Customs.",
        "source": "edition.cnn.com",
        "sentiment": -0.5429380983114243,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-10-13",
        "title": "Ex-Formula 1 Chief Bernie Ecclestone to Pay $802 Million for Fraud",
        "link": "https://www.nytimes.com/2023/10/12/sports/autoracing/bernie-ecclestone-f1-fraud.html",
        "content": "Auto Racing|Ex-Formula 1 Chief Bernie Ecclestone to Pay $802 Million for Fraud\n\nhttps://www.nytimes.com/2023/10/12/sports/autoracing/bernie-ecclestone-f1-fraud.html\n\n\nEX-FORMULA 1 CHIEF BERNIE ECCLESTONE TO PAY $802 MILLION FOR FRAUD\n\n\n\nMr. Ecclestone pleaded guilty to not reporting hundreds of millions of dollars\nhe held in a trust in Singapore.\n\n\nBernie Ecclestone, former chief executive of the Formula 1 auto racing series,\nleaving Southwark Crown Court after admitting to fraud in\nLondon.Credit...Belinda Jiao/Reuters\n\nPublished Oct. 12, 2023Updated Oct. 13, 2023\n\nBernie Ecclestone, the former chief executive of the Formula 1 auto racing\nseries, received a suspended sentence on Thursday in London after he pleaded\nguilty in a fraud case.\n\nMr. Ecclestone, 92, faced charges related to not reporting hundreds of millions\nof dollars he held in a trust in Singapore.\n\nAs part of the deal he will pay 652 million pounds ($802 million) in tax,\ninterest and penalties. His sentence of 17 months was suspended, the judge said,\nbecause of his age and health issues.\n\nMr. Ecclestone initially pleaded not guilty and was due to stand trial starting\nnext month.\n\nHe “bitterly regrets the events that led to this criminal trial,” his lawyer\nClare Montgomery said in court, according to the BBC.\n\nThe judge, Simon Bryan, said Mr. Ecclestone’s offense was “so serious that\nneither a fine or a community order would be appropriate.”\n\nIf Mr. Ecclestone keeps his record clean for two years, he will not serve the\nsentence at all.\n\nHe has an estimated net worth of 2.5 billion pounds. He was accused of lying to\nthe British authorities when he claimed in 2015 that he had only one trust, and\nnone outside Britain.\n\nMr. Ecclestone ran the Formula 1 racing series for 43 years, until 2017, when it\nwas sold to Liberty Media. He helped build the series into the worldwide\nspectacle it has become, but in his later years he was seen by many as holding\nit back because of his autocratic style and slow pace of innovation.\n\nIn 2014, he faced criminal bribery charges in a German court in relation to a\npayment to a banker who approved the sale of Formula 1 to a private equity firm.\nBut he escaped with a $100 million fine in a deal that was widely criticized. In\n2008, he paid 10 million pounds to settle a British tax case.\n\nIn addition to his legal troubles, Mr. Ecclestone has found himself repeatedly\nin the news for his divisive comments. He drew condemnation in 2009 after an\ninterview in which he said that Hitler had been an effective leader and\nquestioned whether democracy was right for Britain. He later apologized for the\nremarks.\n\nAfter the invasion of Ukraine, he called President Vladimir Putin of Russia a\n“first class” person whom he would “take a bullet for.” During the Black Lives\nMatter protests in 2020, he said, “In lots of cases, Black people are more\nracist than what white people are.”\n\nHis wealth and notoriety have attracted the interest of tabloid newspapers and\ngossip magazines over the years. He has been married three times and has four\nchildren, ranging in age from 3 to 68.\n\nA correction was made on\n\nOct. 13, 2023\n\n:\n\nAn earlier version of this article misstated the given name of Bernie\nEcclestone’s lawyer. She is Clare Montgomery, not Christine.\n\nHow we handle corrections",
        "summary": "Bernie Ecclestone pleaded guilty to not reporting hundreds of millions of dollars he held in a trust in Singapore. As part of the deal he will pay 652 million pounds ($802 million) in tax, interest and penalties. His sentence of 17 months was suspended because of his age and health issues.",
        "source": "The New York Times",
        "sentiment": -0.6007294822484255,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-10-12",
        "title": "Bernie Ecclestone convicted of fraud | The Crown Prosecution Service",
        "link": "https://www.cps.gov.uk/cps/news/bernie-ecclestone-convicted-fraud",
        "content": "Billionaire businessman Bernie Ecclestone has admitted fraud following a\nlengthy, complex and worldwide investigation into his tax affairs by HM Revenue\nand Customs (HMRC) and prosecuted by the Crown Prosecution Service (CPS).\n\nThe 92-year-old former Formula One motor racing boss failed to declare a trust\nwhich held assets worth more than £416m.\n\nHe has made a payment of more than £650 million in relation to his tax affairs,\ncovering tax, interest and civil penalties.\n\nEcclestone was sentenced today to 17 months in prison, suspended for two years,\nat Southwark Crown Court in London.\n\nThe investigation started more than a decade ago when HMRC began a civil tax\ninvestigation in 2012.\n\nEcclestone was offered the chance to correct any mistakes in his tax and pay\nwhat was owed plus a penalty through a formal civil process known as a\nContractual Disclosure Facility (CDF) or a ‘COP9’.\n\nThe COP9 process requires the taxpayer to make a “full, open and honest”\ndisclosure or face a criminal investigation.\n\nThe former F1 boss said he was not the settlor or beneficiary of any offshore\ntrust in follow-up interviews with civil tax investigators in 2015.\n\nInformation provided to HMRC by the authorities in Singapore showed Ecclestone\nhad lied.\n\nHe was the settlor and beneficiary of various trusts. One held a company which\ntransferred $646.45 million (£416 million) from a bank account in Switzerland to\na bank account in Singapore in 2010.\n\nEcclestone admitted a single charge of fraud by false representation during a\nhearing at Southwark Crown Court on 12 October 2023.\n\nThe CPS provided extensive early investigative advice to HMRC to help develop\nthe joint prosecution strategy, focused on a single offence of fraud by false\nrepresentation.\n\nBernie Ecclestone’s guilty plea was secured following lengthy negotiations under\nthe Attorney General guidelines on plea discussions in complex fraud (2009).\n\nThe court also heard he has made a payment of £652m in relation to his wider tax\naffairs, covering tax, interest and civil penalties.\n\nPart of the payment is a Failure to Correct (FTC) penalty for offshore\nnon-compliance charged at the maximum rate of 200 per cent.\n\nAndrew Penhale, Chief Crown Prosecutor, said: “Bernie Ecclestone has pleaded\nguilty to a single offence of fraud relating to dishonest representations to\nHMRC. All members of UK society, regardless of how wealthy or famous they are,\nmust pay their taxes and be transparent and open with HMRC about their financial\naffairs.\n\n“We are pleased to bring such a complex case to a successful conclusion. We\nworked very closely with HMRC throughout and it is rewarding to see that they\nhave also secured such a significant civil tax settlement, through the\nnegotiation process.”\n\nThe CPS is committed to continue working effectively with HMRC to bring tax\nfraudsters to justice.\n\nRichard Las, Director, Fraud Investigation Service, HMRC, said: “Bernie\nEcclestone has had ample time and numerous opportunities to take responsibility\nand be honest with HMRC about his tax affairs. \n\n“Instead of taking these opportunities he lied to HMRC and as a result we opened\na criminal investigation.\n\n“This investigation has involved enquiries around the world and culminated with\nBernie Ecclestone’s guilty plea to fraud. He now has a criminal record and has\npaid £652 million relating to his wider tax affairs.\n\n“This conviction demonstrates no-one is above the law and HMRC will work\ntirelessly to ensure the tax system is fair to all and pays for our vital public\nservices.”\n\nAnyone with information about suspected tax fraud can report it to HMRC online.\n\n\nNOTES TO EDITORS\n\n * Bernard Charles Ecclestone DOB: 22/10/1930, of Princes Gate, London and\n   Oberbortstrasse, 3780 Gstaad, Switzerland, admitted one count of Fraud by\n   False Representation contrary to Section 2 of the Fraud Act (2006) at\n   Southwark Crown Court on 12 October 2023. He was sentenced today to 17\n   months' imprisonment, suspended for two years.\n * The full charge was:\n\n“On 7 July 2015, dishonestly and intending thereby to make a gain for himself or\nanother, or to cause loss to another, or expose another to a risk of loss, made\na representation to officers of Her Majesty's Revenue and Customs which was, and\nwhich he knew was or might have been, untrue or misleading, namely that:\n\n(i) he had established only a single trust, that being one in favour of his\ndaughters; and\n(ii) other than the trust established for his daughters he was not the settlor\nnor beneficiary of any trust in or outside the UK, \n\nin breach of section 2 of the Fraud Act 2006.”\n\n * Code of Practice 9 (COP9) is the civil investigation procedure that HMRC\n   follows to respond to tax fraud. It is HMRC’s main tool for investigating\n   cases of suspected tax fraud when a civil procedure is considered to be the\n   most appropriate action.\n * Under the investigation of fraud procedure, the recipient of COP9 is given\n   the opportunity to make a complete and accurate disclosure of all their\n   deliberate and non-deliberate conduct that has led to irregularities in their\n   tax affairs\n * The Contractual Disclosure Facility (CDF) is part of the process used to\n   deliver COP9. It is a contractual arrangement whereby HMRC undertakes not to\n   criminally investigate, in return for the customer’s open full, open, and\n   honest disclosure of all the tax fraud committed.\n * Find out more about HMRC's approach to tax fraud on GOV.UK.\n * Interviews with HMRC’s Director of Fraud Investigation Service, Richard Las\n   and the CPS Chief Crown Prosecutor, Andrew Penhale, are available on request\n * Directors’ Guidance to accompany the Attorney General’s Guidelines on Plea\n   Discussions in cases of Serious or Complex Fraud | The Crown Prosecution\n   Service (cps.gov.uk)\n * Plea discussions in cases of serious or complex fraud - GOV.UK (www.gov.uk).",
        "summary": "Bernie Ecclestone, 92, failed to declare a trust which held assets worth more than £416m. He was sentenced to 17 months in prison, suspended for two years, at Southwark Crown Court in London. The former F1 boss said he was not the settlor or beneficiary of any offshore trust.",
        "source": "cps.gov.uk",
        "sentiment": -0.3277747295796871,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-10-12",
        "title": "Ex-F1 boss Bernie Ecclestone handed suspended prison sentence for fraud",
        "link": "https://www.motorsport.com/f1/news/ex-f1-boss-ecclestone-pleads-guilty-to-fraud/10531913/",
        "content": "Ecclestone, who owned the championship-winning Brabham team from 1972 to 1987 as\nhe rose to overall power in F1, led the series for more than four decades before\nits 2017 takeover by current owner Liberty Media. He then took on the 'chairman\nemeritus' and an advisory role.\n\nBut in July of last year, the Crown Prosecution Service \"authorised the charging\nof Bernard Charles Ecclestone with fraud by false representation, following a\nHMRC investigation.\"\n\nThis relates to a single count of fraud made on 7 July 2015, the court\npreviously hearing how Ecclestone failed to declare in excess of £400m in trusts\nheld in a Singapore bank account.\n\nOn Thursday 12 October, the 92-year-old, who has an estimated net worth of £2.5\nbillion, changed his plea to guilty while appearing at Southwark Crown Court.\n\nAccordingly, Ecclestone has been sentenced to 17 months in prison, suspended for\ntwo years.\n\nIt is now being reported that Ecclestone has reached a settlement to pay HM\nRevenue & Customs over £600m to cover 18 tax years.\n\nSky News notes that prosecutor Richard Wright KC said: \"Mr Ecclestone was not\nentirely clear on how ownership of the accounts in question were structured.\n\n\"He therefore did not know whether it was liable for tax, interest or penalties\nin relation to amounts passing through the accounts.\n\nBernie Ecclestone, Chairman Emiritus of Formula 1\n\nPhoto by: Zak Mauger / Motorsport Images\n\n\"Mr Ecclestone recognises it was wrong to answer the questions he did because it\nran the risk that HMRC would not continue to investigate his affairs. He now\naccepts that some tax is due in relation to these matters.\"\n\nAccording to Simon York, the director of the HMRC's Fraud Investigation Service,\nthe charge against Ecclestone \"follows a complex and worldwide criminal\ninvestigation.\n\n\"The criminal charge relates to projected tax liabilities arising from more than\n£400m of offshore assets which were concealed from HMRC.\n\n\"HMRC is on the side of honest taxpayers and we will take tough action wherever\nwe suspect tax fraud. Our message is clear – no one is beyond our reach.\n\nEcclestone was previously subject to a bribery trial in Germany between 2012 and\n2014, which ended when he paid a £60m settlement without admitting guilt.\n\nF1 will not be commenting on the matter.",
        "summary": "Bernard Charles Ecclestone has been sentenced to 17 months in prison, suspended for two years. The 92-year-old F1 supremo failed to declare in excess of £400m in trusts held in a Singapore bank account. He changed his plea to guilty while appearing at Southwark Crown Court.",
        "source": "Motorsport.com",
        "sentiment": -0.46882459335029125,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-10-12",
        "title": "From F1 supremo to tax fraud conviction: the rise and fall of Bernie Ecclestone",
        "link": "https://www.theguardian.com/sport/2023/oct/12/rise-and-fall-of-bernie-ecclestone-formula-one",
        "content": "Bernie Ecclestone ran Formula One almost single-handedly for decades. There was\nnot much other choice: the company’s headquarters in Kensington, London, only\ncontained a handful of staff. The pinnacle of the motor sport business ran on\nhandshakes and face-to-face negotiation.\n\nNow that handshake approach appears to have been his downfall, after Ecclestone\npleaded guilty to tax fraud at Southwark crown court in London on Thursday.\nAfter setting up a July 2015 meeting with HM Revenue and Customs to try to bring\nan end to an investigation into his finances, he lied to officials. Instead of\nending his troubles, his answers that day have resulted in him receiving a\n17-month custodial sentence, suspended for two years.\n\nEcclestone will also have to pay HMRC £652.6m, plus prosecution costs of\n£74,000, after he admitted to failing to declare £400m in assets to the UK tax\nauthority.\n\nAfter arriving at court, wearing a grey three-piece suit, Ecclestone, whose 93rd\nbirthday is later this month, told the judge: “I plead guilty.”\n\nIt was a steep fall from grace for a man who commanded race paddocks – and\nsweetheart deals for special treatment from world leaders ranging from the UK’s\nTony Blair to Russia’s Vladimir Putin – from the late 1970s until January 2017.\nThat position made him one of the most prominent people in global motor sport.\nDuring that time, he grew Formula One into a prized global media asset while\nmaintaining tight control of the commercial and sporting sides of the business.\n\nEcclestone’s rise started with a stint as owner of the Brabham racing team in\nthe 1970s, when he realised that the amateurish spirit of the sport was masking\nits commercial potential. He brought together rival teams and managed to\npersuade them to sell the broadcasting rights to the sport as a bundle, bringing\nserious television money in for the first time.\n\n\nEcclestone, then Brabham’s owner, at the Belgian Grand Prix in 1978 with the\ndriver Niki Lauda. Photograph: Hoch Zwei/Corbis/Getty Images\n\nThirty years later, he gradually gave up financial control of the business,\nselling a stake to the US private equity firm CVC in 2005. CVC left Ecclestone –\nwho always appeared to relish the dealmaking as much as the sport – to his own\ndevices as the money rolled in. However, that changed when Liberty Media bought\nFormula One from CVC in 2017. Ecclestone, whose personal mode of doing business\ndid not appear to fit with modern ideas of corporate governance, was removed\nshortly after the takeover.\n\nLiberty has since aimed to draw back younger audiences – an approach Ecclestone\nin 2014 rejected because, he said, young people “can’t afford” Rolex watches.\nLiberty clearly thinks differently: it embraced social media, believing that\nincreased exposure would lead to more viewers. It has also produced a hit\nNetflix documentary, Drive to Survive, that has played a big part in Formula\nOne’s huge growth in popularity in the US, a feat Ecclestone never achieved.\n\nEcclestone has faced legal troubles before. In 2014, he agreed, without any\nadmission of guilt, to pay £60m to bring an end to a bribery trial in Germany,\nand in 2022 he was arrested by Brazilian police for carrying a gun while\nboarding a private plane, before paying bail. HMRC had opened its investigation\nin 2012, the Crown Prosecution Service said.\n\nThe tax authority gave Ecclestone the chance to correct any mistakes in his tax\nand pay what was owed plus a penalty via a non-criminal process. However, he\ncommitted a crime during a meeting in July 2015 when he said he was not the\nsettlor or beneficiary of any offshore trust in an interview with civil tax\ninvestigators.\n\n“Information provided to HMRC by the authorities in Singapore showed Ecclestone\nhad lied,” the CPS said. Ecclestone initially pleaded not guilty in August, but\ncapitulated after “lengthy negotiations”.\n\n\nEcclestone pictured with the president of Azerbaijan, Ilham Aliyev, left, and\nhis wife, Mehriban Aliyeva, at the Baku City Circuit in June 2016. Photograph:\nValdrin Xhemaj/EPA\n\nEcclestone has attended the occasional Formula One race since he was ousted,\nalthough his public profile has diminished – apart from him making increasingly\nbizarre statements criticising F1 and saying last year he would “take a bullet”\nfor Putin after the Russian leader ordered the full-scale invasion of Ukraine.\n\nLawyers for Ecclestone had argued in hearings in the case that his age was\ncatching up with him, and that he might not survive the shock of incarceration.\nThe judge, Mr Justice Bryan, said he noted the “undoubted seriousness of your\noffending”, but said he had taken into account the low risk of reoffending and\nother factors such as Ecclestone’s age, his medical condition and the potential\nimpact of a prison sentence on his young child.\n\nEcclestone faced one more media scrum on Thursday as he got into the back of a\nwhite Range Rover outside the court. Asked for comment on his sentence, his\nanswer was too quiet to be heard.\n\nYet even with his reputation tarnished, the father of Formula One still has his\nfreedom. After the hearing a Sunday Times journalist spotted him at a stall at\nLondon’s Borough Market, buying doughnuts.",
        "summary": "Bernie Ecclestone pleaded guilty to tax fraud at Southwark crown court in London. He received a 17-month custodial sentence, suspended for two years. He admitted to failing to declare £400m in assets to the UK tax authority.",
        "source": "The Guardian",
        "sentiment": -0.43017789348959923,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-10-12",
        "title": "Ex-F1 boss Ecclestone to pay US$800 million after admitting UK tax fraud",
        "link": "https://www.scmp.com/news/world/europe/article/3237716/ex-f1-boss-bernie-ecclestone-pay-over-us800-million-after-withholding-singapore-assets-uk-tax-fraud",
        "content": "EX-F1 BOSS BERNIE ECCLESTONE TO PAY OVER US$800 MILLION AFTER WITHHOLDING HIS\nSINGAPORE ASSETS IN UK TAX FRAUD\n\n\n\nFormula One mogul Bernie Ecclestone has pleaded guilty to a criminal tax fraud\ncharge for failing to tell British authorities about assets held in a Singapore\nbank of around £400 million (US$490 million).\n\nHe has agreed to pay more than £652 million pounds (US$800 million) to His\nMajesty’s Revenue and Customs (HMRC), prosecutors said on Thursday.\n\nThe 92-year-old billionaire was also handed a 17-month prison term, suspended\nfor two years, at Southwark Crown Court in London.\n\nEcclestone – who ruled motor-racing for four decades until departing in 2017 –\nappeared in court and pleaded to one count of fraud by false representation,\njust over a month before he was due to stand trial.\n\nEcclestone, accompanied by his wife Fabiana, spoke only to confirm his name and\nto enter his plea.\n\n\n\nBernie Ecclestone did much to promote motor racing, including courting Russian\nPresident Vladimir Putin, seen here during the Russian Grand Prix in 2014.\nPhoto: via Reuters\n\nHe was charged with failing to declare the overseas account following an\ninvestigation into his finances by HMRC.\n\nProsecutors said Ecclestone made untrue or misleading representations to HMRC at\na 2015 meeting, when he said he “established only a single trust” in favour of\nhis three daughters.\n\nProsecution lawyer Richard Wright said that when Ecclestone was asked by tax\nofficers if he had any other overseas trusts beyond that one, he replied that he\ndid not. The Singapore bank account was held by Bank Julius Baer, a private\nSwiss bank.\n\n“Mr. Ecclestone recognised it was wrong to answer the questions he did,” Wright\nsaid. “He now accepts some tax is due in relation to these matters.”\n\nThe prosecutor said the tax authorities will pursue a civil settlement in\nrelation to tax liabilities. Ecclestone would pay £652 million to HMRC, lawyers\nsaid.\n\nThe British businessman, whose financial net worth has been estimated at some\nUS$3 billion, is widely credited with transforming Formula One commercially.\n\nEcclestone is no stranger to controversy. He built a warm working relationship\nwith Russian President Vladimir Putin while negotiating to bring Formula One to\nRussia, with racing taking place in 2014 at the Black Sea resort of Sochi.\n\nEcclestone told a television interviewer in Britain last year that Putin was a\n“first-class person”, and appeared to downplay the invasion of Ukraine.\n\n“What he’s doing is something that he believed was the right thing he was doing\nfor Russia,” he said.\n\n“Unfortunately, he’s like a lot of businesspeople, certainly like me, we make\nmistakes from time to time.\n\n“I’d still take a bullet for him. I’d rather it didn’t hurt, but if it does I’d\nstill take a bullet, because he’s a first-class person.”\n\n\n\nBernie Ecclestone and daughter Tamara. Photo: Instagram\n@tamaraecclestoneofficial\n\nEcclestone added that the war in Ukraine could have been averted if President\nVolodymyr Zelensky made “a big enough effort” to speak to Putin.\n\nLewis Hamilton, a seven-time Formula One world champion, said Ecclestone was an\n“older voice” who no longer represented the sport.\n\n“We don’t need any more of it, to hear from someone that believes in the war,\nand the displacement of people and killing of people, and supporting that person\n[Putin] is beyond me,” he said.\n\nAfter the invasion of Ukraine, last year’s race was cancelled by Formula One\nwhich Ecclestone said did not “make sense”.\n\nThe organisation has since terminated its contract for races in Russia.\n\nAdditional reporting by Bloomberg, Associated Press\n\n",
        "summary": "Bernie Ecclestone has pleaded guilty to a criminal tax fraud charge. He failed to tell British authorities about assets held in a Singapore bank. He has agreed to pay more than £652 million pounds (US$800 million) The 92-year-old billionaire was also handed a 17-month prison term.",
        "source": "South China Morning Post",
        "sentiment": -0.44122714176774025,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-10-12",
        "title": "Former F1 boss Bernie Ecclestone spared jail after admitting tax fraud",
        "link": "https://www.aljazeera.com/sports/2023/10/12/former-f1-boss-bernie-ecclestone-spared-jail-after-admitting-tax-fraud",
        "content": "Ecclestone pleaded guilty to a fraud charge over his failure to declare millions\nof dollars held in a trust in Singapore to UK’s government.\n\nFormer Formula One boss Bernie Ecclestone was spared an immediate prison\nsentence after he pleaded guilty to misleading The United Kingdom’s tax\nauthority about overseas assets worth more than 400 million pounds ($492m).\n\nEcclestone has also agreed a civil settlement with HM Revenue and Customs\n(HMRC), under which he will pay 652.6 million pounds ($798.4m) covering tax,\ninterest and penalties for 18 tax years between 1994 and 2022, prosecutor\nRichard Wright said on Thursday.\n\nThe 92-year-old appeared at London’s Southwark Crown Court and pleaded guilty to\none count of fraud by false representation, just more than a month before he was\ndue to stand trial.\n\nEcclestone admitted giving a misleading answer to HMRC at a July 2015 meeting,\nwhen he said he had established only a single trust in favour of his daughters\nand was not a beneficiary or settlor of any other trust.\n\nHe was, in fact, the settlor and beneficiary of various trusts, including one\nwhich held a company that sent 416 million pounds ($509m) to a bank account in\nSingapore in 2010, HMRC said.\n\nJudge Simon Bryan gave Ecclestone a 17-month prison sentence suspended for two\nyears, meaning he will only go to jail if he commits another criminal offence\nduring that time.\n\nEcclestone’s lawyer Clare Montgomery told the court Ecclestone “did not know the\ntrue position” about whether he was the beneficiary or settlor of any other\ntrust, saying his answer to HMRC was an “impulsive lapse of judgment”.\n\nEcclestone gave an unintelligible response to reporters as he left the court.\n\nAndrew Penhale, chief crown prosecutor at the Crown Prosecution Service, said in\na statement, “All members of UK society, regardless of how wealthy or famous\nthey are, must pay their taxes and be transparent and open with HMRC about their\nfinancial affairs.”\n\nRichard Las, chief investigation officer and director of the Fraud Investigation\nService at HMRC, said Ecclestone had “lied to HMRC”.\n\n“This conviction demonstrates no one is above the law and HMRC will work\ntirelessly to ensure the tax system is fair to all and pays for our vital public\nservices,” he added.\n\n> ⚖️ Billionaire businessman Bernie Ecclestone has admitted fraud following a\n> lengthy, complex and worldwide investigation into his tax affairs by HMRC and\n> prosecution by the CPS.\n> \n> He has paid more than £652m and was sentenced to 17 months' imprisonment,\n> suspended for two years.\n> \n> — Crown Prosecution Service (@CPSUK) October 12, 2023\n\nEcclestone had attempted to stop the prosecution earlier this year, with his\nlawyers arguing that putting him on trial posed a serious risk to his life.\n\nA cardiologist gave evidence that the stress of the trial meant that Ecclestone\nwas “more likely to die than not during the trial”, according to a June ruling.\n\nHowever, Bryan said there was “no real and immediate threat to the life of Mr\nEcclestone by reason of the trial process”.\n\nThe decision also states that Ecclestone paid approximately 250 million pounds\nin income and capital gains tax to HMRC between 1999 and 2017.\n\nHis lawyer Montgomery had noted at a previous hearing in January that Ecclestone\nwas charged shortly after he made “unpopular” comments about Russian President\nVladimir Putin.",
        "summary": "Bernie Ecclestone pleaded guilty to a fraud charge over his failure to declare millions of dollars held in a trust in Singapore to UK’s government. He has paid more than £652m and was sentenced to 17 months' imprisonment, suspended for two years.",
        "source": "Al Jazeera",
        "sentiment": -0.6477877981960773,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-07-12",
        "title": "Bernie Ecclestone pushed for Flavio Briatore Alpine return",
        "link": "https://www.formulanerds.com/news/bernie-ecclestone-pushed-for-flavio-briatore-alpine-return/",
        "content": "LATEST EPISODE | CUT TO THE RACE PODCAST\n\n\n\nBernie Ecclestone was instrumental in the signing of formerly banned Team\nPrincipal Flavio Briatore to Alpine this year.\n\nBriatore has returned to the Formula 1 paddock as Executive Advisor for the\nAlpine F1 Team (Image Credit: XPB Images)\n\nAlpine shocked the F1 community earlier this year by signing Briatore as\nExecutive Advisor following 16 years out of the sport. The Italian businessman\nwas banned indefinitely from any FIA-sanctioned event in 2008 following his\ninvolvement in Renault’s “Crashgate” race-fixing scandal at that year’s\nSingapore Grand Prix.\n\nHowever, this ban was lifted by the French courts in 2010. Although Briatore\ndidn’t immediately set his sights on joining another team, he regularly attended\nGrands Prix over the next decade.\n\nThe 74-year-old joins an Alpine team in a state of relative turmoil, as several\ntop engineers and Directors have left the team after their poor 2023 season and\ndisastrous start to the 2024 campaign.\n\nIt all started part-way through the 2023 season when former Team Principal Otmar\nSzafnauer announced his departure from Alpine. Over the next several months,\nthis was followed by resignations from Sporting Directors Alan Permane and\nDavide Brivio and Chief Technical Officer Pat Fry. Laurent Rossi also stepped\ndown from his senior role as CEO during this time. Technical Director Matt\nHarman Head of Aerodynamics Dirk de Beer and engineer Bob Bell joined the mass\nexodus in 2024.\n\nSince Briatore joined however, the Enstone and Viry-based outfit have enjoyed an\nuptick in form. Prior to the recent British Grand Prix, at least one of their\ndrivers Pierre Gasly and Esteban Ocon had contributed points for the team in the\nlast four events. This contrasted the first seven Grands Prix in which Alpine\nonly scored a single point.\n\nA RASCAL AMONG ANGELS COULD HELP\n\nSo could Briatore already be making changes to the structure and running of\nAlpine only months into his tenure as a mere advisor? Former F1 CEO Bernie\nEcclestone seems to think so.\n\nHe also revealed that he was the one who advised Renault CEO Luca de Meo to sign\nthe Italian. Speaking to Blick, Ecclestone stated: “I spoke to Renault boss Luca\nde Meo on the phone for a long time.\n\n> “He was desperate. Then the word Briatore came up. We quickly agreed that in\n> such a confused situation, only a doer, a rascal among angels could help. And\n> there are enough saints in the Grand Prix circus!”\n\nEcclestone believes that Briatore’s unique personality will help Alpine climb up\nthe running order in the next few years. He concluded: “Flavio’s great strength\nhas always been to keep the discussions short, do and think big!\n\n“You don’t need friends in Formula 1, you only need success.”\n\nCan Alpine get back to points-scoring form at the Hungaroring? The Hungarian\nGrand Prix commences Sunday 21 July at 14:00 BST (15:00 local time).\n\nFeature Image Credit: Majid Aliyev on YouTube",
        "summary": "Flavio Briatore has returned to the Formula 1 paddock as Executive Advisor for the Alpine F1 Team. The Italian businessman was banned indefinitely from any FIA-sanctioned event in 2008 following his involvement in Renault’s “Crashgate” race-fixing scandal. Bernie Ecclestone was instrumental in the signing of the 74-year-old.",
        "source": "FormulaNerds.com",
        "sentiment": -0.47818516939878464,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-07-12",
        "title": "F1 News: Bernie Ecclestone Reveals Involvement In Return Of Controversial Figure",
        "link": "https://www.si.com/fannation/racing/f1briefings/news/f1-news-bernie-ecclestone-reveals-involvement-in-return-of-controversial-figure-01j2m5w7x25x",
        "content": "Bernie Ecclestone, the former Formula 1 CEO, has revealed that he orchestrated\nthe dramatic return of Flavio Briatore to Alpine, now rebranded under Renault's\nAlpine banner. Briatore, previously ousted from Formula 1 following the 2008\nSingapore 'Crashgate' scandal, steps back into the limelight as an executive\nadvisor amid Alpine's tumultuous start in the 2024 F1 season.\n\nBriatore's return was facilitated by Ecclestone after a telling conversation\nwith Renault CEO Luca de Meo. Ecclestone commented in an interview with Blick:\n\n “I spoke to Renault boss Luca de Meo on the phone for a long time.\n\n“He was desperate. Then the word Briatore came up. We quickly agreed that in\nsuch a confused situation, only a doer, a rascal among angels could help. And\nthere are enough saints in the Grand Prix circus!\n\n“Flavio’s great strength has always been: ‘Keep the discussions short, do and\nthink big!\n\n“You don’t need friends in Formula 1, you only need success.”\n\nSince Briatore's involvement, signs of improvement at Alpine have been reported.\nDrivers Pierre Gasly and Esteban Ocon have both made it to Q3 sessions in Spain\nand Austria, respectively, showing potential despite setbacks, like the\ntechnical issues at the British GP which halted Gasly's points streak.\n\nLooking towards the future, Briatore's eyes are set firmly on 2026, aligning\nwith the introduction of new chassis and power unit regulations in Formula 1.\nDuring an interview with RAI Radio, Briatore confidently shared, as quoted by\nPlanet F1:\n\n“In 2026 I will win races, Alpine will be on the podium then, how many we will\nbe able to do I don’t know.\n\n“This year, we have many handicaps, we are reshaping the whole team.”",
        "summary": "Bernie Ecclestone has revealed that he orchestrated the return of Flavio Briatore to the Alpine F1 team. The former Formula 1 CEO said that he spoke to Renault boss Luca de Meo about the Italian's return. Briatores eyes are set firmly on 2026, aligning himself with the introduction of new chassis and power unit regulations in Formula 1.",
        "source": "Sports Illustrated",
        "sentiment": 0.3129568547010422,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-07-12",
        "title": "Bernie Ecclestone involvement discovered in Flavio Briatore’s return to Alpine",
        "link": "https://www.planetf1.com/news/bernie-ecclestone-involvement-flavio-briatore-alpine-return",
        "content": "Flavio Briatore is back in F1 with Alpine\n\nFormer F1 supremo Bernie Ecclestone has recalled his chat with the Renault CEO\nwhich inspired the return of Flavio Briatore.\n\nRenault’s Formula 1 team, which currently represents their Alpine brand,\nsuffered a poor start to the F1 2024 campaign and has scored just nine points so\nfar.\n\n\nBERNIE ECCLESTONE REVEALS FLAVIO BRIATORE NAME-DROP IN RENAULT BOSS CHAT\n\nThe team has made sweeping changes to its senior staff ranks over the last year,\nbut arguably their most head-turning recruit has been that of Briatore, the\nformer Renault team boss who has returned to Team Enstone in the capacity of\nexecutive advisor.\n\nBriatore left Formula 1 in disgrace following the 2008 Singapore ‘Crashgate’\nscandal, but now back on the scene, will look to play a pivotal role in\ninspiring a rise back up the grid for Alpine.\n\nAnd Ecclestone – who is no stranger to Briatore from his time at the helm of\nFormula 1 – revealed his involvement in Briatore’s return, after speaking on the\nphone at length with Renault CEO Luca de Meo.\n\nEcclestone told Blick: “I spoke to Renault boss Luca de Meo on the phone for a\nlong time.\n\n“He was desperate. Then the word Briatore came up. We quickly agreed that in\nsuch a confused situation, only a doer, a rascal among angels could help. And\nthere are enough saints in the Grand Prix circus!”\n\nAssessing what Briatore will bring to Alpine, Ecclestone said the Italian’s\n“great strength” is his approach of less talking, more action.\n\n“Flavio’s great strength has always been: ‘Keep the discussions short, do and\nthink big!” Ecclestone stated.\n\n“You don’t need friends in Formula 1, you only need success.”\n\n\nF1 2025 DRIVER MARKET CONTINUES TO HEAT UP\n\n👉 Alpine refute ‘three’ driver list in the wake of Schumacher/Doohan test\n\n👉 F1 2025 driver line-up: Who is already confirmed for the 2025 grid?\n\nAlpine’s form has improved since Briatore’s return, with both Pierre Gasly and\nEsteban Ocon reaching Q3 in Spain, with Ocon repeating the trick in Austria. A\ngearbox issue on the British GP formation lap cost Gasly the chance to extend a\nfour-race streak of points finishes.\n\nBriatore’s ambitions though are far greater, as he targets a return to winning\nways for the team come 2026, when new chassis and power unit regulations come\ninto effect.\n\n“In 2026 I will win races, Alpine will be on the podium then, how many we will\nbe able to do I don’t know,” Briatore told RAI Radio.\n\n“This year, we have many handicaps, we are reshaping the whole team.”\n\nRead next: Mercedes message to Alpine revealed by Toto Wolff in ‘complicated’\npower unit talks",
        "summary": "Former F1 supremo Bernie Ecclestone has recalled his chat with the Renault CEO Luca de Meo which inspired the return of Flavio Briatore to F1. The Italian left the sport in disgrace following the 2008 Singapore ‘Crashgate’ scandal, but now back on the scene, will look to play a pivotal role in inspiring a rise back up the grid.",
        "source": "PlanetF1",
        "sentiment": 0.17719031497836113,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-01-29",
        "title": "Bernie Ecclestone was fined the second heaviest penalty in the UK for tax fraud",
        "link": "https://www.motorsinside.com/en/f1/news/32860-bernie-ecclestone-was-fined-second-heaviest-penalty-in-uk-for-tax-fraud.html",
        "content": "F1. Bernie Ecclestone has been sentenced to 17 months of probation for tax\nfraud, as well as a heavy fine. The financial penalty imposed on the former\nBrabham team manager is the second largest in the history of his country.\n\nWritten by By On 29/01, 14:10, archivé\n\n\n\n© Motors Inside / Bernie Ecclestone did not declare £400 million worth of assets\nin Singapore to the British tax authorities.\n\n\n\nThe fine is very steep for the former Formula 1 moneyman. Bernie Ecclestone was\nsentenced in October 2023 by the United Kingdom's justice system for not\ndeclaring £400 million, equivalent to €468 million, of assets in Singapore\nbetween 2013 and 2016.\n\nDuring his trial, the 93-year-old British man pleaded guilty to tax fraud and\nwas sentenced to 17 months of suspended imprisonment, as well as a total fine of\n£652.6 million, which is approximately 764 million euros.\n\nThis financial sanction is the second largest in the United Kingdom, behind the\n£664.5 million, approximately €778 million, imposed on Russian trader Alex\nGerko, founder of XTX Market.\n\n\nIT WAS AN HONEST MISTAKE.\n\nDuring the trial, Clare Montgomery, Ecclestone's lawyer, invoked her client's\nfragile health in order to avoid a prison sentence. The Briton, on his part,\nasserts that he did not intend to defraud his country's tax authorities.\n\n\"I have always paid taxes in the United Kingdom, every year. I have to take care\nof my affairs for my future. The issue concerned the tax I earned abroad, on\nwhich the British tax authorities believed I should pay British taxes. It was an\nhonest mistake and I think everyone knew that. Of course, I understand there\nwill be criticisms, but people do a lot of things in life for money,\" Bernie\nEcclestone told The Times.",
        "summary": "Bernie Ecclestone has been sentenced to 17 months of probation for tax fraud. The financial penalty imposed on the former F1 boss is the second largest in the history of his country. The 93-year-old did not declare £400 million worth of assets in Singapore to the British tax authorities.",
        "source": "Motors Inside",
        "sentiment": -0.753938838839531,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-05-16",
        "title": "Ex-wife of F1 billionaire Bernie Ecclestone sets up family office to manage $881M divorce settlement",
        "link": "https://fortune.com/europe/2024/05/16/ex-wife-of-british-f1-billionaire-bernie-ecclestone-sets-up-family-office-to-manage-her-881-million-divorce-settlement/",
        "content": "The superrich have often faced an age-old dilemma in handling their eye-watering\nfortunes. Do they invest in the stock market? Buy up property? Pick up a\nphilanthropy habit? Or simply go on a spending spree? The ex-wife of F1 mogul\nBernie Ecclestone has faced that same dilemma for some years since landing her\n$881 million divorce settlement.\n\nNow, her plans are starting to become clear.\n\nSlavica Malic, the ex-wife of 93-year-old billionaire Ecclestone, has set up a\nfamily office to manage her multi-million dollar fortune in the wake of her\ndivorce from the former CEO of Formula One in 2009, Bloomberg first reported.\n\nIt is expected that Malic, who divorced Ecclestone on the grounds of\n“unreasonable behavior,” will use the office to invest her nine-figure fortune.\n\nCompanies House filings reviewed by Fortune confirm that Malic set up a company\ncalled Elm Cove in August last year.\n\nTo run her office, Malic has enlisted the help of London-based trust manager\nStefan Le Marquand, filings show. She has also hired former HSBC managing\ndirector Fredrik Nerbrand as the office’s chief investment officer, Bloomberg\nreported citing people familiar with the matter.\n\nNerbrand’s LinkedIn profile says he is currently operating as chief investment\nofficer for a single family office. His tasks include setting up a new operating\nmodel for the office and investing “in all asset classes but with a focus on\nwealth preservation.”\n\nRepresentatives for Malic didn’t immediately respond to a request for comment.\n\n\nTHE EX-WIFE MILLIONAIRES CLUB\n\nMalic joins a long list of the ex-wives of billionaires who have been given the\nopportunity to build their own legacies in the wake of a divorce settlement. \n\nThey have taken different routes in their journeys with their newfound\nindependent fortunes.\n\nMacKenzie Scott, the ex-wife of Amazon founder Jeff Bezos, came into an\napproximately $36 billion fortune after receiving 25% of Amazon’s shares in her\ndivorce settlement with the former CEO. \n\nShe has very publicly focused her efforts on philanthropy, claiming to have\ndonated $17.3 billion to more than 2,300 nonprofits since 2019.\n\nMelinda French Gates, the ex-wife of Microsoft co-founder Bill Gates, has poured\nbillions in philanthropic causes through the $63 billion Bill and Melinda Gates\nFoundation, which she continued to co-run after her divorce in 2021. \n\nEarlier this week, Gates announced she would be stepping away from the\norganization. As part of the exit agreement, Gates will take with her a $12.5\nbillion pot to commit to her work “on behalf of women and families.” \n\nBased on Malic’s chief investment officer’s goals for the fund, it seems\nphilanthropy won’t be her first priority, though she does appear to have a\nphilanthropic trust titled the Slavica Malic Foundation, founded in 2023.\n\nInstead, she will likely add her name to a growing pot of massive female-led\ninvestment funds looking to grow their wealth, including Oprah Winfrey who\nsimilarly started a family office in 2010.\n\nMalic will make up a rising tide of these female investors, who are expected to\ncontrol $30 trillion in the financial assets of baby boomers by the end of the\ndecade, according to McKinsey.\n\n\nBERNIE’S BILLIONS\n\nMalic’s ex-husband Ecclestone had effective control of the worldwide racing\nfranchise Formula One after buying the rights to the group in the 1970s,\nmaintaining a chokehold on the group’s operations as CEO even after selling most\nof his stake in the 1990s. \n\nThe company was sold to Liberty Media in 2017 for $8 billion, landing him a\nsizeable fortune. The nonagenarian currently has a net worth of around $2.4\nbillion, according to Forbes. \n\nHowever, that fortune has taken a sharp haircut after a run-in with U.K.\nauthorities last year. \n\nIn October, Ecclestone was forced to cough up £652 million ($793 million) after\nadmitting to defrauding the U.K.’s HMRC, ending a decades-long dispute with the\ntax body.\n\nThe financial details of his divorce from Malic were laid bare as part of that\ngruesome investigation.\n\nRecommended Newsletter: CEO Daily provides key context for the news leaders need\nto know from across the world of business. Every weekday morning, more than\n125,000 readers trust CEO Daily for insights about–and from inside–the C-suite.\nSubscribe Now.",
        "summary": "Slavica Malic, the ex-wife of 93-year-old billionaire Ecclestone, has set up a family office to manage her multi-million dollar fortune. She divorced the former CEO of Formula One in 2009 on the grounds of his “unreasonable behavior” Malic joins a long list of ex-wives of billionaires who have been given the chance to build their own legacies.",
        "source": "Fortune",
        "sentiment": -0.010837651789188385,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-10-12",
        "title": "Gas market hits seven-month high over threats to supplies",
        "link": "https://www.telegraph.co.uk/business/2023/10/12/ftse-100-markets-news-uk-economy-gdp-us-inflation-latest/",
        "content": "Gas prices have hit their highest level for seven months amid rising fears of a\nsqueeze on global supplies.\n\nEuropean wholesale gas prices rose to 53 euros per megawatt hour (MwH) -\ncompared with 35 euros at the start of September.\n\nThe prices are still well below the 150 euros/MwH seen during the energy crisis\nlast December and the all-time high of 345 euros/MwH seen in March 2022, but\nthere are fears that an escalating Israeli-Hamas conflict could see further\nrises.\n\nTraders were concerned over three separate potential impacts on supplies.\nPerhaps the biggest is that Israel, itself a major gas producer, has ordered US\nmajor Chevron to halt production at its Tamar gasfield.\n\nTamar produces about half of Israel’s 20 billion cubic metres of annual gas\nproduction and is also the closest of its three fields to Gaza. About a third of\nIsraeli production is exported, either via pipeline to Egypt or as LNG to\nEurope. For comparison, the UK uses about 75 billion cubic metres of gas a year.\n\nSeparately, there are concerns that a rupture in the 45-mile-long Baltic Sea gas\npipeline from Finland to Estonia was due to sabotage. Finnish president Sauli\nNiinistö has discussed the breach with Jens Stoltenberg, Nato secretary-general.\n\nThe pipeline is not a vital one but, as with the sabotaged Nordstream 2\npipeline, the incident shows the vulnerability of subsea infrastructure. The UK\nand Germany are both highly dependent on the much larger pipelines carrying gas\nfrom Norway.\n\nMeanwhile, in Australia, workers at Chevron’s liquefied natural gas plant are\nthreatening strikes at the Gorgon and Wheatstone facilities, which account for\nroughly 7pc of global LNG supply.\n\nOne analysis, by Trading Economics, which tracks economic indicators, said:\n“Prices have surged more than 26% this week due to concerns about gas supplies\nas the heating season approaches, with colder temperatures expected.\n\nTom Faulkner, Head of Assets & Infrastructure and Networks at Cornwall Insight,\nsaid the damage to the Finnish pipeline was particularly concerning for European\nsupplies.\n\nHe said: “While the damage to the Finnish pipeline may not have immediate\nphysical consequences, it’s expected to raise concerns among traders regarding\npotential threats to other gas infrastructure, in a similar fashion to\nNordStream.\n\n“Consequently, although it may not directly affect supply security, this\ncombined with events in the Middle East, will undoubtedly contribute to a rise\nin gas prices, which will ultimately filter through to consumers”.\n\nRead the latest updates below.",
        "summary": "European wholesale gas prices rose to 53 euros per megawatt hour (MwH) -compared with 35 euros at the start of September. Fears that an escalating Israeli-Hamas conflict could see furtherrises. There are also concerns that a rupture in the 45-mile-long Baltic Sea gas pipeline from Finland to Estonia was due to sabotage.",
        "source": "The Telegraph",
        "sentiment": -0.9435300519689918,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-01-19",
        "title": "Bernie Ecclestone thinks Max Verstappen would be champion with a different single-seater",
        "link": "https://www.motorsinside.com/en/f1/news/32808-bernie-ecclestone-thinks-max-verstappen-would-be-champion-different-single-seater.html",
        "content": "F1. At the wheel of his Red Bull, Max Verstappen seems increasingly untouchable.\nFor Bernie Ecclestone, however, the Dutchman would be just as victorious at the\nwheel of another competitive single-seater.\n\nWritten by By On 19/01, 16:39, archivé\n\n\n\n© Red Bull / Over the last three seasons, Max Verstappen's number of victories\nhas risen steadily.\n\n\n\nThe greatest Formula 1 drivers win with the best cars, and the best drivers are\nable to make the strongest cars perform. This is what Max Verstappen\ndemonstrated in 2023.\n\nThe Dutchman won 19 out of the 22 races of the season and stood on the podium 21\ntimes. Only Singapore and the Sprint race in Qatar eluded Red Bull and the\ntriple world champion.\n\nThis season of ultra domination is added to 2021, where the Dutchman won his\nfirst world title in an intense battle, until the last Grand Prix of the season,\nagainst Lewis Hamilton. Verstappen had won 11 races that year. The following\nyear, he broke the record of 13 wins in a season, held by Sebastian Vettel and\nMichael Schumacher.\n\n\nMAX IS CURRENTLY THE BENCHMARK IN ALL FIELDS.\n\nDutch driver is now the third most successful driver in Formula 1 with 54 Grand\nPrix wins, surpassing Vettel and his 53 victories. Only Lewis Hamilton with his\n103 first places and Michael Schumacher with 91 wins are ahead.\n\nFor Bernie Ecclestone, the Red Bull driver has reached such a level of\nperformance that he would be capable of winning with another team aiming for\nvictories. They have patiently endured Mercedes' domination, replacing every\nweak link one by one, developing the best team, the best design, the best car,\nand the best driver, Bernie Ecclestone praises in an interview with the German\nnewspaper Bild.\n\nMax is currently the benchmark in all areas. You could also put him in a\nMcLaren, and probably a Ferrari or a Mercedes, and he would still win, claims\nthe former head of FOM.",
        "summary": "Max Verstappen is now the third most successful driver in Formula 1 with 54 Grand Prix wins. Only Lewis Hamilton with103 first places and Michael Schumacher with 91 wins are ahead. For Bernie Ecclestone, the Red Bull driver has reached such a level ofperformance that he would be capable of winning with another team.",
        "source": "Motors Inside",
        "sentiment": 0.1563938669860363,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-05-08",
        "title": "Formula 1 revenue races to new record",
        "link": "http://www.raconteur.net/business-of-f1-2016/formula-1-revenue-races-to-new-record",
        "content": "Formula 1 seems to thrive on controversy. Just weeks before the start of the\n2016 season it was unclear what format qualifying would take and new regulations\nfor 2017 were being tested in the face of complaints from competitors.\n\nBut whatever happens on the track, the sport’s parent company is heading in the\nright direction of profit – not loss.\n\n\nA STABLE OUTLOOK\n\nThe latest accounts available, for the year ending December 31, 2014, show F1’s\nparent, Jersey-based company Delta Topco, made operating profits of $519.8\nmillion on revenue which accelerated 3.2 per cent to a record $1.8 billion.\nThere are several tricks under its bonnet which have fuelled this growth despite\na stagnating economy.\n\nF1 doesn’t own any tracks or teams so its costs are kept under tight control.\nThe company only has around 352 staff and its biggest single cost is a payment\nof 63 per cent of its gross profits to the teams as prize money. Over the five\nyears to 2014 the prize money payment rose by 31 per cent to $863.1 million due\nto a boom in interest in F1. It is a staggering sum, but as it is a profit\nshare, it mitigates risk for Topco. That’s not all.\n\n\n\nOnly 10 to 20 per cent of Topco’s contracts need to be renewed annually as they\nhave an average length of around five years. To insulate against inflation, the\nkey contracts also contain an escalator clause which increases the amount paid\nby 10 per cent annually.\n\nThis makes F1 very different to other sports companies and teams as its\nperformance is not related to the events on track. It gives it a stable outlook\nand has driven Topco’s valuation to $8.6 billion, according to figures from\nminority shareholder Ferrari.\n\nThe Italian motor marque listed on the New York Stock Exchange in October and\nthis led to an increased level of financial disclosure for the company. Its main\ninvolvement in F1 is through its famous racing team which features former\nchampions Sebastian Vettel and Kimi Räikkönen as its drivers.\n\nHowever, Ferrari also has options on a 0.25 per cent stake in Topco and has had\nto release a valuation of it under its IPO obligations.\n\n> F1 chief executive Bernie Ecclestone has taken the sport and its 425 million\n> television viewers to emerging markets where it is used to drive tourism\n\nIt shows that between December 31, 2014 and September 30, 2015 the valuation of\nthe options increased 1.7 per cent to $12 million giving Topco an equity value\nof $4.8 billion. The company had around $4 billion of debt last year with at\nleast $200 million in cash in the bank giving a net of $3.8 billion. Added to\nthe equity this gives Topco an enterprise value of around $8.6 billion.\n\nIt surprised many in F1 with one sports writer wrongly suggesting the value is\ninflated and claiming that “the price is clearly too high”. This overlooked the\nfact it is based on an independent valuation from Ferrari, which is required by\nthe stock exchange, so it is far from inflated.\n\n\nBOOSTING REVENUE\n\nF1’s fortunes have actually been boosted by a steady stream of new races. Russia\nand Austria joined in 2014, while Mexico returned after a 23-year break in 2015\nand Azerbaijan is the new entry for 2016.\n\nIt is part of a savvy strategy from F1 chief executive Bernie Ecclestone who has\ntaken the sport and its 425 million television viewers to emerging markets where\nit is used to drive tourism. The limited number of slots on the F1 calendar has\nfuelled a bidding war in the amount countries are prepared to spend to get a\nrace with the highest hosting fees rising to more than $60 million annually.\n\nTogether, fees from race hosting and broadcasting amount to $1.2 billion of F1’s\ntotal revenue with a further $161 million coming from TV production, as well as\ntravel and freight services to the sport’s ten teams.\n\nRevenue from the sale of tickets to F1’s corporate hospitality outfit the\nPaddock Club grew 4.9 per cent to $110.9 million last year. It attracts some of\nthe world’s wealthiest high rollers with recent guests including Michael\nDouglas, film-maker George Lucas and Mexican billionaire Carlos Slim.\n\nGrowth last year was driven by increased corporate demand at the new races. The\nRussian Grand Prix was particularly well attended with President Vladimir Putin\nwatching the race.\n\nCorporate hospitality revenue increased by $5.2 million to $89.2 million. F1’s\nchief financial officer Duncan Llowarch says it was “largely driven by the\neffect of 2014’s calendar changes, with results from new races in Austria and\nRussia outperforming results from non-recurring prior-year events in Korea\nand India”.\n\nAdvertising and sponsorship received a similar boost. F1’s portfolio of partners\nincludes luxury watchmaker Rolex and the Emirates airline which get benefits\nsuch as hoardings at the tracks and the right to use the sport’s logo in\nadvertisements. Although F1 lost technology partner LG last year, it more than\nmade up for it, according to Mr Llowarch.\n\n“While the prevailing economic conditions continued to result in a difficult\nenvironment for advertising and sponsorship sales during 2014, the company was\nsuccessful in renewing one significant contract on improved terms which, along\nwith annual uplifts in other contracts and the sale of a small number of\nadditional advertising packages, more than offset the loss of one material\nadvertising partner. These arrangements allowed the company to report\nadvertising and sponsorship revenue of $254.4 million in 2014, which was $13\nmillion (5 per cent) higher than the prior year,” he says.\n\nThe power under F1’s bonnet has boosted its revenue by around 80 per cent over\nthe past decade and, with long-term contracts in place, there is no suggestion\nit is slowing down. No doubt the naysayers won’t slow down either, but they’re\nunlikely to cause F1 to crash.",
        "summary": "F1’s parent company Delta Topco made operating profits of $519.8 million. Revenue accelerated 3.2 per cent to a record $1.8 billion. The company only has around 352 staff and its biggest single cost is a payment of 63 per cent of its gross profits to the teams.",
        "source": "Raconteur",
        "sentiment": 0.7826199606060982,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-04-30",
        "title": "Bernie Ecclestone takes aim at 'selfish' Lewis Hamilton over 'strange' Ferrari move",
        "link": "https://www.planetf1.com/news/bernie-ecclestone-lewis-hamilton-ferrari-f1-2025",
        "content": "Former Formula 1 supremo Bernie Ecclestone has taken aim at Lewis Hamilton over\nhis “strange” F1 2025 switch to Ferrari, arguing the outgoing Mercedes driver is\n“too much of a handful.”\n\nHamilton rocked the F1 world in February by announcing that he will join Ferrari\non a multi-year contract from F1 2025, ending his long and successful alliance\nwith Mercedes.\n\n\nLEWIS HAMILTON CRITICISED OVER FERRARI F1 2025 MOVE\n\nHis announcement came just five months after Hamilton had signed a new two-year\ncontract to remain with Mercedes until the end of 2025, with the 39-year-old\nactivating a break clause before the first season of his new deal had even\nstarted.\n\nIt has resulted in the unusual situation of Hamilton spending the entire F1 2024\ncampaign with the team in the knowledge that they will part ways at the end of\nthe year, with team boss Toto Wolff left with a frantic search for a new\nteam-mate to George Russell.\n\nCarlos Sainz, the driver whom Hamilton will replace at Ferrari, as well as\nreigning World Champion Max Verstappen and Mercedes’ 17-year-old sensation\nAndrea Kimi Antonelli have all been linked with the vacant seat.\n\n\nPLANETF1.COM RECOMMENDS\n\nFollow PlanetF1.com’s WhatsApp channel for all the F1 breaking news!\n\nLewis Hamilton now finally has a chance to escape the ghosts of Abu Dhabi 2021\n\nEcclestone, who ran the Brabham team with distinction before becoming F1’s\noverlord, was left bemused by the bombshell – and saw it as proof that the\nrelationship between Hamilton and Wolff is not as close as it seemed.\n\nHe told RacingNews365: “It was a strange, strange move to make.\n\n“Toto has relied on him an awful lot more and they’ve become close for selfish\nreasons – both of them.\n\n“I don’t think there was ever a sort of a relationship where you could rely on\nboth parties. There obviously wasn’t because that’s why he suddenly decided to\nleave.\n\n“Big surprise in as far as I didn’t understand why he did it, given the year’s\nnotice basically.\n\n“Why didn’t he wait [to announce it] until later on during the season?\n\n“People thought [Ferrari had] done a clever deal in taking him, but I think it’s\na bit of an ego thing that he got latched into it all.”\n\nEcclestone insisted he would not have signed Hamilton, claiming Wolff and\nMercedes had allowed him to exert too much power within the team.\n\n“Too much of a handful – an unnecessary handful,” he said. “He really sort of\ncommands a little at Mercedes.\n\n“Toto has let him be like that, to keep him on board and keep him happy.\n\n“But I never had that with the drivers. They’re still good, good friends of mine\n– genuine friends, not for finance or whatever. Good friends.\n\n“I’d rather have that sort of relationship rather than the fact I jump when\nsomebody says jump, or defend a situation. If I wanted to do something, I’d do\nit if I thought it was the right thing to do.”\n\nHamilton’s switch to Ferrari will see him reunited with team principal Fred\nVassuer, who oversaw his title-winning GP2 (now F2) season back in 2006, with\nthe veteran also known to be on friendly terms with Ferrari chairman John\nElkann.\n\nAlmost a year after reports first emerged that Elkann had offered Hamilton a\nbig-money offer of £40million to leave Mercedes, Ecclestone feels the Ferrari\nchairman’s pursuit of the star was driven by ego.\n\nHe added: “Fred knew him from their early days and I think John Elkann at\nFerrari, from his point of view, it was a bit of an ego thing that he’s managed\nto capture one of the leading Formula 1 drivers – the best Formula 1 driver, in\nmany people’s opinion.\n\n“These things happen. Just a whole set of circumstances that come together.”\n\nRead more: Max Verstappen to Mercedes? The arguments for and against shock Red\nBull exit",
        "summary": "Former Formula 1 supremo takes aim at Hamilton over'strange' switch to Ferrari. Ecclestone claims Hamilton is 'too much of a handful' at Mercedes. Hamilton will join Ferrari on a multi-year contract from F1 2025. He will spend the entire F1 2024 campaign with the team.",
        "source": "PlanetF1",
        "sentiment": -0.2248469516634941,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-05-02",
        "title": "Meet The New Billionaires From Petco, Breitling Owner CVC",
        "link": "https://www.forbes.com/sites/giacomotognini/2024/04/26/meet-the-cvc-capital-partners-cofounders-set-to-become-billionaires/",
        "content": "Donald Mackenzie (right) attending qualifying for the 2015 Formula One Austrian\nGrand Prix with former Formula One CEO Bernie Ecclestone (left).\n\nGetty Images\n\nIn the latest public offering amid a boom in European IPOs, private equity firm\nCVC Capital Partners went public on the Euronext Amsterdam on Friday at a price\nof $15 (€14) per share, valuing the company at $15 billion. The firm’s shares\nquickly rose, trading at nearly $19 as of 8 am Eastern time. The deal also\nminted two new billionaires, cofounders Donald Mackenzie and Rolly van Rappard.\n\nMackenzie's 6% stake is currently worth more than $1 billion. Mackenzie, who\nstepped down as co-chair of the firm on February 13 and remained on the board as\nhonorary co-chair in a non-executive capacity until the IPO, also sold a chunk\nof shares worth $180 million (pretax). That could grow by another $27 million\n(at the IPO price) if the company exercises its over-allotment option within 30\ndays. Since CVC is based in the British crown dependency of Jersey, he likely\nwon’t have to pay any capital gains tax on those sales. Combined with his\nreported ownership of the 171-foot superyacht Grace, worth an estimated $23\nmillion according to VesselsValue, plus a Georgian estate on 866 acres in\nEngland’s Dorset and a mansion west of London, Forbes estimates the\nScottish-born Mackenzie, 67, is worth $1.3 billion.\n\nVan Rappard, the 63-year-old managing partner and remaining co-chair, on the\nother hand, didn’t sell any of his shares. His 6.7% stake is worth $1.3 billion.\nLike Mackenzie, he also owns a yacht, the 184-foot Blue II, worth an estimated\n$32 million per VesselsValue. He owns 50% of the ship, with the other half held\nby fellow CVC cofounder Steve Koltes through his Jersey-based family office\nKaltroco. The yacht can also navigate through sea ice in polar regions and\nfeatures a sauna, steam room and turkish bath.\n\nBorn in the Caribbean island of Curaçao, the Dutch businessman—whose full name\nis Louis Rodolph Jules Ridder van Rappard—lives in London. His Luxembourg-based\nfamily office, Steflot, held $224 million in net book value as of its latest\nfiling in December 2022, including investment firm Imker Capital. Altogether,\nForbes estimates Van Rappard is worth at least $1.5 billion. Representatives for\nCVC declined to comment on the valuation.\n\nBefore the IPO, CVC also paid out a $327 million (pretax) dividend to its\nshareholders—a payout that translates to roughly $23 million each for Mackenzie\nand Rappard and $14 million for Koltes.\n\nCVC was established in 1981 as the European operations of Citicorp Venture\nCapital, the VC arm of Citigroup. In 1993, Mackenzie, van Rappard, Koltes and\nfive other cofounders (all of whom have since left the company) acquired the\nbusiness and spun it out as CVC Capital Partners, going on to raise their first\n$630 million fund in 1996 and shifting their focus to private equity. CVC now\nhas $198 billion in assets under management with offices in 29 cities across six\ncontinents. It’s best known for investments in sports, from its $2 billion\nleveraged buyout of the Formula 1 racing series in 2006—which it sold to\npublicly traded Liberty Media for $8 billion (enterprise value) in 2016—to its\n$2.1 billion deal with Spanish soccer league La Liga in 2021 for an 8.25% cut of\nTV rights over the next 50 years.\n\nCVC's holdings include pet food retailer Petco, which it bought alongside a\nCanadian pension fund for $4.6 billion in 2015; online university platform\nMultiversity, which it bought from Italian billionaire Danilo Iervolino in 2021;\nSwiss luxury watchmaker Breitling; plus other high-profile sports investments\nincluding the Women’s Tennis Association and Indian Premier League cricket team\nGujarat Titans.\n\n“When we founded CVC in the early 90s it was our ambition to create a\nmulti-generational business that would continue to flourish long after the\nfounders had gone,” Mackenzie said in a statement announcing his departure in\nFebruary. “I believe we have achieved that. The business is in very good shape\nand in good hands.”\n\nIn 2023, CVC reported $1.2 billion in revenue, largely made up of $976 million\nin management fees, and EBITDA (earnings before interest, taxes, depreciation\nand amortization) of $692 million. While that was a 3.5% increase from 2022,\nit’s a lot smaller than asset management behemoths such as BlackRock and\nBlackstone, or even European peers like Swedish private equity firm EQT—all of\nwhich have annual revenues of at least $6 billion.\n\n\"They have a multi-pronged approach. They do private credit, providing credit\nopportunities for companies where they don't necessarily want to take loans from\nbanks. They also have pretty big infrastructure opportunities that they're\nworking on,\" says Dean Kim, head of equity research at brokerage William O'Neil.\n\nInfrastructure is a growing asset class for private equity, with BlackRock\nannouncing a $12.5 billion deal to acquire infrastructure-focused Global\nInfrastructure Partners in January. Last September, CVC bought a 60% stake in\nDutch infrastructure investment outfit DIF Capital Partners for an undisclosed\namount.\n\nCVC’s IPO could be dampened by heightened tensions in the Middle East and market\npessimism about interest rate cuts in the U.S., which has dragged down the stock\nprices of BlackRock and Blackstone by 8% and 4%, respectively, over the past\nmonth. But in Europe, where the European Central Bank is expected to cut rates\nsoon, there could be stronger growth for asset managers like CVC.\n\n“European asset managers should do well in the long term because the ECB is on\nits way to cut rates,” adds Kim. “And when that happens, asset gathering becomes\neasier, there's more liquidity in the market. Money has to go somewhere it can\ngenerate returns.\"\n\nThe largest shareholder in CVC is publicly traded private equity firm Blue Owl\nCapital, which bought a 10% stake in several CVC subsidiaries for about $1.1\nbillion in November 2021, falling to 8.1% before the IPO. The firm, which has\nminted two billionaires—Doug Ostrover and Michael Rees—since going public itself\nin 2021, then bought more shares in the public offering for roughly $211\nmillion, giving it a 9.4% stake after the transaction worth $1.8 billion.\n\nWhile not as wealthy as Mackenzie and van Rappard, Koltes—the only other\ncofounder who still has a role at CVC—also saw a significant boost to his net\nworth. His 4.2% stake is worth some $760 million, plus roughly $41 million\n(pretax) from share sales, which could grow to $47 million with the\nover-allotment. The 68-year-old American stepped down as CVC’s co-chair in\nJanuary 2022 and served as honorary co-chair alongside Mackenzie in a\nnon-executive role until the IPO. His family office, Kaltroco, has also invested\nin Mediterranean fast-casual restaurant chain Taim, auto industry M&A advisory\nfirm Dave Cantin Group and German VC firm 468 Capital. Forbes estimates Koltes\nis worth more than $800 million.\n\n“CVC outgrew a dependence on any single individual or group of individuals long\nago. The firm attracts, motivates and energizes a collection of talent second to\nnone. For everything I can do well, there are dozens in the firm who can do it\nbetter,” Koltes said in a statement when he stepped down in January 2022.\n\nTwo longtime CVC executives, Rob Lucas and Javier de Jaime Guijarro, kept all of\ntheir shares in the firm after the IPO. Their stakes are worth about $660\nmillion and $650 million, respectively.",
        "summary": "Private equity firm CVC Capital Partners went public on the Euronext Amsterdam on Friday at a price of $15 (€14) per share. The firm’s shares quickly rose, trading at nearly $19 as of 8 am Eastern time. The deal alsominted two new billionaires, cofounders Donald Mackenzie and Rolly van Rappard.",
        "source": "Forbes",
        "sentiment": 0.31010281667113304,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-01-26",
        "title": "Electric car maker slashes hundreds of jobs",
        "link": "https://www.telegraph.co.uk/business/2024/01/26/ftse-100-markets-news-latest-lvmh-bernard-arnault-us-pce/",
        "content": "Thanks for joining me. The world’s richest man, Bernard Arnault, has appointed\nhis sons to the board of LVMH as it revealed increasing sales.\n\nAlexandre and Frederic will be named to the company’s board, where they will\njoin two of their siblings, in a scene reminiscent of the HBO drama Succession.\n\n\n5 THINGS TO START YOUR DAY \n\n1) FTSE bosses fear falling prey to foreign takeovers | City leaders say their\nundervalued companies are at a greater risk from overseas buyers\n\n2) UAE stake in Vodafone is a threat to Britain, ministers find | Telecoms\noperator at risk of ‘material influence’ by the Gulf state, Government says\n\n3) John Lewis plans to accelerate job cuts after slashing redundancy payouts |\nStaff lash out at changes, calling them a ‘loud and clear’ signal of\nredundancies\n\n4) Christine Lagarde hits back at ‘irrelevant’ criticism of leadership |\nEuropean Central Bank president rejects talk of widespread unhappiness among\nstaff\n\n5) Ambrose Evans-Pritchard: China’s economy looks more unstable than ever | The\ncountry is in even worse trouble now than it was 16 years ago\n\n\nWHAT HAPPENED OVERNIGHT \n\nA post-Brexit trade deal between Britain and Canada has collapsed after\nnegotiations lasting more than two years were halted by a row over meat and\ncheese exports.\n\nAsian shares were mostly lower despite upbeat news on the US economy, with\nJapan’s benchmark falling after the latest data showed inflation has been\nslowing faster than expected.\n\nTokyo stocks closed lower after rallying to near 34-year highs as losses of\nchip-linked shares weighed on the market.\n\nThe benchmark Nikkei 225 index lost 1.3pc, or 485.40 points, to end at\n35,751.07, while the broader Topix index fell 1.4pc, or 34.27 points, to\n2,497.65.\n\nWeaker price increases relieve pressure on the Bank of Japan to tighten its\nultra-lax monetary policy, which has pumped massive amounts of cash into\nmarkets. The central bank is targeting 2% inflation.\n\nChinese markets ended a winning streak following a spate of moves by the\ngovernment to shore up share prices and the property sector.\n\nHong Kong’s Hang Seng slipped 1pc to 16,052.41, while the Shanghai Composite\nlost 0.4pc to 2,895.14.\n\nSouth Korea’s Kospi jumped 1pc to 2,493.73. Trading was closed in Australia for\na national holiday.\n\nGlobal shares rose on Thursday. In the US, the S&P 500 achieved its fifth\nconsecutive record high closing. Wall Street investors were showing some relief\nthat the American economy was holding up better than hoped. Peter Cardillo,\nchief market economist at Spartan Capital Securities in New York, said the\nnumbers “bode well for a soft landing.”\n\nThe S&P 500 gained 0.53pc, reaching 4,894.16, while the Dow Jones Industrial\nAverage of 30 leading American companies rose 0.64pc to 38,049.13. The Nasdaq\nComposite index gained 0.18pc to 15,510.50.\n\nUS Treasury yields fell as investors bid up prices after the data showing\nfaster-than-expected economic growth, along with an inflation pace on track to\nmeet the Fed’s 2pc target.\n\nThe yield on benchmark 10-year US Treasury bonds fell to 4.128pc compared with\nits close of 4.178pc on Wednesday.",
        "summary": "The world’s richest man, Bernard Arnault, has appointed his sons to the board of LVMH as it revealed increasing sales. Tokyo stocks closed lower after rallying to near 34-year highs as losses of chip-linked shares weighed on the market.",
        "source": "The Telegraph",
        "sentiment": -0.940382331609726,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-03-20",
        "title": "Bernie Ecclestone: Formula E “level” with Formula 1",
        "link": "https://www.fiaformulae.com/es-mx/news/492672",
        "content": "ENTREVISTA 20 Mar 2024 2 Min\n\nFormer Chief Executive of the Formula 1 Group, Bernie Ecclestone, paid his first\nvisit to the ABB FIA Formula E World Championship paddock in São Paulo last\nweekend.\n\n“It’s the first race I've been to and it looks super, super, super,” Ecclestone\nstated on the starting grid for the second edition of the Brazilian race. “It’s\ngood for São Paulo, it’s good for the whole region. It gets a lot of people\ninterested in different things, because they come to see this and it follows\nthem.”\n\nFormula E is currently in its 10th season, and has achieved many huge milestones\nwithin that time. As well as becoming an official FIA World Championship in\n2020, it has welcomed the biggest names in manufacturing and motorsport, as well\nas being consistently competitive and breaking records whilst doing so.\n\nHISTORY: Looking back through Formula E's key moments\n\nCatching up with drivers such as race-winner Sam Bird (NEOM McLaren) and DS\nPENSKE’s Jean-Eric Vergne, Ecclestone spoke about his first experience of the\nall-electric World Championship.\n\n\n\n“I thought it wouldn’t last. I thought the first race would be the last,”\nEcclestone confessed when talking about the championship’s debut event, the 2014\nBeijing E-Prix which was won by Lucas di Grassi (ABT CUPRA). “So I am very\npleased to see that technically it has become very good. Technically, it’s\nFormula 1 level.”\n\nREPORT: Sam Bird seals NEOM McLaren's first win with last-gasp stunner in São\nPaulo\n\nFour different drivers from four different teams have won the first four races\nof Season 10. The impressive stats don’t stop there either, as nine drivers from\nthe 22-car grid have also stood on the podium in the first four rounds of the\nyear. \n\n\n\n“I think the problem with Formula 1 at the moment is we have got one person that\nis winning all the races,” Ecclestone added. “It’s not good. I hope it doesn’t\nhappen with Formula E, but they can see different countries being represented,\nand winning races.”\n\nJoining Ecclestone, who lives in close proximity to São Paulo was Formula E\nfounder and Chairman Alejandro Agag. \n\n\n\n“We were actually remembering when exactly we met,” Agag said to the Former\nChief Executive of the Formula 1 Group, Ecclestone. “I think it goes back to 25\nyears ago, when we met for the first time in Italy and I was still in my\npolitical times. Since then, Bernie and I have been friends. \n\nCALENDAR: Where will Formula E race in 2024?\n\n“Bernie has always opened the door for me in motorsport. He brought me into\nmotorsports. Then when I went electric, he looked at me and said, ‘be careful\nwith that’, but always supported me. He promised one day he would go to a race,\nnow he is here in Formula E.”",
        "summary": "Formula E is currently in its 10th season, and has achieved many huge milestones within that time. Former Chief Executive of the Formula 1 Group, Bernie Ecclestone, paid his first visit to the ABB FIA Formula E World Championship paddock in São Paulo last weekend.",
        "source": "www.fiaformulae.com",
        "sentiment": 0.12189999595284462,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-03-12",
        "title": "Ex-Ferrari driver sues Formula One, Bernie Ecclestone and FIA over 2008 world champion claims ",
        "link": "https://news.sky.com/story/ex-ferrari-driver-sues-formula-one-bernie-ecclestone-and-fia-over-2008-world-champion-claims-13093173",
        "content": "Felipe Massa has taken legal action against Formula One, racing supremo Bernie\nEcclestone and governing body the FIA.\n\nThe ex-Ferrari driver is chasing recognition as the 2008 world champion,\nalongside a payout of £64m.\n\nThe Brazilian has claimed since last year that he is the \"rightful\" 2008 world\nchampion due to one of the sport's biggest scandals, dubbed \"Crashgate\" by some.\n\nAt the 2008 Singapore Grand Prix, fellow Brazilian Nelson Piquet Jr says he\npurposefully crashed into a wall in an effort to help Renault teammate Fernando\nAlonso - who went onto win the race.\n\nPiquet Jr said he had been ordered to do so by his team, igniting a controversy\nthat saw Renault choose not to contest a charge of race-fixing and the departure\nfrom the team of two senior figures.\n\nThe crash led to a safety car being deployed, during which Ferrari bungled a pit\nstop and Massa tumbled from first place to a 13th-place finish.\n\nAt the end of the season, Massa lost out by a single point to Lewis Hamilton,\nmeaning the incident had a significant impact on the title.\n\n\nMORE ON FORMULA 1\n\n * Ralf Schumacher reveals he is in relationship with a man\n\n * Ayrton Senna's death was predicted to end Formula One, former boss Bernie\n   Ecclestone reveals\n\n * Chinese GP: Live F1 updates from the race on sport's return to Shanghai\n   International Circuit\n\nCrashgate only came to light a year later, and Renault were punished but\nofficials insisted the time that had elapsed meant the results could not be\noverturned.\n\nOn Monday, the 42-year-old, represented by Brazilian law firm Vieira Rezende\nAdvogados, filed the lawsuit.\n\n\n\nImage: The legal actions stems back to a controversial crash in 2008. Pic:\nReuters\n\nIn a statement he said: \"I always said that I would fight until the end. As FIA\nand FOM decided to do nothing, we will seek the correction of this historical\ninjustice through the courts.\n\n\"The matter is now with the lawyers and they are fully authorised to do whatever\nis necessary so that justice is done for the sport.\"\n\nMr Ecclestone, 93, who led F1 for four decades until 2017, said on Monday: \"If\nhe had asked me, I would have said it was the complete right thing to do, to\nsue, and to let an English judge decide what is right and wrong.\n\n\n\nImage: Nelson Piquet Jr's car is lifted by crane after he was ordered to crash.\nPic: AP\n\n\"I cannot say anything about the outcome and what will happen. I have not got a\nclue, I don't think anyone has, but from his point of view, it is better that an\nEnglish judge comes up with a verdict. It will be of more help for him.\"\n\nRead more from Sky News:\nAndrew Tate and his brother detained after arrest warrant issued by UK\nBritish man dies in freak accident at his engagement party\nKate pictured with William after controversy over edited photograph\n\nSpeaking last September, Mr Hamilton, who won his first title in the year of the\ncontroversy, said: \"If that's the direction that Felipe wants to go, that's his\ndecision. I prefer not to focus on the past.\n\n\"Whether it's 15 years ago, two years ago, or three days ago, I'm only\ninterested in the present and my focus is on helping my team this week.\"\n\n\n\nImage: Former F1-chief Bernie Ecclestone arriving at court for a fraud case.\nPic: REUTERS/Belinda Jiao\n\nThe £64m figure comes from the estimate of the alleged financial loss suffered\nfrom missing out on the title, plus interest.\n\nThe sum represented the difference in salary for the remainder of his career and\nmoney from sponsorship and commercial opportunities, as well as a £1.7m bonus he\nwould have received from Ferrari.\n\nFormula One Management (FOM) and the Paris-based International Automobile\nFederation both refused to comment.\n\n\n\nImage: The ex-Ferrari driver has sworn to fight until the end. Pic: Reuters\n\nMassa did not win again after 2008, with the Brazilian suffering a near-fatal\nhead injury at the 2009 Hungarian Grand Prix. He retired in 2017.",
        "summary": "Felipe Massa has taken legal action against Formula One, racing supremo Bernie Ecclestone and governing body the FIA. The ex-Ferrari driver is chasing recognition as the 2008 world champion,alongside a payout of £64m. The Brazilian has claimed since last year that he is the \"rightful\" 2008 world champions due to one of the sport's biggest scandals, dubbed \"Crashgate\"",
        "source": "Sky News",
        "sentiment": -0.5879405215382576,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-05-08",
        "title": "The shareholders keeping F1's wheels turning",
        "link": "http://www.raconteur.net/business-of-f1-2016/the-shareholders-keeping-f1s-wheels-turning",
        "content": "The core revenues of Formula 1’s parent company come from selling the rights to\nhost and broadcast races as well as advertising and corporate hospitality at the\ntracks. In the early days of F1, teams made separate deals with grand prix\npromoters and television coverage was sporadic as it could be cancelled at the\nlast moment if there were not enough cars to fill the grid.\n\nF1 chief executive Bernie Ecclestone, who was then owner of the\nchampionship-winning Brabham team, saw that cash would come from television. In\n1981 he convinced the teams to sign a contract committing them to race. He then\ntook it to TV companies so they could guarantee coverage. His company Formula\nOne Promotions and Administration negotiated the deals and took a share of the\nproceeds with the remainder going to the teams and the governing body the\nFédération Internationale de l’Automobile.\n\nClick here for the full infographic \n\n\nSHOWCASING THE BIG NAMES\n\nWith guaranteed TV exposure, sponsors’ rates increased giving the teams more\nmoney to spend on cutting-edge technology in a bid to win. In turn, this\nattracted the best drivers which made the series even more appealing to\nbroadcasters. Big name car manufacturers, such as Honda, Renault, Porsche and\nLamborghini, became involved through supplying engines to the teams.\n\nFierce rivalries and intense battles for championship supremacy were the norm in\nthe 1980s with Alain Prost, Nigel Mansell and Nelson Piquet all vying for glory\nthroughout the decade. However, it was Brazil’s Ayrton Senna driving for McLaren\nwho got everybody talking. Arguably one of the most iconic images of the era was\nhis controversial clash with team mate Prost in Japan in 1989. It put both\ndrivers off the track and although Senna made it back on to win the race, he was\nlater disqualified for using an escape road to rejoin the circuit, handing the\ntitle to Prost.\n\n\n\nThe Brazilian also dominated the early-1990s, winning consecutive world\nchampionships in 1990, following yet another controversy in Japan with Prost,\nand in 1991 after a dominant season with McLaren.\n\n> With guaranteed TV exposure, sponsors’ rates increased giving the teams more\n> money to spend on cutting-edge technology in a bid to win\n\nBritish hopes too were rewarded at last in 1992 when, after years of frustration\nand retirement threats, Nigel Mansell stormed to championship glory, becoming\nthe first Brit to do so since James Hunt in 1976 and setting the scene for the\nrest of the decade, which was to be largely dominated by his team Williams. A\nnew era beckoned in 1993 as Prost, now also racing for the British marque,\nclaimed his fourth and final title before taking the decision to leave the sport\nbefore the start of the 1994 season.\n\nThings were changing in F1, and with fresh new talent in the form of Michael\nSchumacher and Mika Hakkinen on the horizon, to many it seemed as good as it\ncould get. Then Senna was killed at the San Marino Grand Prix in 1994 after\ncrashing out from the lead and it looked like the sport was facing its darkest\nhour. However, Senna’s death drew the world’s attention to F1 at a time when\nthere was plenty of drama on the track and the sponsors were pumping in\nsignificant financial support.\n\n\nTHE SCHUMACHER YEARS\n\nOver the next few years, television audiences soared, particularly in Germany\nwhere fans were rewarded with their first champion when Schumacher took the 1994\ncrown for his Benetton team.\n\nAnother dominant title for Schumacher followed in 1995 in his final year at\nBenetton before heading to Ferrari. It heralded the beginning of a career that,\nthough often shrouded in controversy, would earn him a place among the legends\nof F1 thanks to a record-breaking total of seven titles.\n\nHis first win at Ferrari came at the 1996 Spanish Grand Prix in poor conditions,\nshowcasing his skill and allowing audiences worldwide a glimpse at his superstar\nstatus. Schumacher went on to finish his first season for Ferrari in third\nposition, behind the seemingly unassailable Williams. He was able to take the\nfight to Williams’ Jacques Villeneuve in 1997, just a single point behind when\nthe championship rolled into Spain for the finale. But a shunt with the Canadian\nput Schumacher out of the race and ultimately he was stripped of all\nchampionship points for causing the collision.\n\n\n\nHe was runner-up in 1998 behind Hakkinen and a broken leg in a crash at\nSilverstone the following year kept him out of the title fight. By 2000,\nSchumacher and Ferrari were back on form and their dominance of the 21st century\nbegan, cementing Schumacher’s position in the history books with five titles\nfrom 2000 to 2004.\n\nAs the on-track action electrified it made F1 even more attractive to TV\nstations and in 2001 Schumacher’s success brought it to the attention of German\nmedia giant Kirch. It borrowed $1.6 billion from three banks to acquire a 75 per\ncent stake in F1. State-owned German bank BayernLB loaned $987.5 million with\nLehman Brothers and J.P. Morgan each providing $300 million.\n\nHowever, Kirch lacked the key to a fortune as the terms of a 1999 bond issue\nprevented F1 from paying a dividend. By the time Kirch collapsed under the\nweight of its debts in 2002, it had not made any money from the sport and, to\nthis day, remains the only shareholder not to have received a return.\n\n\nCVC AND THE FUTURE\n\nThe loans from the trio of banks were secured on the F1 stake and when Kirch\nwent into administration they enforced their security. However, in the vacuum,\nthey lost control of the business. When CVC, the private equity firm, bought the\nbusiness from the banks, it didn’t make the same mistake twice.\n\n> It has given CVC a 351.8 per cent return on investment and its remaining\n> shares are worth another $3 billion\n\nCVC bought F1 in 2006 in a leveraged buyout funded with two loans – $965.6\nmillion from its investment Fund IV and $1.1 billion from the Royal Bank of\nScotland. It covered its back.\n\nBuried in the articles of association of F1’s parent company Delta Topco is the\nrevelation that CVC’s shares entitle it to appoint representatives, known as I\ndirectors, who can “exercise one vote more than the total number of votes\nexercised by the other directors”. The articles add that the purpose of this is\n“to ensure that the I directors will always have sufficient votes to pass a\nresolution of the board”.\n\nThis control puts a huge premium on CVC’s stake and its riches were unlocked\nwith a debt refinancing which allowed dividends to be paid.\n\n\n\nOver the past decade CVC has halved its stake to just under 35 per cent and\nreaped a $4.4-billion reward which comprises 31 per cent of the total generated\nfor F1’s owners. It has given CVC a 351.8 per cent return on investment and its\nremaining shares are worth another $3 billion at the latest valuation of the\nbusiness from $8.6 billion to $10 billion.\n\nTo put this in context, CVC had made 314 per cent on its €184 million investment\nin British bookmaker William Hill by the time it exited through share sales and\nan IPO in 2002. Likewise, the £30 million CVC invested in stockbroker Collins\nStewart generated a return of 292 per cent from share sales and a 2002 IPO. Its\nbiggest return is believed to have been from the 2005 sale of Spanish hospital\noperator IDC which came to 831 per cent. F1 may overtake it if CVC actually\nsells up.\n\nAccording to CVC’s co-chairman Donald Mackenzie, there is no need to do this.\n“There is no end date. We have 12-year funds, which we have to return the\noriginal money. We have already done that. So the pressure’s off. We like owning\nit [F1]; we don’t want to sell it. There are always some people who’d like to\nbuy it – it’s a very good business.”\n\n\nKEEPING F1’S WHEELS TURNING\n\n\n\nIt may seem like the biggest decisions in Formula 1 are made on the track, but\nin fact the most powerful people in the sport are found behind the scenes.\n\nF1’s nerve centre is the paddock, an oblong tarmac space between the teams’\nmobile offices and their transporters which back up to the pit garage rear\ndoors. The area was historically a working environment for team staff, but F1\nchief executive Bernie Ecclestone has made it one of the most sought-after\nplaces to be in world sport.\n\nThe motorhomes are where team bosses discuss race strategy, and drivers eat,\ndrink and wind down. They are essentially the drivers’ locker rooms and passes\nto the paddock cannot be bought. In itself this adds to the allure and\nexclusivity of the paddock, but that’s just the start. As interest in F1\naccelerated so too did the desire for celebrities and VIPs to be seen at the\nraces, and the paddock is the place to find them.\n\nIt shouldn’t be confused with the Paddock Club which is where corporate guests\nnetwork and fuel F1’s multi-million-dollar budgets. Teams give passes to their\nsponsors who, in turn, invite clients to do business and close deals in the\nPaddock Club. Potential sponsors are also invited by the teams so that they can\nget an inside look at what is on offer from a partnership. It keeps F1’s\nwheels turning.\n\nThe Paddock Club is managed by Austrian catering firm Do&Co, which has an army\nof staff to make the venue work. Hundreds of staff are involved at each race\nincluding chefs, catering staff, electricians, security, entertainers, florists,\ntherapists and cleaners.\n\nSecurity, logistics, construction and catering tend to be handled by the same\ncontractors throughout the season meaning that teams and sponsors know what they\nwill get at any race no matter where in the world it is held.",
        "summary": "The core revenues of Formula 1’s parent company come from selling the rights to host and broadcast races as well as advertising and corporate hospitality at the tracks. In the early days of F1, teams made separate deals with grand prixpromoters and television coverage was sporadic. Bernie Ecclestone convinced the teams to sign a contract committing them to race so they could guarantee coverage.",
        "source": "Raconteur",
        "sentiment": 0.08981288969516754,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-02-14",
        "title": "Bernie Ecclestone denies having advised Christian Horner to resign",
        "link": "https://www.motorsinside.com/en/f1/news/33019-bernie-ecclestone-denies-having-advised-christian-horner-resign.html",
        "content": "F1. The Executive Director of Red Bull F1 Team is being investigated for\n\"inappropriate behavior towards an employee\" of the Austrian group. While the\nGerman press had reported that Bernie Ecclestone had advised his friend to leave\nthe team management, the latter denied the information through his Instagram\naccount.\n\nWritten by By On 14/02, 19:41, archivé\n\n\n\n© Red Bull / The investigation into Christian Horner for \"inappropriate behavior\ntowards an employee\" of the Red Bull group is still ongoing.\n\n\n\nFor the past two weeks, Christian Horner has been the subject of an internal\ninvestigation led by Red Bull group due to inappropriate behavior towards an\nemployee, as stated by the executive director of the Austrian team.\n\nThe Briton has denied all the allegations put against him and was heard by the\nRed Bull group on February 9th. The investigation is not yet completed. However,\nHorner will be present during the presentation of the RB-20 on February 15th.\n\n\nBERNIE ECCLESTONE'S DENIAL\n\nSince the opening of this investigation, comments from the world of Formula 1\nhave been scarce. James Volwes, Executive Director of Williams, has preferred to\nstick to the facts until a judgment has been made.\n\nThe German press reported that Bernie Ecclestone, former CEO of FOM and close to\nChristian Horner, allegedly suggested to the fifty-year-old to resign from his\nposition at Red Bull. However, the former \"F1's top money man\" denied this\ninformation through a post on his social media channels.\n\n\"To clarify the newspaper reports that suggest I urged or suggested that\nChristian Horner should resign from his position at Red Bull is completely\nfalse,\" wrote Bernie Ecclestone on his Instagram account.",
        "summary": "The investigation into Christian Horner for \"inappropriate behavior\" of the Red Bull group is still ongoing. The Briton has denied all the allegations put against him. Bernie Ecclestone, former CEO of FOM, allegedly suggested to the fifty-year-old to resign from his position at Red Bull.",
        "source": "Motors Inside",
        "sentiment": -0.8009679848328233,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-06-27",
        "title": "Bernie Ecclestone and wife Fabiana Flosi join family in Ibiza",
        "link": "https://www.dailymail.co.uk/tvshowbiz/article-13576159/Bernie-Ecclestone-wife-Fabiana-Flosi-family-yacht-Ibiza-daughter-Tamaras-birthday.html",
        "content": "Bernie Ecclestone was given a helping hand by his wife Fabiana Flosi on\nWednesday, as they kicked off his daughter Tamara's 40th birthday celebrations\nin Ibiza.\n\nThe Formula One tycoon, 93, was spotted on the beach alongside his wife, 47, and\nseveral family members, including youngest daughter Petra, 35, and her husband\nSam Palmer, 39.\n\nThe clan headed down to a dinghy waiting at the shore to speed them over to a\nluxury yacht out in the Mediterranean.\n\nBernie put on a loved-up display with Fabiana - who is 46 years his junior - as\nthey couple linked arms on the walk down.\n\nThey coordinated their outfits for the boat ride, with both wearing all-blue\nensembles in the summer sunshine.\n\nBernie Ecclestone was given a helping hand by his wife Fabiana Flosi on\nWednesday, as they kicked off his daughter Tamara's 40th birthday celebrations\nin Ibiza \n\nThe Formula One tycoon, 93, was spotted on the beach alongside his wife, 47, and\nseveral family members, including youngest daughter Petra, 35, and her husband\nSam Palmer, 39\n\nThe clan headed down to a dinghy waiting at the shore to speed them over to a\nluxury yacht out in the Mediterranean\n\nThe billionaire looked casual in a button-up shirt and jeans, adding grey\ntrainers and a pair of purple tinted shades.\n\nWhile Fabiana showed off her long legs in a pair of sky blue floral shorts with\na matching linen shirt and fluffy handbag.\n\nThe Brazilian also sported white sandals and designer sunglasses as she guided\nher husband towards the dinghy.\n\nAs Bernie climbed on, his doting spouse held tightly onto his arm to help keep\nhis balance, and braced herself on the boat to help another man to support the\nbusinessman's weight.\n\nFabiana and Bernie met in 2009 at the World Motor Sport Council, with her\nworking as the vice-president of marketing for the Brazilian Grand Prix. \n\nThey then tied the knot in 2012 at his chalet, Le Lion, in the exclusive resort\nof Gstaad, Switzerland.\n\nTheir nuptials came just three years after Bernie divorced his second wife\nSlavica Radić, who is the mother of his daughters Tamara and Petra. \n\nThe couple went on to welcome son Ace, three, in July 2020, making Bernie one of\nthe world's oldest known fathers at 89 years old. \n\nBernie put on a loved-up display with Fabiana - who is 46 years his junior - as\nthey couple linked arms on the walk down, wearing coordinating all-blue\nensembles\n\nThey coordinated their outfits for the boat ride, with both wearing all-blue\nensembles in the summer sunshine\n\nThe billionaire looked casual in a button-up shirt and jeans, adding grey\ntrainers and a pair of purple tinted shades\n\nWhile Fabiana showed off her long legs in a pair of sky blue floral shorts with\na matching linen shirt and fluffy handbag\n\nThe Brazilian also sported white sandals and designer sunglasses as she guided\nher husband towards the dinghy\n\nAs Bernie climbed on, his doting spouse held tightly onto his arm to help keep\nhis balance, and braced herself on the boat to help another man to support the\nbusinessman's weight\n\nWhen they announced the pregnancy, Bernie said: 'Yes, it is due in the summer.\nHopefully he’ll learn to play backgammon soon!'\n\nWhile Fabiana added: 'Like all parents we have only one wish: the child must be\nborn healthy. Hopefully he will never express any interest in doing something in\nFormula 1!'\n\nBernie previously hit back at claims he was too old to become a father after\nAce's birth, saying he wants even more children. \n\nHe told The Sun on Sunday: 'Now I have more time on my hands and I hope I can\nspend it with my son as he grows up. I don't know if we will stop here. Perhaps\nhe should have a little brother or sister.\n\nHe added that he had told Fabiana he wanted kids when they first met, saying:\n'Fabiana said she wanted a ­family, and I told her, \"That's no problem for me.\nHalf a dozen kids is great\".'\n\nBernie is also father to daughter Deborah, 69, who he welcomed with his first\nwife Ivy Bambford.\n\nHe is also grandfather to Tamara's two daughters Sophia and Serena and Petra's\ndaughters Lavinia and Minnie and twin boys James and Andrew.\n\nFabiana and Bernie met in 2009 at the World Motor Sport Council, with her\nworking in marketing for the Brazilian Grand Prix before tying the knot in 2012\n(pictured in 2012)\n\nTheir nuptials came just three years after Bernie divorced his second wife\nSlavica Radić, who is the mother of his daughters Tamara and Petra (pictured\nwith Petra, Slavica and Tamara)\n\nThe couple went on to welcome son Ace, three, in July 2020, making Bernie one of\nthe world's oldest known fathers at 89 years old",
        "summary": "Bernie put on a loved-up display with Fabiana - who is 46 years his junior - as they kicked off his daughter Tamara's 40th birthday celebrations in Ibiza. The couple coordinated their outfits for the boat ride, with both wearing all-blueensembles in the summer sunshine.",
        "source": "Daily Mail",
        "sentiment": -0.011647038161754608,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-08-02",
        "title": "Written reply to Parliamentary Questions on former Formula One CEO Bernie Ecclestone's alleged S$650 million trust in a Singapore bank account",
        "link": "https://www.mas.gov.sg/news/parliamentary-replies/2023/written-reply-to-parliamentary-question-on-former-f1-ceo-alleged-trust-in-a-singapore-bank-account",
        "content": "Date: For Parliament Sitting on 2 August 2023\n\nNames and Constituencies of Members of Parliament\n\nMr Chua Kheng Wee Louis, Sengkang GRC\n\nMs He Ting Ru, Sengkang GRC\n\nQuestions:\n\nMs Chua Kheng Wee Louis: To ask the Prime Minister in relation to the UK trial\nof Bernie Ecclestone that allegedly involves undisclosed assets of USD 650\nmillion in a Singapore bank, whether MAS is satisfied with the anti-money\nlaundering precautions that have been put in place at the bank.\n\nMs He Ting Ru: To ask the Prime Minister (a) whether the Government has received\nany requests from the UK law enforcement agencies regarding the case involving\nformer Formula One CEO and Chairman Emeritus Bernie Ecclestone's alleged failure\nto declare to the UK government a trust in Singapore of about S$650 million in a\nbank account; and (b) if yes, what assistance has been provided.\n\nAnswer by Mr Lawrence Wong, Deputy Prime Minister and Minister for Finance, and\nChairman of MAS:\n\n1. Ms He asked if the Singapore Government has received any requests from UK law\nenforcement agencies in relation to the case involving former Formula 1 boss\nBernie Ecclestone. It is our policy, in line with international practice, not to\ncomment on whether a foreign government has made a request for legal assistance\non specific cases.\n\n2. That said, we can confirm that the Monetary Authority of Singapore (MAS),\nSingapore Police Force (SPF) and Attorney General’s Chambers (AGC) have worked\nclosely with UK authorities on their investigation and prosecution of Mr\nEcclestone. In fact, Singapore proactively shared relevant information with our\nUK counterparts, which helped them develop their case.\n\n3. In 2017, MAS conducted an inspection of the bank cited in recent media\nreports, to assess its controls for mitigating money laundering and terrorist\nfinancing risks. During the inspection, MAS specifically reviewed the bank’s\nhandling of its relationship with Mr Ecclestone. While MAS found that there was\nroom for improvement in the bank’s anti-money laundering processes, it did not\nfind gaps or weaknesses that were systemic in nature. MAS also noted that when\nadverse news about Mr Ecclestone first surfaced in 2013, the bank promptly\nsubjected the account to enhanced monitoring controls by requiring all\ntransactions to be flagged for scrutiny and approval.\n\n4. MAS will continue to work with financial institutions to ensure that our\nfinancial sector’s defences against financial crime remain robust.\n\n***",
        "summary": "The Prime Minister will answer questions from members of Parliament on 2 August 2023. Ms He asked if the Singapore Government has received any requests from UK law enforcement agencies in relation to the case involving former Formula 1 boss Bernie Ecclestone. Mr Lawrence Wong, Deputy Prime Minister and Minister for Finance, and the Chairman of MAS, answered the questions.",
        "source": "mas.gov.sg",
        "sentiment": 0.29342515394091606,
        "keywords": [],
        "categories": [],
        "image": null
    }
]