[
    {
        "publication_date": "2024-05-06",
        "title": "Blackpink’s Lisa and rumoured boyfriend LVMH scion Frederic Arnault turn heads at event in Miami",
        "link": "https://www.todayonline.com/8days/blackpinks-lisa-and-rumoured-boyfriend-lvmh-scion-frederic-arnault-turn-heads-event-miami-2416926",
        "content": "Up until now, the alleged romance between Blackpink’s Lisa, 27, and LVMH scion\nFrederic Arnault, 28, has never been confirmed save for a few sporadic sightings\nof the pair together.\n\nBut we suspect Lisa and Frederic might have just made their relationship a\nlittle more official by appearing in public together on Friday (May 3) at a Tag\nHeuer event in Miami, Florida.\n\nThough it was simply a group picture that included Tag Heuer CEO Julian Tornare\nand Kith designer, Ronnie Fig, the spotlight was naturally on both Frederic and\nLisa.\n\nA video on X, formerly known as Twitter, also managed to capture the ‘Lalisa’\nsinger laughing and exchanging glances with Frederic after the picture was\ntaken.\n\nFrederic is the second son of LVMH founder, chairman, and CEO Bernard Arnault\nwho overtook Tesla’s Elon Musk last year to become the richest man in the world.\nHe has a reported net worth of US$233bil (S$314.9bil).\n\nLisa and Frederic first got acquainted in 2022 with dating rumours blossoming\nsoon after. This latest sighting seems to signal that the pair aren’t too\nbothered about hiding from prying eyes anymore.\n\nA few days before the event in Miami, the pair was seen on a simple, yet\nromantic date enjoying ice cream as they toured the idyllic grounds of Rodin\nMuseum in Paris.\n\nOnlookers took to Weibo commenting that Lisa and Frederic seemed at ease and\nwere not covering their faces with masks or sunglasses to hide their identities.\n\nThough neither party has made any official statement, Lisa indirectly confirmed\nthe sighting on her socials with a picture of herself at the museum.\n\nPhotos: Sinchew, kpopscoops/X, lalalalisa_m/Instagram",
        "summary": "LVMH scion Frederic Arnault, 28, and Blackpink singer Lisa, 27, were spotted together in Miami on Friday. The pair were at a Tag Heuer event. Frederic is the second son of LVMH founder, chairman, and CEO Bernard Arnault.",
        "source": "todayonline.com",
        "sentiment": -0.020631171762943268,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-06-05",
        "title": "LVMH's Frederic Arnault named managing director of family holding Financiere Agache",
        "link": "https://www.marketscreener.com/quote/stock/LVMH-4669/news/LVMH-s-Frederic-Arnault-named-managing-director-of-family-holding-Financiere-Agache-46914104/",
        "content": "PARIS, June 5 (Reuters) - Frederic Arnault, one of LVMH Chairman and CEO Bernard\nArnault's five children and heirs, has been named managing director of the\nfamily holding company Financiere Agache, adding to his roles in the sprawling\nluxury empire.\n\nFrederic Arnault, 29, who is CEO of LVMH watches, replaces Nicolas Bazire, and\nwill also serve on the board of the holding company as a representative of\nAgache, the family company that controls it, the company website showed.\n\nThe appointment was confirmed by a company spokesperson on Wednesday.\n\nAll five of the chairman's children hold top management roles in the luxury\ngroup, the world's largest, with labels Louis Vuitton and Dior.\n\nFrederic Arnault and his older brother Alexandre, 32, were approved in April to\njoin the LVMH board, whose members also include siblings Antoine, 46, and\nDelphine, 49.\n\nBernard Arnault, 75, recently reshuffled the top ranks of management at LVMH,\nbut has shown no signs of stepping back, saying in January that he did not\nintend to leave in the near or medium term.\n\nThe group raised the age limit for his role to 80 two years ago.\n\nFinanciere Agache owns 96% of family holding company Christian Dior, which holds\n42% of LVMH. (Reporting by Mimosa Spencer; Editing by Richard Chang)",
        "summary": "Frederic Arnault, 29, is CEO of LVMH watches, replaces Nicolas Bazire. Arnault will also serve on the board of the holding company as a representative of the family company that controls it. All five of the chairman's children hold top management roles in the luxury group.",
        "source": "marketscreener.com",
        "sentiment": 0.020007140934467316,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-06-06",
        "title": "Bernard Arnault names son Frédéric as head of LVMH family holding group",
        "link": "https://www.ft.com/content/21bdde5f-bb00-4305-9707-5d2d3e411fcf",
        "content": "Subscribe to unlock this article\n\n\nTRY UNLIMITED ACCESS\nONLY HK$10 FOR 4 WEEKS\n\n\n\nThen HK$565 per month.\nComplete digital access to quality FT journalism on any device. Cancel anytime\nduring your trial.\n\n\nEXPLORE MORE OFFERS.\n\n\n\n\nSTANDARD DIGITAL\n\n\nWEEKEND PRINT + STANDARD DIGITAL\n\n\n\nComplete digital access to quality FT journalism with expert analysis from\nindustry leaders. Pay a year upfront and save 20%.\n\n\nSTANDARD DIGITAL\n\n\nWEEKEND PRINT + STANDARD DIGITAL\n\n\n\nFT Weekend newspaper delivered Saturday plus complete digital access.\n\n\nSTANDARD DIGITAL\n\n\nWEEKEND PRINT + STANDARD DIGITAL\n\n\n\nBilled Quarterly at HK$1,499. Complete digital access plus the FT newspaper\ndelivered Monday-Saturday.\n\n\nEXPLORE OUR FULL RANGE OF SUBSCRIPTIONS.\n\n\nWHY THE FT?\n\nSee why over a million readers pay to read the Financial Times.\n\nFind out why",
        "summary": "Billed Quarterly at HK$1,499. Complete digital access plus the FT newspaper delivered Monday-Saturday. Pay a year upfront and save 20%. Pay HK$10 for 4 weeks and then HK$565 per month. Cancel anytime during your trial.",
        "source": "ft.com",
        "sentiment": 0.027632752433419228,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-06-07",
        "title": "LVMH Lines Up Next CFO as Luxury Empire’s Succession Stakes Grow",
        "link": "https://www.livemint.com/news/lvmh-lines-up-next-cfo-as-luxury-empire-s-succession-stakes-grow-11717783269385.html",
        "content": "(Bloomberg) -- LVMH has chosen an eventual successor to its long-time chief\nfinancial officer as billionaire Bernard Arnault prepares a new generation of\nleaders to steer the world’s biggest luxury group.\n\nThe parent company of Louis Vuitton appointed Cecile Cabanis as deputy finance\ndirector, reporting to CFO Jean-Jacques Guiony. A former CFO of French yogurt\nmaker Danone SA, Cabanis is currently deputy chief executive officer of Tikehau\nCapital. \n\nCabanis, who starts on Monday, will join the executive committee, becoming the\nthird woman on the body alongside Delphine Arnault, the eldest child of the\nbillionaire CEO, and Chantal Gaemperle, 61, who’s in charge of human resources.\n\nThe appointment of Cabanis is part of a wider management shake-up. Arnault, 75,\ngot a new deputy when Stephane Bianchi took over that role from Antonio Belloni\nafter April’s annual general meeting.\n\nThe question of succession is of growing interest to observers of the world’s\nlargest purveyor of high-end goods. Arnault’s five children all hold key roles\nwithin the group, and four have been named to the company’s board. They also\nhave oversight and management duties at family holding vehicles.\n\nThis week, the world’s wealthiest person named his son Frederic Arnault, 29, as\nmanaging director of Financiere Agache, one of the holding companies through\nwhich the family controls its stake in LVMH Moët Hennessy Louis Vuitton SE.\n\nTakeover Spree\n\nBernard Arnault, with a fortune of about $215 billion, according to the\nBloomberg Billionaires Index, has said he has no plans to retire. The family\nholds almost half of LVMH’s share capital, with about 64% of the voting rights.\n\nDuring his two decades as CFO, Guiony has helped oversee acquisitions including\nTiffany & Co. — the biggest to date in the luxury industry — Bulgari, Loro Piana\nand Belmond. When Guiony joined from the investment bank Lazard Freres in\nSeptember 2003, initially as deputy CFO, the market capitalization of LVMH was\nabout €26 billion ($28 billion). It’s now €381 billion, making the Paris-based\ngroup Europe’s third-biggest company by market value. \n\nArnault and Guiony also faced some M&A defeats, notably when an attempted\ntakeover in 2010 of Hermes International SCA failed. Guiony will get new,\nas-yet-undisclosed responsibilities at LVMH in due course, the company said. \n\nDuring Guiony’s tenure, the company has capitalized on booming global demand for\nluxury goods, especially in China. More recently, sales have slowed in that key\nmarket, but LVMH has been more resilient than rivals such as Gucci owner Kering\nSA.\n\n(Updates with more context throughout)\n\nMore stories like this are available on bloomberg.com\n\n©2024 Bloomberg L.P.\n\nCatch all the Business News, Market News, Breaking News Events and Latest News\nUpdates on Live Mint. Download The Mint News App to get Daily Market\nUpdates.MoreLess\n\nHomeNewsLVMH Lines Up Next CFO as Luxury Empire’s Succession Stakes Grow",
        "summary": "LVMH has chosen an eventual successor to its long-time chief financial officer. Cecile Cabanis is currently deputy chief executive officer of TikehauCapital. The question of succession is of growing interest to observers of the world’s biggest luxury group.",
        "source": "livemint.com",
        "sentiment": -0.026531517505645752,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-02-19",
        "title": "Innovative Management, Proactive Protection, And Next-Generation Empowerment: The Arnault Family Office Story",
        "link": "https://www.forbes.com/sites/francoisbotha/2023/02/16/innovative-management-proactive-protection-and-next-generation-empowerment-the-arnault-family-office-story/",
        "content": "Arnault is best known for transforming the once nearly defunct LVMH into a\nmulti-billion dollar ... [+] powerhouse. Here with his kids, CEO of Rimowa,\nAlexandre Arnault, Frederic Arnault, Owner of LVMH Luxury Group and Louis\nVuitton's EVP Delphine Arnault.\n\nGetty Images\n\nEdits made to reflect recent role changes by the Arnault family.\n\nIn 2022 Bernard Arnault reclaimed the title of the world's wealthiest individual\nfor the fourth time. The French billionaire is the founder, chairman and CEO of\nthe luxury goods company LVMH, the owner and CEO of Financière Agache SA, Groupe\nArnault (family office) and backer of the venture capital firm Aglaé Ventures.\n\nBernard Arnault is noteworthy due to his extraordinary business acumen and\nremarkable achievements. However, from a family office point of view, his unique\nmanagement style and how he has successfully positioned his family office and\nempowered the next generation to continue the Arnault family legacy sets him\napart from his peers.\n\n\nMANAGEMENT STYLE AS THE DIFFERENTIATOR\n\nArnault is best known for transforming the once nearly defunct LVMH into a\nmulti-billion dollar powerhouse that has become the world's largest luxury goods\nconglomerate, comprising over seventy brands and covering a wide range of\nproduct categories. A mastermind at stirring up desire in the most selective\nconsumers, Arnault's unique ability to harness the creativity that drives growth\nand profit is unprecedented.\n\nWhile many of his peers may seek a more predictable growth path, LVMH is\nrenowned for radical innovation and Arnault for not limiting this process.\nArtists are unfettered by financial and commercial concerns. This, Arnaut\nbelieves, is vital for producing their best work. No inspiration is checked, and\nno spirits are crushed. The seemingly outlandish suddenly makes perfect sense\nand is quickly turned into profit.\n\nArnault believes that with certain techniques, everybody wins – the designer,\nthe company and the customer. These techniques include hiring those who\nunderstand that creativity and chaos often go hand-in-hand and are respectful\nenough of the process to handle it. Yet, when it comes to translating that\ncreativity into products, discipline is the order of the day, and strict rules\nare applied to the planning and manufacturing process. Not many can master\nnavigating these fine lines, which sets Arnault apart in all he does.\n\nMoreover, Arnault's governance principles, including decentralized\ndecision-making centers, are applied to each entity within the LVMH group. This\nensures that each company retains its identity while financing the growth of new\nbrands.\n\n\nPROACTIVELY POSITIONING TO PROTECT THE FAMILY OFFICE\n\nIn 2022 it was announced that Arnault had altered the legal structure of his\nfamily office, Financière Agache SA, to a joint-stock partnership. The intent is\nto protect himself from dangerous takeover bids and ensure enduring family\ncontrol over the LVMH empire.\n\nFinancière Agache SA is managed by a team of professionals and works to ensure\nthe family's interests are served. It is also responsible for strategically\nmanaging the family's investments and ensuring its wealth is used to its full\npotential. It is also the executor of the family's philanthropic activities,\nensuring these are carried out effectively. In his family office, Arnault\ncreated the ideal vehicle for the successful transition of the business to the\nnext generation of the Arnault family.\n\n\nNEXT-GENERATION EMPOWERMENT\n\nBernard Arnault is acutely aware of the vulnerabilities divisions can cause. It\nis these divisions that have awarded him victories in several takeover battles.\nIn a series of calculated moves, Arnault has sought to prevent the same thing\nwithin his own family, laying the foundation upon which his empire will rest far\ninto the future.\n\nWhile Arnault has previously stated that \"Retirement is not a word in my\nvocabulary,\" each of his children is fully equipped and positioned within the\ncompany for when that day finally comes.\n\nArnault's children are all involved in group companies. Antoine is the CEO of\nBerluti, as well as Chairman of Loro Piana and head of image and communications\nat LVMH. Alexandre used to be the CEO of Rimowa, and then became Executive VP of\nProduct and Communications of Tiffany. His daughter, Delphine Arnault, was with\nLouis Vuitton and then became CEO of Christian Dior Couture early 2023. Her\nposition of influence within the group speaks volumes of her ambition and acumen\nin luxury fashion.\n\nArnault's commitment to passing the business on to his family is a testament to\nhis desire for the company to remain a successful and influential leader in the\nluxury goods space. The new joint structure is designed to prevent division and\nputs the family office and concerns in a strong position for the future, where\nit will become even more influential.",
        "summary": "Bernard Arnault is best known for transforming the once nearly defunct LVMH into a multi-billion dollar powerhouse. His unique management style and how he has positioned his family office and empowered the next generation sets him apart from his peers. Arnault believes that with certain techniques, everybody wins – the designer, company and the customer.",
        "source": "Forbes",
        "sentiment": 0.06278633326292038,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-01-26",
        "title": "LVMH posts record profits and 86.2B euros in revenue for 2023",
        "link": "https://www.fashiondive.com/news/LVMH-record-profits-strong-revenues-fiscal-2023/705762/",
        "content": "This audio is auto-generated. Please let us know if you have feedback.\n\n\nDIVE BRIEF:\n\n * LVMH Moët Hennessy Louis Vuitton reported revenue of 86.2 billion euros in\n   2023, or approximately $93.7 billion at current exchange rates, representing\n   a 9% increase from 2022’s revenue of 79.2 billion euros, according to a\n   Thursday press release.\n * The company reported record net profits of 15.2 billion euros, an 8% year\n   over year rise from 14.1 billion euros in 2022. The company’s fashion and\n   leather goods division, which is its largest, saw a 9% year-over-year revenue\n   boost to 42.2 billion euros, and a 7% net profit increase to 16.8 billion\n   euros.\n * Bernard Arnault, chairman and CEO, also moved to deepen his family’s control\n   of the company by nominating two of his children, Alexandre Arnault and\n   Frédéric Arnault, to fill vacant seats on the company’s board of directors,\n   according to a separate press release, which noted that the board will vote\n   on the nominations in April.\n\n\nDIVE INSIGHT:\n\nThe positive earnings report had a ripple effect throughout the luxury industry.\nReuters reported on Friday that the pan-European STOXX 600 index “was up 0.9%,\nhitting its highest level in two years” following LVMH’s results, and the top 10\nEuropean luxury stocks “gained 3.8%, tracking its best day since November 2022.”\n\nLVMH said its fashion and leather goods division, which includes Louis Vuitton,\nChristian Dior, Celine, Fendi, Loro Piana, Loewe and Marc Jacobs, “gained market\nshare worldwide and achieved record levels of revenue and profits.” After\ndeclines in Q2 and Q3, LVMH’s fashion and leather goods division posted Q4 a\nrevenue of 11.3 billion euros, making it the company’s strongest quarter for the\nyear in any division.\n\nThe company touted the success of Louis Vuitton womenswear Nicolas Ghesquière,\nwho “renewed his contract for a further five years.” It also celebrated the July\n2023 Paris debut of Pharrell Williams as creative director of Louis Vuitton\nmenswear, whose show “sparked enthusiasm worldwide,” per the release.\n\n“Our performance in 2023 illustrates the exceptional appeal of our Maisons and\ntheir ability to spark desire, despite a year affected by economic and\ngeopolitical challenges,” Arnault said in the release. “...2023 also saw us make\nprogress in several key areas that are essential components of our long-term\nvision: protecting the environment, developing our talent, and preserving and\npassing on our expertise. While remaining vigilant in the current context, we\nenter 2024 with confidence.”\n\nThe results represented a promising improvement after the market slowdown in Q3,\naccording to Alice Price, associate apparel analyst at data and analytics firm\nGlobalData.\n\n“While this uplift is partly due to more favorable exchange rates…it also\naffirms the desirability of its product offering, as it continues to persuade\nconsumers to make purchases against a backdrop of subdued consumer confidence in\nEurope and the US,” Price said in emailed comments.\n\nShe added that Japan was LVMH’s strongest region in 2023, followed by the rest\nof Asia, “driven by their growing economies and heightened appetite for high end\ngoods since the removal of lockdown restrictions at the end of 2022.” \n\nMeanwhile, Price said Europe’s low-double digit growth was “supported by the\nresurgence of international travel, but slowed significantly throughout the year\nto just 5% in Q4, as inflationary challenges impacted domestic demand.” Sales in\nthe U.S. increased 4%, which Price attributed to low consumer confidence and\naspirational shoppers reigning in their discretionary spending. \n\n“However, US revenue rose by 8% in Q4 versus 2% in the prior quarter, indicating\nhope for its performance in the year ahead,” Price said.\n\nLooking ahead to 2024, Arnault said the company was optimistic about its\nprospects.\n\n“While the geopolitical and macroeconomic environment remains uncertain, LVMH is\nconfident in its ability to continue to grow in 2024, in the highly distinctive\nquality and creativity that its products offer its customers, as well as in the\nprofessionalism of its management, to stand out and gain market share,” Arnault\nsaid. “LVMH will pursue its brand development-focused strategy, underpinned by\ncontinued innovation and investment as well as an extremely exacting quest for\ndesirability and quality in its products and their highly selective\ndistribution.”",
        "summary": "LVMH Moët Hennessy Louis Vuitton reported revenue of 86.2 billion euros in 2023, or approximately $93.7 billion at current exchange rates. Bernard Arnault, chairman and CEO, also moved to deepen his family’s control of the company by nominating two of his children.",
        "source": "Fashion Dive",
        "sentiment": 0.9396357331424952,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-01-26",
        "title": "LVMH annual profit and revenue rise following Sephora success - TheIndustry.beauty",
        "link": "https://theindustry.beauty/lvmh-annual-profit-and-revenue-rise-following-sephora-success/",
        "content": "LVMH has reported a 13% increase in annual revenue to £73 billion (€86 billion),\nboasting an \"exceptional performance\" from beauty giant Sephora.\n\n\n\nAll business groups achieved revenue growth in 2023, with the exception of wines\nand spirits, which was faced with a high basis of comparison.\n\nThe perfumes and cosmetics business saw revenue rise 11% to £6.9 billion (€8.2\nbillion), thanks to the group's \"highly selective retail policy and dynamic\ninnovation strategy\".\n\n\n\nAs part of this, Christian Dior achieved a \"remarkable performance\", extending\nits lead in its key markets. Meanwhile, Givenchy, Benefit Cosmetics and Guerlain\nalso boasted an uplift in sales.\n\nThe selective retailing business reported a 25% increase in revenue to £15\nmillion (€17.8 billion). This was driven by Sephora, which returned to the UK\nwith two new stores last year. The retailer plans to open its third location in\nManchester this summer.\n\nThe fashion and leather goods business also saw revenue increase 14% to £35\nbillion (€42 billion), while the watches and jewellery business recorded revenue\ngrowth of 7% to £9.2 billion (€10.9 billion).\n\nAnnual profit from recurring operations grew 8% to £19 billion (€22.8 billion),\nwhile group share of net profit also rose 8% to £12.9 billion (€15.2 billion).\n\nLooking ahead, in an uncertain economic and geopolitical environment, LVMH said\nit remains \"confident\" in the continuation of its growth.\n\nBernard Arnault, Chairman and CEO of LVMH, said: \"Our performance in 2023\nillustrates the exceptional appeal of our Maisons and their ability to spark\ndesire, despite a year affected by economic and geopolitical challenges.\n\n\"The group once again recorded significant growth in revenue and profits. Our\ngrowth strategy, based on the complementary nature of our businesses, as well as\ntheir geographic diversity, encourages innovation, high-quality design and\nretail excellence, and adds a cultural and historical dimension thanks to the\nheritage of our Maisons.\n\n\"While remaining vigilant in the current context, we enter 2024 with confidence,\nbacked by our highly desirable brands and our agile teams.\"\n\nFollowing the decision by Charles de Croisset, Yves-Thibault de Silguy and\nNicolas Bazire to not stand for re-election as directors, LVMH has also proposed\nthe appointments of Henri de Castries, Alexandre Arnault and Frédéric Arnault\nto its Board of Directors at its next AGM in April 2024.",
        "summary": "All business groups achieved revenue growth in 2023, with the exception of wines and spirits. Christian Dior achieved a \"remarkable performance\", extending its lead in key markets. Givenchy, Benefit Cosmetics and Guerlain also boasted an uplift in sales.",
        "source": "TheIndustry.beauty",
        "sentiment": 0.879945944994688,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-01-26",
        "title": "LVMH shares jump as fears of sharp slowdown in luxury sector ease",
        "link": "https://www.ft.com/content/0594030d-5f0d-4b79-b5c2-ea616cdc03d1",
        "content": "Subscribe to unlock this article\n\n\nTRY UNLIMITED ACCESS\nONLY HK$10 FOR 4 WEEKS\n\n\n\nThen HK$565 per month.\nComplete digital access to quality FT journalism on any device. Cancel anytime\nduring your trial.\n\n\nEXPLORE MORE OFFERS.\n\n\n\n\nSTANDARD DIGITAL\n\n\nWEEKEND PRINT + STANDARD DIGITAL\n\n\n\nComplete digital access to quality FT journalism with expert analysis from\nindustry leaders. Pay a year upfront and save 20%.\n\n\nSTANDARD DIGITAL\n\n\nWEEKEND PRINT + STANDARD DIGITAL\n\n\n\nFT Weekend newspaper delivered Saturday plus complete digital access.\n\n\nSTANDARD DIGITAL\n\n\nWEEKEND PRINT + STANDARD DIGITAL\n\n\n\nBilled Quarterly at HK$1,499. Complete digital access plus the FT newspaper\ndelivered Monday-Saturday.\n\n\nEXPLORE OUR FULL RANGE OF SUBSCRIPTIONS.\n\n\nWHY THE FT?\n\nSee why over a million readers pay to read the Financial Times.\n\nFind out why",
        "summary": "Billed Quarterly at HK$1,499. Complete digital access plus the FT newspaper delivered Monday-Saturday. Pay a year upfront and save 20%. Pay HK$10 for 4 weeks and then HK$565 per month. Cancel anytime during your trial.",
        "source": "Financial Times",
        "sentiment": 0.027632752433419228,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-01-08",
        "title": "Frédéric Arnault Becomes CEO of LVMH Watches - CEOWORLD magazine",
        "link": "https://ceoworld.biz/2024/01/08/frederic-arnault-becomes-ceo-of-lvmh-watches/",
        "content": "Frédéric Arnault has been named the CEO of LVMH Watches, a newly established\nposition overseeing Hublot, Tag Heuer, and Zenith. This move is aimed at driving\nrobust and sustainable growth for the watch Maisons while solidifying LVMH’s\nposition in the watchmaking industry, according to a statement released by the\nluxury conglomerate on Friday. Arnault reports directly to Stéphane Bianchi, CEO\nof LVMH’s watches and jewelry division.\n\nThis appointment marks a substantial expansion of Arnault’s responsibilities.\nThe 29-year-old scion of luxury magnate Bernard Arnault joined Tag Heuer in 2017\nand ascended to the role of CEO in 2020. During his tenure at Tag Heuer, Arnault\nimplemented bold strategies, including forging a strategic long-term partnership\nwith Porsche, streamlining distribution channels, elevating the brand’s\npositioning by introducing high-end products, incorporating lab-grown diamonds\ninto watches, and exploring NFTs.\n\nThese efforts yielded positive outcomes, with Tag Heuer sales estimated at CHF\n729 million (€784 million) in 2022, up from CHF 682 million (€733 million) in\n2021, as per Morgan Stanley estimates. In an interview with Vogue Business in\nMarch, Arnault indicated that Tag Heuer is on track to join the exclusive €1\nbillion watch brands club.\n\nAs part of the division’s management restructuring, Julien Tornare, CEO of\nZenith since 2017, will now serve as CEO of Tag Heuer, while Benoit De Clerck,\nformerly the Chief Commercial Officer of Panerai at Richemont, will take over as\nCEO of Zenith. Tornare, De Clerck, and Ricardo Guadalupe, CEO of Hublot, will\nall directly report to Arnault.\n\nThe roles of the Arnault family members within the LVMH conglomerate have\nevolved in recent years: Delphine Arnault assumed the role of Chairman and CEO\nof Christian Dior Couture in January 2023; Antoine Arnault has overseen the\ngroup’s communications and environmental initiatives since 2018. He also serves\nas CEO of the family holding company, Christian Dior SE, since December 2022.\nWhile stepping down as CEO of Berluti, he remains chairman and holds the same\nposition at Loro Piana. The three younger sons are concentrating on hard luxury:\nAlexandre Arnault manages product and communications at Tiffany & Co., and Jean\nArnault serves as the watch director at Louis Vuitton.\n\nHave you read?\nRevealed: These Are The Richest Countries In The World, 2024.\nRevealed: Countries with Highest Gun Ownership, 2024.\nRevealed: These Countries Pay Their Olympians For Winning Gold Medals, 2024.\nRevealed: Happiest countries in the world for 2024.\nReport: What Is the Most Common Hair Color in the World?\n\n--------------------------------------------------------------------------------\n\nAdd CEOWORLD magazine to your Google News feed.\n\n--------------------------------------------------------------------------------\n\nFollow CEOWORLD magazine headlines on: Google News, LinkedIn, Twitter, and\nFacebook.\n\n--------------------------------------------------------------------------------\n\nCopyright 2024 The CEOWORLD magazine. All rights reserved. This material (and\nany extract from it) must not be copied, redistributed or placed on any website,\nwithout CEOWORLD magazine' prior written consent. For media queries, please\ncontact: info@ceoworld.biz\n\n--------------------------------------------------------------------------------",
        "summary": "Frédéric Arnault has been named the CEO of LVMH Watches, a newly established position overseeing Hublot, Tag Heuer, and Zenith. This move is aimed at drivingrobust and sustainable growth for the watch Maisons. Arnault reports directly to Stéphane Bianchi, CEO of the watches and jewelry division.",
        "source": "CEOWORLD magazine",
        "sentiment": 0.06712941266596317,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-01-05",
        "title": "Frédéric Arnault to become CEO of LVMH Watches",
        "link": "https://www.ft.com/content/6c567d3c-af3d-48e9-beaa-cac7cf07acbb",
        "content": "Subscribe to unlock this article\n\n\nTRY UNLIMITED ACCESS\nONLY HK$10 FOR 4 WEEKS\n\n\n\nThen HK$565 per month.\nComplete digital access to quality FT journalism on any device. Cancel anytime\nduring your trial.\n\n\nEXPLORE MORE OFFERS.\n\n\n\n\nSTANDARD DIGITAL\n\n\nWEEKEND PRINT + STANDARD DIGITAL\n\n\n\nwasnow HK$349 per month\n\nEssential digital access to quality FT journalism on any device. Pay a year\nupfront and save 20%.\n\n\nSTANDARD DIGITAL\n\n\nWEEKEND PRINT + STANDARD DIGITAL\n\n\n\nwasnow\n\n\nEXPLORE OUR FULL RANGE OF SUBSCRIPTIONS.\n\n\nWHY THE FT?\n\nSee why over a million readers pay to read the Financial Times.\n\nFind out why",
        "summary": "The Financial Times costs £10 per month to subscribe to. Pay a year upfront and save 20%. See why over a million readers pay to read the Financial Times. Use the weekly Newsquiz to test your knowledge of stories you saw in the FT.",
        "source": "ft.com",
        "sentiment": 0.0282276663929224,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-02-20",
        "title": "Who Is Frederic Arnault? Billionaire Bernard Arnault's 29-Year-Old Son Picked To Lead LVMH Watch Division",
        "link": "https://www.forbes.com/sites/zacharyfolk/2024/01/05/who-is-frederic-arnault-billionaire-bernard-arnaults-29-year-old-son-picked-to-lead-lvmh-watch-division/",
        "content": "TOPLINE\n\nLVMH, the luxury fashion and alcohol giant owned by billionaire Bernard Arnault,\nnamed the owner’s 29-year-old son Frederic Arnault as head of the company's\nwatch division—joining his siblings in a senior leadership role at the family\nbusiness.\n\nBernard Arnault’s son will take over as head of all LVMH watch brands—after\nleading Swiss watchmaker ... [+] TAG Heuer for three years.\n\nCopyright 2022 The Associated Press. All rights reserved\n\n\nKEY FACTS\n\nAs head of LVMH watches, Arnault will oversee luxury brands including Zenith,\nHublot, and TAG Heuer—he previously helmed the 164-year-old Swiss watch\nmanufacturer’s push into smartwatch technology.\n\nArnault began working for TAG Heuer as the director of the Connected brand of\nsmartwatches in 2017, before taking over as CEO in 2020.\n\nBefore working for his family business, Frederic held internships at McKinsey\nand Facebook’s AI research division.\n\n\nFORBES VALUATION\n\nWe value Bernard Arnault and his family at $187.2 billion—the second largest\nfortune in the world. The majority of his fortune comes from his 47% stake in\nLVMH—the conglomerate he began building in the 1980s.\n\n\nKEY BACKGROUND\n\nBernard Arnault began building an empire of luxury brands in the 1980s, when he\npurchased a stake in bankrupt fashion house Christian Dior for $15 million in\n1984. Arnault brokered a deal to create a luxury goods conglomerate in 1987,\nmerging Louis Vuitton with champagne maker Moët et Chandon and cognac brand\nHennessy. The company expanded rapidly under his leadership, purchasing over 75\nbrands including Givenchy, Sephora, Marc Jacobs and Bulgari. He also purchased\nChristian Dior outright in 2017, paying an estimated $13.1 billion. All five of\nArnault’s children hold management positions at LVMH. His eldest daughter,\nDelphine, 48, is CEO of Christian Dior. Antoine, 46, is LVMH’s head of\ncommunications, and previously served as CEO of Italian shoemaker Berluti.\nAlexandre, 31, serves as executive vice president of Tiffany & Co., the legacy\nAmerican jeweler LVMH acquired in 2019 in a landmark $16.2 billion deal.\nArnault’s youngest son, Jean, 25, serves as director of watches at Louis\nVuitton.\n\n\nFURTHER READING\n\nForbesTAG Heuer's Deeper Dive Into Golf Follows CEO Arnault's PassionBy\n\nForbesTAG Heuer CEO Frederic Arnault On The Watch Brand's Partnership With\nPorscheBy ForbesFrederic Arnault Of TAG Heuer Focuses On Staying ConnectedBy",
        "summary": "Bernard Arnault’s 29-year-old son Frederic Arnault will take over as head of all LVMH watch brands. He previously worked for Swiss watchmaker TAG Heuer as the director of the Connected brand of smartwatches. Arnault began building an empire of luxury brands in the 1980s, when he purchased Christian Dior.",
        "source": "forbes.com",
        "sentiment": 0.04739440232515335,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-04-17",
        "title": "LVMH’s growth weighed down by softening China luxury demand",
        "link": "https://www.ft.com/content/c0a294a1-04a3-4c1c-a010-d1d81e493604",
        "content": "Subscribe to unlock this article\n\n\nTRY UNLIMITED ACCESS\nONLY HK$10 FOR 4 WEEKS\n\n\n\nThen HK$565 per month.\nComplete digital access to quality FT journalism on any device. Cancel anytime\nduring your trial.\n\n\nEXPLORE MORE OFFERS.\n\n\n\n\nSTANDARD DIGITAL\n\n\nWEEKEND PRINT + STANDARD DIGITAL\n\n\n\nwasnow HK$349 per month\n\nEssential digital access to quality FT journalism on any device. Pay a year\nupfront and save 20%.\n\n\nSTANDARD DIGITAL\n\n\nWEEKEND PRINT + STANDARD DIGITAL\n\n\n\nwasnow\n\n\nEXPLORE OUR FULL RANGE OF SUBSCRIPTIONS.\n\n\nWHY THE FT?\n\nSee why over a million readers pay to read the Financial Times.\n\nFind out why",
        "summary": "The Financial Times costs £10 per month to subscribe to. Pay a year upfront and save 20%. See why over a million readers pay to read the Financial Times. Use the weekly Newsquiz to test your knowledge of stories you saw in the FT.",
        "source": "Financial Times",
        "sentiment": 0.0282276663929224,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-02-06",
        "title": "LVMH’s Arnault trying to head off succession battle",
        "link": "https://www.businesstimes.com.sg/working-life/lvmhs-arnault-trying-head-succession-battle",
        "content": "Bernard Arnault is aware of how succession can make a company vulnerable and how\ndivisions can prove fatal. He has exploited weaknesses in other family-run\nbusinesses including rival Hermes International to try and gain an upper hand in\ntakeover battles in the past.\n\nNow, the 73-year-old LVMH founder is using that knowledge in a bid to cement his\nfamily’s control over the world’s largest luxury goods company and prevent\nsibling infighting. The exercise is fraught, as fights within other famous\nbillionaire clans from the Murdochs to the Kochs and Ambanis can attest.\n\nThrough a series of moves over the past year, many of which have escaped public\nattention, Arnault has laid the groundwork he hopes will prevent such an outcome\nfor his own family empire. At the heart of the plan is a new holding company,\ncontrol of which is split equally among his five children. It already has power\nto influence major decisions affecting the luxury goods group. This is the\nvehicle the patriarch hopes will prevent divisions among his heirs and ensure\nLVMH Moet Hennessy Louis Vuitton SE will remain under family control for decades\nto come.\n\nLeft unspoken in the plan is whether one of the five children will replace\nArnault in the operational role of chief executive officer of LVMH, the business\nhe created in the 1980s by merging the companies that now make up the name.\n\nThe potential contenders would be Delphine, 47, and Antoine, 45, from a first\nmarriage, and Alexandre, 30, Frederic, 28, and Jean, 24, a trio he had with his\nwife, the Canadian-born pianist Helene Mercier. Rapid growth, fuelled by global\ndemand across its 75-strong stable of brands ranging from Dom Perignon and Fendi\nto Louis Vuitton and Tiffany & Co, has made LVMH Europe’s most valuable company,\nworth more than 400 billion euros (S$573 billion).\n\nSpeculation about the succession battle at LVMH was revived by the promotion in\nJanuary of Delphine to head the Christian Dior Couture brand, just as her\nbrother Antoine became CEO of a main holding company of the luxury group. Both\nhave spent decades climbing the corporate ranks. The three younger siblings are\nalso gravitating up through the group, adding to the impression of a race to the\ntop.\n\nBT IN YOUR INBOX\n\nStart and end each day with the latest news stories and analyses delivered\nstraight to your inbox.\n\n“Every time there is transition, this is the most vulnerable period in the life\nof a family-controlled company,” said Raffi Amit, a professor at the Wharton\nSchool of business, who studies wealth across generations at family firms.\n“Families where each generation feels as though their role is to create wealth,\nrather than consume wealth, will sustain themselves for a much longer time.’’\n\nThe LVMH chairman and CEO, who replaced Elon Musk as the world’s richest person\nin December, has no intention of stepping down anytime soon. In April, Arnault\norchestrated the raising of the age limit for his roles by five years to 80.\nObservers point to his vigorous health and fitness. At an earnings presentation\nin January he looked trim and was combative, dodging questions about the\nsuccession. Those who know him well say he is likely to try and extend the age\nrules again, with some even raising the possibility that he will die on the job.\n\nLVMH declined to make Arnault and his children available for interview about his\nsuccession plans.\n\n\n‘A WOLF IN CASHMERE’\n\nArnault has never watched the HBO series Succession, said a person close to the\nLVMH boss, but he will be more than aware of the family dramas that fed the idea\nof the streaming show. His plan to hand the business to his children is an\nattempt to avoid the pitfalls that have bedevilled other families as wealth\nmoves from one generation to the next.\n\nThe billionaire Murdoch family, widely believed to be the inspiration for the TV\nshow, has seen bouts of bitter rivalry among children challenging for power\nwithin the empire of 91-year-old founder Rupert. In Asia, India’s Ambani clan\nwill be forever scarred by the 2002 death without a will of the patriarch, which\npaved the way for a protracted public battle for control between his two sons,\nwho were both involved in the business at the time.\n\nAnother of the world’s wealthiest people, Charles Koch, triumphed in a family\nfight. He and his three brothers inherited Koch Industries Inc from their\nfather, in 1967. A feud broke out and his brother William was ousted in 1980\nafter trying to wrest control. Charles and another brother David bought out\nWilliam and Frederick in 1983, but their legal disputes lasted for nearly two\nmore decades.\n\nIf there is any discord among the Arnault children, it has yet to seep into the\npublic domain. And none of them have shown any resistance to joining the family\nbusiness.\n\nArnault’s fortune is up almost US$34 billion this year and is valued by the\nBloomberg Billionaires Index at US$196 billion. Last year, Arnault outlined – in\na four-page stock market filing – how LVMH ownership would look post-founder and\nin December reorganised his holding company, Agache SE, to protect the family’s\nhold on power.\n\nAgache controls Christian Dior SE, which in turn holds 41 per cent of LVMH.\nOverall, the Arnault family owns 48 per cent of LVMH’s share capital and has\nalmost 64 per cent of the voting rights, meaning that the chances of a predator\ngaining control of Europe’s biggest company are practically nil.\n\n“What’s important for the heirs to understand is that if there is discord\nbetween them, these misunderstandings could affect the performance of the\ngroup,” said Philippe Pele-Clamour, adjunct professor at business school HEC\nParis about the LVMH succession. “The problem will be even more complicated in\nthe generation after them, that of the grandchildren.”\n\nThe critical switch contained in Arnault’s succession plan was the\ntransformation of Agache SE into a limited joint-stock partnership, Agache SCA,\na corporate structure that permits a shareholder with a relatively small holding\nto have a huge sway. A measure described by one legal expert as a “very\nsignificant padlock”.\n\nA notorious example in France was Lagardere SCA, which allowed second-generation\nscion Arnaud Lagardere to retain control of the industrial and media\nconglomerate he inherited, with just 7 per cent of the stock. His frittering\naway of the family fortune is considered the highest-profile succession debacle\nin recent French corporate history.\n\nThe LVMH founder plans to remain head of the joint partnership until another\nnewly-created company, Agache Commandite SAS, decides to remove him and take\nover. That holding is owned through equal stakes by his children. On paper, it\ngives the heirs a measure of power. In reality, there are likely to be\nconfidential conditions that dictate the circumstances required to trigger the\ntransition, leaving the founder firmly in control for the foreseeable future.\n\nAgache Commandite has a rotating, two-year chairmanship with Delphine taking the\nrole first, and a five-member board to guarantee a balance of power among the\nchildren. Key decisions such as doing away with Agache SCA – the joint\npartnership – when their father dies or carrying out a major strategy change at\nthe Christian Dior SE holding or LVMH would require unanimous board approval.\n\nArnault has long held regular, formal meetings with his children at LVMH\nheadquarters to discuss business. But in the new plan, he added a requirement\nthat the siblings be involved in major decisions affecting the luxury empire\nwith immediate effect.\n\nWhile he maintains broad powers over Agache SCA, “certain important decisions”\nlike those surrounding LVMH strategy, the appointment or removal of board\nmembers, top executives and dividend payments will require consultation with the\nchildren via Agache Commandite. This will hold for at least the next decade or\nuntil the father is no longer at the helm.\n\nThe children cannot sell their shares in Agache Commandite for 30 years without\nunanimous board approval and no partner in the company can come from outside one\nof the five bloodlines. After this period lapses, only direct descendants of\nBernard Arnault will be able to hold the shares, with the family having\npreemptive rights.\n\nLVMH investors have largely shrugged off the children’s new-found power,\nsatisfied with the brands’ performance and the prospects of post-pandemic growth\nin China.\n\nSuccession faultlines have been weaponised by Arnault in the past. One\ndescendant of the Hermes dynasty called the LVMH founder “a wolf in cashmere”\nafter he launched a failed bid to take over the rival luxury group and laid bare\nweaknesses in the family’s shareholding defenses. The sowing by Arnault of\nfamily friction to his own advantage goes back even further, when he partnered\nwith, and then ousted, heir Henry Racamier to gain control of the Louis Vuitton\nbusiness in the 1980s.\n\n\nFAMILY AFFAIR\n\nFamilies who have been able to sustain vast wealth over a very long period of\ntime are relatively few and far between. In the US, they include the Mars clan\nbehind the eponymous candy company and the agro-giant dynasty of the\nCargill-MacMillans, in their fifth and seventh generations, respectively. In\nFrance, the family behind Hermes used Arnault’s attack to batten down the\nhatches, strengthening its control, installing a sixth-generation descendant as\nCEO and enjoying the fruits of an almost 900 per cent share price increase since\nOctober 2010, when LVMH announced it had purchased a stake in the Birkin maker.\n\nYet, even when harmony is sustained, profitability doesn’t always follow. Fund\nmanager Carmignac studied the stock market performance of hundreds of family\nbusinesses, and found that between January 2004 and October 2022 they\noutperformed their non-family counterparts. Over time, however, the research\nshows that there is a diminishing return and that family-owned companies managed\nby the first generation gained almost twice as much value as those run by the\nfifth.\n\nThe decline is blamed on a number of factors from a lack of reinvestment of\nprofits by subsequent generations to not having the same philosophy as a\nsuccessful founder, according to analyst Obe Ejikeme. Governance is also a risk\nsince the top management of family firms tend to remain in place for longer.\n\nFrom an operational standpoint, the Arnault offspring still have not been\ntrusted to head the companies that make up the lion’s share of LVMH profits,\nwhich the founder has kept in the hands of trusted lieutenants from outside the\nfamily who have in many cases mentored the heirs.\n\nSales at Louis Vuitton, the biggest LVMH label, crossed 20 billion euros last\nyear. It has been run for the past decade by Michael Burke and is now headed by\nPietro Beccari, the former CEO of Dior, as part of the broader reshuffle which\nelevated Delphine.\n\nLVMH does not break out the profitability of each of its brands, but analysts at\nHSBC in December put Louis Vuitton at the top of the list with an estimated 11\nbillion euros in 2022, three times more than Delphine’s new remit Dior Couture.\nAnd while Tiffany contributed more than one billion euros in profit last year,\nLoro Piana, the cashmere brand, watchmaker Tag Heuer and shoemaker Berluti – all\noverseen by the children, don’t feature in the top 10 of the brands analysed by\nHSBC.\n\n“The question is whether one of the children really wants to be the operational\nhead of the group,” Pele-Clamour said. “Or do they consider that their duty and\nmission is to exercise control without necessarily being CEO. Maybe one would be\nchairman of the board.”\n\nShould Arnault opt for a CEO from outside the family, Italian-born Antonio\nBelloni, 68, might be an option. The deputy CEO joined the firm in 2001 and is\npart of the company’s executive committee and, like Delphine and Antoine, sits\non the board.\n\n“It probably would be helpful for Bernard Arnault to appoint a replacement,\nthere would probably be less friction if he does,” Amit said. “but it appears\nthere is no rush to do it.”\n\n“What’s important,” he added, to minimise poisonous rivalry among the heirs,\n“isn’t just who will be appointed but the process by which this is done.”\n\nBernard Arnault “has a very smart family around him, he’s putting them in a\nposition to get trained, to progress, to be more relevant when it comes to the\nbusiness,” LVMH chief financial officer Jean-Jacques Guiony told Bloomberg on\nthe sidelines of the group’s annual results. “It doesn’t mean that he’s\nlaunching one more than the others in a perspective of succession. I’m not even\nsure he himself knows his plans.’’\n\nWhile some say there’s an element of competition between Alexandre and Frederic,\nwho are close in age, this could be seen as a healthy emulation for the group in\nthe eyes of their father, who has always fostered a degree of rivalry among LVMH\nlabels.\n\n“I don’t have a favourite brand,” Arnault quipped in October when asked about\nhis preference among the LVMH labels. “How can one say that one prefers one of\nhis children?” BLOOMBERG",
        "summary": "Bernard Arnault is aware of how succession can make a company vulnerable. He has exploited weaknesses in other family-run businesses to gain an upper hand. The 73-year-old LVMH founder is using that knowledge in a bid to cement his family's control over the world's largest luxury goods company.",
        "source": "The Business Times",
        "sentiment": -0.14012877643108368,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-03-30",
        "title": "Inside Frédéric Arnault’s strategy to turn Tag Heuer into a €1 billion brand",
        "link": "https://www.voguebusiness.com/companies/inside-frederic-arnaults-strategy-to-turn-tag-heuer-into-a-euro1-billion-brand",
        "content": "MAKE BETTER BUSINESS DECISIONS\n\nSign up to our newsletter for a truly global perspective on the fashion industry\n\nThe CEO of the Swiss watch brand and son of LVMH chairman and CEO Bernard\nArnault talks about lab-grown pink diamonds, China and the new Ryan Gosling\nfilm.\n\nMarch 30, 2023\n\n\n\nPhoto: Courtesy of Tag Heuer\n\nThis article is part of our Vogue Business Membership package. To enjoy\nunlimited access to Member-only reporting and insights, our NFT Tracker and\nTikTok Trend Tracker, weekly Technology and Sustainability Edits and exclusive\nevent invitations, sign up for Membership here.\n\nFrédéric Arnault feels strongly about innovation, whether it’s studding watches\nwith lab-grown pink diamonds or rewriting the playbook on how to sell classic\ntimepieces, specifically by injecting campaigns with humour. ",
        "summary": "Frédéric Arnault is the CEO of Swiss watch brand Tag Heuer. He talks about lab-grown pink diamonds, China and the new Ryan Gosling film. Sign up for Vogue Business Membership to get the full story.",
        "source": "Vogue Business",
        "sentiment": 0.0620119571685791,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-04-28",
        "title": "LVMH aims high for Tiffany after lavish revamp of New York store ",
        "link": "https://www.ft.com/content/61b2e4e9-adfb-4a36-8ac1-009c5ff3ca84",
        "content": "Subscribe to unlock this article\n\n\nTRY UNLIMITED ACCESS\nONLY HK$10 FOR 4 WEEKS\n\n\n\nThen HK$565 per month.\nComplete digital access to quality FT journalism on any device. Cancel anytime\nduring your trial.\n\n\nEXPLORE MORE OFFERS.\n\n\n\n\nSTANDARD DIGITAL\n\n\nWEEKEND PRINT + STANDARD DIGITAL\n\n\n\nwasnow HK$349 per month\n\nEssential digital access to quality FT journalism on any device. Pay a year\nupfront and save 20%.\n\n\nSTANDARD DIGITAL\n\n\nWEEKEND PRINT + STANDARD DIGITAL\n\n\n\nwasnow\n\n\nEXPLORE OUR FULL RANGE OF SUBSCRIPTIONS.\n\n\nWHY THE FT?\n\nSee why over a million readers pay to read the Financial Times.\n\nFind out why",
        "summary": "The Financial Times costs £10 per month to subscribe to. Pay a year upfront and save 20%. See why over a million readers pay to read the Financial Times. Use the weekly Newsquiz to test your knowledge of stories you saw in the FT.",
        "source": "Financial Times",
        "sentiment": 0.0282276663929224,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-06-25",
        "title": "Bloomberg - Are you a robot?",
        "link": "https://www.bloomberg.com/features/2024-lvmh-bernard-arnault/",
        "content": "WHY DID THIS HAPPEN?\n\nPlease make sure your browser supports JavaScript and cookies and that you are\nnot blocking them from loading. For more information you can review our Terms of\nService and Cookie Policy.\n\n\nNEED HELP?\n\nFor inquiries related to this message please contact our support team and\nprovide the reference ID below.\n\nBlock reference ID:",
        "summary": "summarize: WHY DID THIS HAPPEN? Please make sure your browser supports JavaScript and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy. For inquiries related to this message please contact our support team and provide a reference ID.",
        "source": "bloomberg.com",
        "sentiment": -0.04044743813574314,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-01-13",
        "title": "LVMH Shuffles Leadership at Dior and Louis Vuitton, Its Top Brands (Published 2023)",
        "link": "https://www.nytimes.com/2023/01/11/business/dealbook/lvmh-leadership-arnault.html",
        "content": "The company’s chairman, Bernard Arnault, continues to promote his children to\nthe luxury goods group’s key posts.\n\n\nBernard Arnault, the chief executive of LVMH, appointed his daughter, Delphine\nArnault, to run Dior, the company’s second-largest brand.Credit...Eric\nPiermont/Agence France-Presse — Getty Images\n\nPublished Jan. 11, 2023Updated Jan. 13, 2023\n\nA new year brings a leadership shuffle to the ranks of Louis Vuitton Moët\nHennessey, the world’s largest luxury goods group by sales, as its chairman and\nchief executive, Bernard Arnault, continues to promote his children to key posts\nwithin his empire.\n\nMr. Arnault, the world’s richest person, appointed his daughter, Delphine\nArnault, to run Dior, LVMH’s second-largest brand. Pietro Beccari, who has been\nDior chief executive since 2018, was named the chief executive of LVMH’s\nflagship brand, Louis Vuitton, which accounts for almost two-thirds of the\ncompany’s annual operating profit.\n\nMichael Burke, the longtime Louis Vuitton chief executive and one of Mr.\nArnault’s longest-serving executives, will remain at the group and continue to\nwork alongside Mr. Arnault, the company said in a statement, without detailing\nhis new role.\n\nThe appointments were first reported by Miss Tweed. They are the latest moves by\nMr. Arnault, LVMH’s 73-year-old chairman, to secure a succession plan at the\nluxury group by putting his children in key executive roles.\n\nImage\n\nFrederic Arnault, left, Delphine Arnault, Antoine Arnault, Bernard Arnault,\nHélène Mercier and Alexandre Arnault in 2021.Credit...Chesnot/Getty Images\n\nMs. Arnault, 47, worked at Louis Vuitton for the past decade alongside Mr. Burke\nand previously spent a dozen years at Dior. Antoine Arnault, 45, is chief\nexecutive of Christian Dior SE, the holding company through which the Arnaults\ncontrol LVMH. Alexandre Arnault, 30, is the executive vice president of product\nand communications at Tiffany & Company. Frédéric Arnault, 27, is the chief\nexecutive of TAG Heuer. Jean Arnault, 24, was promoted in November to the role\nof watches director at Louis Vuitton.\n\n“Succession planning in strategic roles has been instrumental to the success of\nLVMH’s key brands over the past 20 years, hence today’s moves are significant,”\nsaid Thomas Chauvet, head of luxury goods equity research at Citi.\n\nLVMH recorded revenue of 56.5 billion euros, or $55.1 billion, for the first\nnine months of last year and is set to publish its full year results for 2022 at\nthe end of this month. Its stock gained nearly 2 percent in morning trading\nParis on Wednesday, and is up more than 11 percent in 2023, adding nearly $40\nbillion in market capitalization.\n\nDemand for LVMH handbags, shoes and designer clothes has proved robust, despite\nthe global economic downturn and Covid restrictions hurting sales in mainland\nChina, one of its most important markets.\n\nA correction was made on\n\nJan. 13, 2023\n\n:\n\nAn earlier version of this article misidentified the publication that first\nreported the appointments. It was Miss Tweed, not The Business of Fashion.\n\nHow we handle corrections\n\nElizabeth Paton is a reporter for the Styles section, covering the fashion and\nluxury sectors in Europe. Before joining The Times in 2015, she was a reporter\nat the Financial Times both in London and New York. More about Elizabeth Paton\n\nA version of this article appears in print on  , Section B, Page 3 of the New\nYork edition with the headline: LVMH Shuffles Leadership at Dior and Louis\nVuitton. Order Reprints | Today’s Paper | Subscribe",
        "summary": "Bernard Arnault, the chief executive of LVMH, appointed his daughter, DelphineArnault, to run Dior, the company’s second-largest brand. Pietro Beccari, who has been Dior chief executive since 2018, was named the chief Executive of Louis Vuitton. Michael Burke, the longtime Louis. Vuitton chief executive, will remain at the group and continue to. continue to work alongside Mr. Arnault.",
        "source": "The New York Times",
        "sentiment": 0.04820680618286133,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-02-11",
        "title": "Weekend Briefing: Luxury brands look to fragrance, China to boost revenue",
        "link": "https://www.glossy.co/fashion/weekend-briefing-luxury-brands-look-to-fragrance-china-to-boost-revenue/",
        "content": "As the luxury slowdown continues, luxury brands are looking for ways to juice up\nrevenue, including looking to new categories like watches and beauty. Don’t\nforget to subscribe to the Glossy Podcast for interviews with fashion industry\nleaders and Week in Review episodes, and the Glossy Beauty Podcast for\ninterviews from the beauty industry. –Danny Parisi, sr. fashion reporter\n\n\nLUXURY BRANDS LOOK TO CATEGORY EXPANSION AND CHINA TO GET THROUGH THE SLOWDOWN\n\nIn the ongoing luxury slowdown, even Kering isn’t safe. The company announced\nits latest earnings on Thursday, revealing that its operating profits fell by\n15% last year and that it expects the same will happen this year, as well. Sales\nacross most of its brands and divisions were down. Gucci, its largest fashion\nbrand, saw a 4% drop.\n\nTo prepare for continued slowdowns in fashion sales, Kering has been revving up\ninvestment in its fragrance arm. Last year, Kering spent nearly $4 billion to\nacquire the perfumery Creed, and it plans to release fragrances from three of\nits top brands — Bottega Veneta, Balenciaga and Alexander McQueen — this year.\n\nThis sort of category expansion is becoming more common across the major luxury\ngroups. For Kering, it’s beauty through its new Kering Beauté arm. Richemont is\nalso investing in beauty as an avenue for expansion, launching its own beauty\ndivision in September of last year. And for LVMH, it’s watches. Frédéric\nArnault, the new CEO of the newly created LVMH Watches division, is planning to\nmake LVMH and its 10 watch brands into a major horological player.\n\nWhether these new expansions will help the conglomerates avoid the ongoing\nluxury slowdown remains to be seen. But not all major luxury groups are having\nas tough a time as Kering. Tapestry raised its profit forecast this week, citing\nhigher demand for its handbags in mainland China and less significant but still\npositive sales growth in Europe. Sales for Tapestry grew 19% in China and 11% in\nEurope last quarter.\n\nRalph Lauren also saw positive growth thanks to strength in China. In its\nearnings report last week, Ralph Lauren showed its revenue increased 24%\nglobally and 30% in China over the last quarter.\n\nLuxury brands across the industry are seeing the resilience of the Chinese\nluxury market. Last week, Loewe announced a new Jonathan-Anderson-curated\nimmersive brand exhibition that will open in Shanghai in March. It will include\nartifacts from the brand’s history and a look at its design and creation\nprocess. According to the brand, it’s its first major exhibition, and China was\nchosen due to the strength of the local Loewe customer.",
        "summary": "Luxury brands are looking to new categories like watches and beauty to juice up revenue. Kering announced its operating profits fell by 15% last year and expects the same this year. But not all major luxury groups are having as tough a time as Kering.",
        "source": "www.glossy.co",
        "sentiment": -0.15260109305381775,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-01-26",
        "title": "Bernard Arnault Tightens Family Control Over LVMH",
        "link": "https://wwd.com/business-news/financial/bernard-arnault-tightens-family-control-lvmh-1236155454/",
        "content": "PARIS — Global demand for luxury goods may be slowing, but Bernard Arnault is\nalways eyeing a bigger slice of the pie.\n\nSpeaking after LVMH Moët Hennessy Louis Vuitton reported another year of record\nresults, the tycoon said he has no intention of breaking up his group, which\nposted sales of 86.15 billion euros in 2023. Rather, he’s tightening his\nfamily’s grip on its leadership and continues to target growth.\n\nIn the latest move to prepare his succession, Arnault, who turns 75 in March,\nconfirmed that the luxury conglomerate will propose the appointments of his sons\nAlexandre Arnault and Frédéric Arnault to the board at the next annual general\nmeeting, to be held on April 18.\n\n“It’s fashionable right now in a lot of countries to bring in younger\nleadership. Well, we’re getting younger too, even if I’m not planning to go\nanywhere either in the short term or long term. I prefer to let that be known\nstraight away because you might ask me about it, so rest easy,” the LVMH\nchairman and chief executive officer told analysts and reporters. \n\n\nYOU MAY ALSO LIKE\n\nAlexandre Arnault, executive vice president of product and communications at\nU.S. jeweler Tiffany & Co., and Frédéric Arnault, CEO of LVMH Watches, will join\ntheir siblings Antoine Arnault, head of communication, image and environment at\nLVMH, and Delphine Arnault, chairman and CEO of Christian Dior Couture, on the\nboard.\n\nThat leaves the youngest sibling, Jean Arnault, who is in his mid-20s and is\nmarketing and product development director for watches at Louis Vuitton. “He’s\ngot time, he’s young,” Arnault told reporters on the margins of the press\nconference at the company’s headquarters in Paris.\n\nSpeaking to a small group of journalists, the executive quashed suggestions that\nLVMH should break up its business to unlock value for investors. \n\nThis follows an article this week by Bloomberg Opinion columnist Andrea Felsted\npointing out that LVMH is trading at a steep discount to Hermès because of the\ndisparate nature of its businesses, which include Louis Vuitton and Dior, as\nwell as beauty retailer Sephora, but also wines and spirits, duty-free retailing\nand hospitality.\n\n“I can’t consider it under any circumstances. I find it completely\ninappropriate,” Arnault said of the suggestion to split LVMH. “If our financial\nservices are dynamic enough, we must significantly increase our\nprice-to-earnings ratio without any spin-off, because that would be a mistake,\nsince the group is built precisely on this diversity of brands.”\n\nHe said LVMH was likely to get even fatter, whether through acquisitions or\norganic growth. Citing another recent newspaper article during his opening\nspeech, he said Louis Vuitton, Dior, Chanel and Hermès were considered the\nmarket leaders in soft luxury, and Tiffany, Bulgari, Cartier and Van Cleef &\nArpels the top four in hard luxury. \n\n“Among the eight brands that I consider to be the best in the world, we have\nhalf, which is already quite good. We’ll see what happens later, if we manage to\nexpand the scope a little, or if we manage to push some other brands to join the\nfirst four,” he said.\n\nAddressing past rumors that LVMH was interested in acquiring rival Compagnie\nFinancière Richemont, Arnault was playful, after chairman Johann Rupert\nreiterated last year that he has no plans to sell Richemont or its star brand\nCartier.\n\n“I consider Mr. Rupert an exceptional leader and I have no desire to interfere\nwith his strategy. I understand that he’s keen to remain independent,” Arnault\nsaid. “I think it’s very good and if he needs support to retain his\nindependence, I will be there,” he added to chuckles from the room.\n\nThe executive said he expected growth to remain stable in 2024 versus the prior\nyear. It promises to be a banner period for LVMH, which is a premium partner of\nthe Paris 2024 Olympic and Paralympic Games.\n\n“Personally, I’m very confident,” Arnault said. “We’re going to start to see the\nimpact of future interest rate cuts, and I also expect a positive impact on the\nU.S. economy from the upcoming [presidential] election. Each time there’s an\nelection in the U.S., the market is more dynamic.”\n\nOn the risk side, he raised the prospect of a spiraling of the conflicts in\nEastern Europe and the Middle East. “That is the main concern I see for 2024.\nAside from that, I think the economic outlook will be better overall for our\nproducts,” he said. “Oddly enough, the strongest demand is for the most premium\nproducts.”\n\nHe also sought to put a positive spin on the normalization of the luxury\nindustry’s growth rates after three years of post-pandemic euphoria.\n\nIn results reported after the market close on Thursday, LVMH said like-for-like\nsales at its key fashion and leather goods division rose 9 percent in the fourth\nquarter, in line with market expectations. Arnault noted that after several\nyears of double-digit organic revenue growth, Dior was now performing in line\nwith the segment’s overall progression.\n\n“We have reached a stage where we no longer need such strong growth and for me,\nbetween 8 and 10 percent is ideal,” he said, noting that he prefers to focus on\nthe desirability of his brands with exclusive products, rather than chasing\nhigher sales. “I would rather hit the brakes than the accelerator.”\n\nChief financial officer Jean-Jacques Guiony noted that the group’s average\nannual organic growth rate over the last 35 years was 9.1 percent. \n\nLVMH’s sales growth slowed in the second half of 2024, although there was a\nslight improvement in the fourth quarter, thanks to the strong performance of\nits selective retailing and perfume and cosmetics divisions, and an easier\ncomparison basis with the same period last year when much of China was in\nlockdown due to COVID-19.\n\nOverall group sales were up 5.5 percent at actual exchange rates to 23.95\nbillion euros in the three months ended Dec. 31, following a 1 percent increase\nin the previous three months. This represented a rise of 10 percent on a\nlike-for-like basis, up from the 9 percent recorded in the third quarter.\n\nTo help future-proof its strategy, LVMH kicked off the year with several senior\nexecutive changes. \n\nGroup veteran Michael Burke is set to succeed Sidney Toledano at the head of\nLVMH Fashion Group, overseeing Celine, Givenchy, Kenzo, Loewe, Marc Jacobs,\nPatou and Emilio Pucci. It is understood Burke’s stable of brands will be\nexpanded to include Fendi.\n\nToledano will leave the LVMH executive committee and become an adviser to\nBernard Arnault in the handover, which takes effect on Feb. 1. Arnault said\nStéphane Bianchi, CEO of LVMH’s watches and jewelry division, would also move on\nto a new role, though he declined to elaborate.\n\nFrench businessman Henri de Castries is also among the nominees to join the\nboard, following the decision by Charles de Croisset, Yves-Thibault de Silguy\nand Nicolas Bazire to not stand for reelection as directors.\n\nLVMH shares have fallen by more than 23 percent over the last six months amid a\nglobal slowdown in luxury demand. In late August, LVMH was overtaken as Europe’s\nmost valuable listed company by Danish pharmaceutical giant Novo Nordisk, the\nmaker of diabetes and weight-loss drugs Ozempic and Wegovy.\n\nIts fourth-quarter report comes on the heels of mixed results for its luxury\npeers.\n\nBurberry lowered its full-year profit guidance after disappointing holiday\nsales, but Richemont beat expectations thanks to strong demand for jewelry in\nmarkets such as Japan, mainland China and North America.\n\nMeanwhile, Brunello Cucinelli said results in the fourth quarter were the best\never in absolute value, with sales up 15.6 percent year-over-year. Kering is due\nto report full-year results on Feb. 8, with Hermès International set to follow\non Feb. 9.",
        "summary": "LVMH Moët Hennessy Louis Vuitton reported another year of record results. The tycoon said he has no intention of breaking up his group. LVMH is trading at a steep discount to Hermès because of the nature of its businesses.",
        "source": "WWD",
        "sentiment": 0.2923818826675415,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-01-26",
        "title": "Why Is Vestiaire Collective Crowdfunding? ",
        "link": "https://www.businessoffashion.com/briefings/retail/vestiaire-collective-crowdfunding-resale/",
        "content": "Vestiaire Collective’s announcement of a crowdfunding campaign earlier this week\nraised some eyebrows.\n\nThe luxury platform’s previous backers were the opposite of grassroots: it’s\nraised $744 million over 12 rounds, including one in 2021 that included Kering\nand Tiger Global Management, one of the world’s biggest backers of start-ups.\nOne million euros ($1.09 million) in small contributions from individuals is a\ndeparture, to say the least.\n\nBefore jumping to any conclusions about the impact of high interest rates or the\nluxury slowdown on resale start-ups, we figured it was best to ask Vestiaire\nchief executive Max Bittner about the motivations behind the campaign.\n\nTurns out, it’s not really about the money.\n\n“It’s a drop in the bucket,” chief executive Max Bittner told The Business of\nFashion. “This fundraiser was not even the idea of the finance department, it\nwas the idea of the marketing department.”\n\nIt’s a tactic that has been tried before, including by AllBirds in 2016 before\nit eventually listed in 2021. Not only does it make noise in the market and\nboost ties with loyal customers, the sacrifice is minimal: companies are\ntypically not obliged to appoint a crowdfunding representative to their board\nand shares do not carry voting rights.\n\nVestiaire has its eyes on bigger investors down the line, of course. The\nstart-up, founded in 2009 in Paris, is reportedly aiming for an initial public\noffering in 2025.\n\nThat may prove a tougher sell. The track record for fashion resale platforms on\nthe stock market is pretty dismal. Poshmark hit a peak valuation of $7.5 billion\nwhen it listed in January 2021, but its share price fell more than 80 percent\nbefore it was acquired by Korean e-commerce company Naver in October 2022.\nShares of The RealReal trade around $2 after debuting above $30 in June 2019.\n\nCompetition is fierce, particularly in the US, where Vestiaire is in the middle\nof an aggressive expansion push headed by Samina Virk, who was appointed a year\nago, and Bittner himself has also relocated to New York from Paris. In addition\nto Poshmark and The RealReal, there’s Depop, still going strong under Etsy,\nnumerous niche start-ups competing to re-sell bags, jewellery and other\ncategories. Brands such as Maje, Sandro, and Lululemon have their own direct\nsecondhand sales now. Peer-to-peer rental services such as Pickle, By Rotation\nand Tulerie have a similar proposition of luxury for less, while Shein and Temu\noffer dupes by the thousands.\n\nAnd of course there’s eBay, the original secondhand giant, which has recently\nstepped up its efforts in higher end fashion and watches, including an\naccessories verification programme in partnership with various brands. It also\nheld an offline pop-up “Canal Street Wear,” which featured clothing from\ntop-rated eBay sellers. (Ebay has had its own struggles, announcing this week it\nwould cut 9 percent of its workforce, about 1,000 employees.)\n\nStill, there are reasons to be optimistic that Vestiaire Collective can succeed\nwhere The RealReal couldn’t (or at least, hasn’t yet). The “normalisation” of\nluxury spending flagged by LVMH this week is in part the result of aspirational\nconsumers being priced out of buying new Hermes or Chanel bags. In another bad\nsign for luxury brands, this past week, the four biggest US banks reported\nhigher credit card spending in 2023 compared with the previous year, and that\ncardholders were taking longer to pay down their debt, according to analysis\nthis week by The Wall Street Journal.\n\nThose newly cash-strapped shoppers might now turn to resale sites for bargains.\nVestaire Collective’s revenue grew a healthy 25 percent in 2023, according to\nBittner, slower than it was two years ago but showing signs of picking up. The\ncompany is also on track to be profitable sometime this year, he said.\n\n“Of course, we have an environment where people are more cautious but if\nanything, we’ve seen actually an improvement of the environment over the last, I\nwould say, four to eight weeks,” he said. “The business is as healthy as I’ve\nseen it in the last five years since I’ve been here.”\n\nBittner said he’s more focused on executing his existing plan than the wider\nuniverse of resale, rental, fast fashion, new luxury and beyond.\n\n“If my competition is everything from the first market of Hermes to Shein and\nTemu then I’m going to go crazy,” he said. “I don’t need to launch new markets\nand launch new categories. I don’t need to pivot. I just need to do more of the\nsame. And that will get me to where I need to be by the end of 2024.”\n\nTHE NEWS IN BRIEF\n\nFASHION, BUSINESS AND THE ECONOMY\n\n(Getty Images)\n\nLVMH’s fourth quarter sales grow 10 percent. The group’s key fashion and leather\ngoods division reported 9 percent growth, in line with the previous quarter.\nFull-year operating profit grew 8 percent to €22.8 billion euros ($24.7\nbillion).\n\nFerragamo CEO warns turnaround may take longer after 2023 sales drop. Sales fell\nby 8.1 percent at constant currencies last year. Revenues reached €1.16 billion\n($1.58 billion) in 2023, a touch above the €1.15 billion estimated by analysts\naccording to an LSEG consensus.\n\nShein backers offer to sell at 30 percent discount as IPO prospects dim.\nInvestors are trying to sell shares in private market deals that value the\nonline fashion giant at as low as $45 billion. The latest offers show how the\ngap is widening between market appetite and Shein’s target of up to $90 billion\nin an initial public offering.\n\nSwatch raucous analyst call pits CEO Hayek against investors. The company hit\nback at investors who’ve called out the firm for its governance and management\npractices, accusing them of seeking privileged information. CEO Nick Hayek said\nif investors are unhappy with the way the company it’s managed and governed,\nthey can invest elsewhere.\n\nChina’s luxury market is expected to grow by mid-single digits in 2024,\naccording to new report by Bain and Company. The Hainan region is forecasted to\nbe most impactful in 2024 as luxury brands continue to invest in the island.\nLuxury labels with a high concentration of wealthy clientele are expected to be\nmost resilient.\n\nSaks operator HBC in talks to raise liquidity and refinance a loan. HBC has also\nbeen speaking to potential investors about roughly $50 million in additional\ndebt. The financing would be issued under a $150 million senior secured term\nloan initially placed in late 2020, though talks are ongoing and plans could\nchange.\n\nMacy’s rejects Arkhouse’s $5.8 million bid. Macy’s said the offer was not\nfinancially attractive or credible enough to grant such access. Macy’s is not\nrunning a sale process with other parties and no other unsolicited bidders have\nemerged that meet the company’s expectations about a potential deal.\n\nAmer Sports to weigh raising up to $1.8 million in US IPO. The company could\nmarket about 100 million shares in a range of $16 to $18 each. Terms of the\npotential offering may be announced as soon as in the coming days, people with\nknowledge of the matter said.\n\nSuperdry losses balloon as retailer struggles to compete. The company’s stock,\nwhich had fallen 89 percent in a year, rose 2.5 percent in early trading.\nSuperdry’s adjusted loss before tax grew to £25.3million ($32.1 million) in the\nfirst half, compared with around £14 million a year earlier.\n\nSwatch group dashes dividend expectations and shares tick lower. The company\nposted sales rising by 5.2 percent last year to 7.88 billion Swiss francs ($9.10\nbillion). Earnings fell short, with operating profit of 1.19 billion francs\nmissing forecasts for 1.32 billion francs, according to LSEG data.\n\nLevi Strauss to cut jobs after projecting bleak 2024 on fragile wholesale\nbusiness. Shares of the company fell more than 5 percent in extended trading.\nThe denim maker said it would cut 10 percent to 15 percent of its global\ncorporate jobs.\n\nPrimark holds prices steady after Rita Ora helps lift sales. The company said\nsales at UK stores rose 3.8 percent fuelled by The Edit and Rita Ora ranges.\nGlobally Primark’s sales rose 7.3 percent to £3.4 billion in the period, helped\nby store openings in the US and Europe.\n\nRetail start-up Neighborhood Goods shutters all four stores. Launched in 2018,\nthe company has raised more than $25 million in funding. In early January,\nNeighborhood Goods closed its stores in Plano and Austin, Texas.\n\nLevi Strauss sues Brunello Cucinelli over trademarked tab. The lawsuit seeks to\nend sales of infringing products, unspecified damages including lost profits,\nand other remedies. Levi said repeated attempts to resolve the dispute without\nlitigation were unsuccessful.\n\nMatthew Williams sets new strategy for 1017 ALYX 9SM. The label will bring fresh\nfocus to its womenswear offer, shift its base of operations to Paris, and return\nto the Paris Men’s Fashion Week calendar. It will also double down on its\ndirect-to-consumer business.\n\nTHE BUSINESS OF BEAUTY\n\n(Shutterstock)\n\nUnilever’s US and European market share slips as private label booms. The\ncompany’s underlying price growth was 13.3 percent at its height in the fourth\nquarter of 2022. In the United States, Unilever’s body wash business, which\nincludes Dove products, lost the most market share - down 510 basis points.\n\nGivaudan sales surge to $8 billion. Growth was especially seen in its fragrance\nand beauty division, where sales grew 7.6 percent to CHF 3.3 billion ($3.8\nbillion). Fine fragrances were up 14 percent. The company noted “sustained high\nlevels” of new business for its fine fragrances division.\n\nUltra Violette secures AUD $15 million investment from Aria Growth Partners. The\nAustralian sun care brand hopes the capital will aid in product innovation and\nglobal expansion. Ava Chandler-Matthews and Rebecca Jefferd, the brand’s\nfounders, will remain at the helm.\n\nP&G’s strong margins take heat off annual profit forecast cut. The company’s net\nsales rose 3.2 percent, missing LSEG estimates, due to slowing demand for\nproducts including beauty brand SK-II in its second-largest market China. The\ncompany’s core profit came in at $1.84 per share, beating estimates of $1.70.\n\nBridgepoint acquires anti-ageing brand Roc Skincare. The deal was for around\n$500 million, one source said, speaking on condition of anonymity. Bridgepoint,\nwhich has €39.5 billion ($43 billion) of assets under management, has made\nsimilar investments including its purchase of French cosmetics company Vivacy in\n2022.\n\nPamela Anderson purchases stake in Sonsie Skin. She shares a stake in the\ncompany alongside founders Marie von Behrens-Felipe and Roberto A. Felipe, who\nlaunched the brand in June 2023. She joins the company as co-founder and\nco-owner.\n\nHair and scalp line Jupiter secures $3 million in funding round. Willow Growth\nVentures and Springdale Ventures participated in the extended seed round.\nFunding was previously raised in a 2019 pre-launch round, with additional rounds\nin 2021 and 2022.\n\nPEOPLE\n\n(TAG Heuer)\n\nLVMH’s Arnault set to propose sons Alexandre and Frédéric for company’s board.\nThe board nominations would then be subject to a vote at the company’s annual\ngeneral meeting in April. Arnault and his family own about 48 percent of LVMH\nshares and nearly 64 percent of voting rights.\n\nKim Kardashian returns as Balenciaga ambassador. Kardashian’s ties with Demna\nand Balenciaga were called into question in November 2022 following an\nadvertising scandal. “I’m excited about this next chapter for the brand,”\nKardashian said.\n\nSephora Greater China head steps down. Maggie Chan has stepped down after five\nyears with the company. No successor has yet been named to lead the LVMH\nGroup-owned beauty retailer in the Chinese market.\n\nMEDIA AND TECHNOLOGY\n\n(Shutterstock)\n\nFlorida lawmakers vote to restrict children’s access to social media. Passed by\na bipartisan vote of 106 to 13, the measure would require social media platforms\nto terminate the accounts of anyone under 17 years old. The bill would also\nrequire firms to permanently delete personal information collected from the\nterminated accounts.\n\nAnne Hathaway walks out of a Vanity Fair photoshoot in union solidarity. About\n400 union members at Condé Nast downed pens in a protest at the way the\npublisher is negotiating over layoffs. Hathaway was on the premises for a\nphotoshoot on Tuesday morning.\n\nItaly tightens charity giving rules after influencer Ferragni scandal. The bill\nis due to be approved on Thursday and stipulates that products linked to charity\ndonations should indicate the purpose and recipient, and make clear the share of\nthe price going to charity. The law envisages fines of up to €50,000 ($54,500)\nfor those who fail to respect such obligations.\n\nCompiled by Yola Mzizi.",
        "summary": "Vestiaire Collective announced a crowdfunding campaign earlier this week. The luxury resale site raised $1.09 million in small contributions. CEO Max Bittner said it was not even the idea of the finance department. The company is reportedly aiming for an initial public offering in 2025.",
        "source": "The Business of Fashion",
        "sentiment": -0.4624275863170624,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-01-26",
        "title": "Electric car maker slashes hundreds of jobs",
        "link": "https://www.telegraph.co.uk/business/2024/01/26/ftse-100-markets-news-latest-lvmh-bernard-arnault-us-pce/",
        "content": "Thanks for joining me. The world’s richest man, Bernard Arnault, has appointed\nhis sons to the board of LVMH as it revealed increasing sales.\n\nAlexandre and Frederic will be named to the company’s board, where they will\njoin two of their siblings, in a scene reminiscent of the HBO drama Succession.\n\n\n5 THINGS TO START YOUR DAY \n\n1) FTSE bosses fear falling prey to foreign takeovers | City leaders say their\nundervalued companies are at a greater risk from overseas buyers\n\n2) UAE stake in Vodafone is a threat to Britain, ministers find | Telecoms\noperator at risk of ‘material influence’ by the Gulf state, Government says\n\n3) John Lewis plans to accelerate job cuts after slashing redundancy payouts |\nStaff lash out at changes, calling them a ‘loud and clear’ signal of\nredundancies\n\n4) Christine Lagarde hits back at ‘irrelevant’ criticism of leadership |\nEuropean Central Bank president rejects talk of widespread unhappiness among\nstaff\n\n5) Ambrose Evans-Pritchard: China’s economy looks more unstable than ever | The\ncountry is in even worse trouble now than it was 16 years ago\n\n\nWHAT HAPPENED OVERNIGHT \n\nA post-Brexit trade deal between Britain and Canada has collapsed after\nnegotiations lasting more than two years were halted by a row over meat and\ncheese exports.\n\nAsian shares were mostly lower despite upbeat news on the US economy, with\nJapan’s benchmark falling after the latest data showed inflation has been\nslowing faster than expected.\n\nTokyo stocks closed lower after rallying to near 34-year highs as losses of\nchip-linked shares weighed on the market.\n\nThe benchmark Nikkei 225 index lost 1.3pc, or 485.40 points, to end at\n35,751.07, while the broader Topix index fell 1.4pc, or 34.27 points, to\n2,497.65.\n\nWeaker price increases relieve pressure on the Bank of Japan to tighten its\nultra-lax monetary policy, which has pumped massive amounts of cash into\nmarkets. The central bank is targeting 2% inflation.\n\nChinese markets ended a winning streak following a spate of moves by the\ngovernment to shore up share prices and the property sector.\n\nHong Kong’s Hang Seng slipped 1pc to 16,052.41, while the Shanghai Composite\nlost 0.4pc to 2,895.14.\n\nSouth Korea’s Kospi jumped 1pc to 2,493.73. Trading was closed in Australia for\na national holiday.\n\nGlobal shares rose on Thursday. In the US, the S&P 500 achieved its fifth\nconsecutive record high closing. Wall Street investors were showing some relief\nthat the American economy was holding up better than hoped. Peter Cardillo,\nchief market economist at Spartan Capital Securities in New York, said the\nnumbers “bode well for a soft landing.”\n\nThe S&P 500 gained 0.53pc, reaching 4,894.16, while the Dow Jones Industrial\nAverage of 30 leading American companies rose 0.64pc to 38,049.13. The Nasdaq\nComposite index gained 0.18pc to 15,510.50.\n\nUS Treasury yields fell as investors bid up prices after the data showing\nfaster-than-expected economic growth, along with an inflation pace on track to\nmeet the Fed’s 2pc target.\n\nThe yield on benchmark 10-year US Treasury bonds fell to 4.128pc compared with\nits close of 4.178pc on Wednesday.",
        "summary": "The world’s richest man, Bernard Arnault, has appointed his sons to the board of LVMH as it revealed increasing sales. Tokyo stocks closed lower after rallying to near 34-year highs as losses of chip-linked shares weighed on the market.",
        "source": "The Telegraph",
        "sentiment": -0.940382331609726,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-06-25",
        "title": "LVMH’s Bernard Arnault emerges as personal stakeholder in Richemont",
        "link": "https://www.ft.com/content/eb9a7ae9-0dee-4c52-8542-f4f890e459dd",
        "content": "Subscribe to unlock this article\n\n\nTRY UNLIMITED ACCESS\nONLY HK$10 FOR 4 WEEKS\n\n\n\nThen HK$565 per month.\nComplete digital access to quality FT journalism on any device. Cancel anytime\nduring your trial.\n\n\nEXPLORE MORE OFFERS.\n\n\n\n\nSTANDARD DIGITAL\n\n\nWEEKEND PRINT + STANDARD DIGITAL\n\n\n\nwasnow HK$349 per month\n\nEssential digital access to quality FT journalism on any device. Pay a year\nupfront and save 20%.\n\n\nSTANDARD DIGITAL\n\n\nWEEKEND PRINT + STANDARD DIGITAL\n\n\n\nwasnow\n\n\nEXPLORE OUR FULL RANGE OF SUBSCRIPTIONS.\n\n\nWHY THE FT?\n\nSee why over a million readers pay to read the Financial Times.\n\nFind out why",
        "summary": "The Financial Times costs £10 per month to subscribe to. Pay a year upfront and save 20%. See why over a million readers pay to read the Financial Times. Use the weekly Newsquiz to test your knowledge of stories you saw in the FT.",
        "source": "Financial Times",
        "sentiment": 0.0282276663929224,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-05-14",
        "title": "The Business of Fashion",
        "link": "https://www.businessoffashion.com/people/bernard-arnault/",
        "content": "The man at the helm of luxury’s largest conglomerate, Bernard Arnault and his\nluxury group LVMH have an indelible imprint on the fashion industry — on account\nof the sheer scale of the company's acquisitions and continuing profitability.\n\nIn addition to LVMH, Arnault oversees further investment and holding vehicles.\nGroupe Arnault has invested in Netflix and Blue Capital and also took a major\nstake in French food chain Carrefour. He has also invested in Boo.com and a\nvariety of other online ventures, as well as buying Princess Yachts outright.\n\nArnault began his career working for his father’s manufacturing company. Five\nyears into the position, he convinced his father to liquidate the construction\ndivision and enter the real estate market. Under the name Férinel, the new\ncompany initially developed specialty holiday accommodations. Named a director\nof the company in 1974, he became chief executive in 1977. In 1979, he succeeded\nhis father as president of the company.\n\nIn 1984, with the help of Antoine Bernheim, a senior partner of financier Lazard\nFrères et Cie, Arnault acquired Financière Agache, becoming chief executive and\ntaking control of Boussac, a beleaguered textile company which owned, among\nother assets, Christian Dior and the department store Le Bon Marché. Arnault\nused this foothold in the luxury business to begin building what would become\nthe world’s largest luxury conglomerate.\n\nOver the next 11 years, LVMH’s value multiplied fifteen times over and sales and\nprofit increased fivefold. One of the key factors in the company’s success has\nbeen Arnault’s programme of decentralisation and his efforts to highlight each\nbrand’s heritage, so that each company is viewed independently in its own right.\n\nIn 1993, LVMH acquired Berluti and Kenzo. In the same year Arnault bought out\nthe French economic newspaper La Tribune, which he later sold, reinvesting in\nthe newspaper business by buying Les Echos.\n\nOver the succeeding years, along with scores of acquisitions in the drinks\nmarket, Arnault earned his sobriquet “a wolf in cashmere,” by acquiring\nGivenchy, Guerlain, Marc Jacobs , Sephora, Emilio Pucci, Fendi, Loro Piana,\nNicholas Kirkwood , Thomas Pink, R.M Williams, EDUN, Moynat and Donna Karen,\nalong with a host of jewellery brands, including TAG Heuer, De Beers and\nBulgari. Arnault’s business activities have been interpreted by many as\nindicating the executive is firmly set on acquiring Hermès. However, the Hermès\nfamily has thus far publically rebuffed Arnault’s advances, winning legal action\nagainst LVMH, and taking steps to prevent further investment in Hermès by\nArnault. \n\nIn October 2020, Arnault closed the acquisition of Tiffany to join LVMH. The\nacquisition adds to Arnault’s luxury group.\n\nArnault has been married twice and has five grown children, four of whom —\nDephine, Antoine, Alexandre and Frédéric — work within the business. According\nto Forbes, he is the richest man in Europe and fourth-richest in the world.",
        "summary": "Arnault began his career working for his father’s manufacturing company. In 1984, with the help of Antoine Bernheim, a senior partner of financier Lazard Frères et Cie, Arnault acquired Financière Agache. LVMH acquired Berluti and Kenzo in 1993, along with scores of acquisitions.",
        "source": "The Business of Fashion",
        "sentiment": 0.11433372274041176,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-07-05",
        "title": "Arnault Family Reshuffle Expected As Succession Drama At LVMH Continues",
        "link": "https://www.watchpro.com/arnault-family-reshuffle-expected-as-succession-drama-at-lvmh-continues/",
        "content": "LVMH is declining to comment on a Neue Zürcher Zeitung (NZZ) report that\nFrédéric Arnault, son of the group’s chairman and chief executive Bernard\nArnault, is moving to a senior role at Bulgari after three year’s as CEO of TAG\nHeuer.\n\nSwitzerland’s leading German language newspaper NZZ reports that Julien Tornare,\nwho has been viewed as a rising star within the conglomerate after successfully\ntransforming Zenith since taking over as CEO in 2017, will take over from\nFrédéric Arnault at TAG Heuer.\n\nRespected NZZ business editor Dr. Andrea Martel says well-informed sources\nshared the information, but has not had it confirmed by LVMH.\n\nThe Arnault family has taken leading roles within the watchmaking operations of\nLVMH in recent years, despite them making up only a small fraction of the\ngroup’s revenue.\n\nMorgan Stanley estimates combined sales from its watchmakers at €2.1 billion\nfrom group turnover of €79.2 billion in 2022.\n\nJean Arnault, the youngest of the five Arnault children, joined La Fabrique du\nTemps, which makes watches for Louis Vuitton and Daniel Roth, as business as\ndirector of marketing and development.\n\nMaster watchmakers Michael Navas and Enrico Barbasini still run operations, but\nJean Arnault is director of watches for Louis Vuitton, and effectively setting a\nnew path for La Fabrique du Temps, including a new plan to make watches under\nthe Gerald Genta name.\n\nBernard Arnault, who has been described as the world’s richest man this year as\nLVMH’s share price has risen and major tech stocks have cooled, is said to be\ngrooming his five children from two marriages to take over the empire.\n\nHis eldest, Delphine, is considered the front runner to take over the reigns at\nLVMH from her 74-year-old father.\n\nShe became chief executive of Dior, the group’s second largest brand, earlier\nthis year.\n\nPreviously, she was deputy CEO of Louis Vuitton, LVMH’s biggest maison.\n\nAntoine Arnault is CEO and vice chairman of LVMH holding company Christian Dior\nSE as well as CEO of Berluti and chairman of Loro Piana.\n\nAlexandre Arnault is busily transforming Tiffany & Co. following LVMH’s\nacquisition of the global luxury jeweller for $16 billion in 2020.\n\nBulgari’s jewellery business is larger than all LVMH sales from watches, so a\nmove there from TAG Heuer would give Frédéric Arnault broader experience.\n\nNZZ’s report is unclear on whether Mr Arnault would report to Jean Christophe\nBabin, the current CEO at Bulgari.\n\nThe family reportedly gets together for business breakfasts whenever possible to\nshare ideas on how the different arms of the business are performing.",
        "summary": "Bernard Arnault, who has been described as the world’s richest man this year, is said to be grooming his five children from two marriages to take over the empire. The Arnault family has taken leading roles within the watchmaking operations of LVMH in recent years.",
        "source": "WatchPro",
        "sentiment": 0.07250257581472397,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-05-02",
        "title": "LVMH Succession Planning: Arnault to Keep it in the Family ",
        "link": "https://www.thefashionlaw.com/lvmh-succession-planning-arnault-appears-to-be-keeping-it-in-the-family/",
        "content": "In the world of luxury and heritage, while brands, themselves, have largely\ntransformed from small family-owned entities to conglomerate-owned companies, a\nnumber of luxury’s biggest groups are owned and managed by the original founding\nfamily. The issue of succession planning, therefore, can be particularly\nimportant. This has recently come to the fore for the founder of the world’s\nlargest luxury conglomerate, LVMH, French billionaire Bernard Arnault, as there\nhas been much speculation over Arnault’s succession plan. The 75-year-old\nfounder, chairman, and CEO of LVMH raised his retirement age from 75 to 80 in\n2022, which should keep him at the helm of the €440 billion empire for another\nfew years at least. \n\nSuccession speculation ramped up again this month when two more of Arnault’s\nfive children were appointed to the LVMH board at the group’s annual\nshareholders meeting in Paris, with LVMH shareholders giving the greenlight\nto the nominations of Alexandre and Frederic Arnault, who will join their older\nsiblings, Delphine and Antoine Arnault. The move leaves just one offspring,\nyoungest son Jean, without a seat (although he is employed at the firm). It also\ngives the family 48.6 percent of LVMH’s share capital and 64.3 percent of the\nvoting rights.\n\nIn light of the changing nature of luxury consumption, prompted by globalization\nin the sector and an influx of younger luxury shoppers across the globe, LVMH’s\nlatest succession planning move allows the infusion of fresh perspectives and\nideas, and helps the company to be agile and adapt to evolving tastes and\ntrends. After all, the two latest Arnault appointments are young – aged just 29\nand 31. Beyond merely an aim to bring younger members into the fold, a\nwell-executed succession plan also provides stakeholders with a sense of\nstability and confidence in the business’s trajectory, mitigating uncertainties\nand fostering trust in the brand’s resilience.\n\n\nTHE WORKINGS OF A CONGLOMERATE\n\nLVMH is not the only luxury group with familial management. Others, including\nHermès, Chanel, Richemont, and Prada, among others, also adhere to this\ntradition. But LVMH – which boasts a glittering portfolio of brands ranging from\nLouis Vuitton, Fendi, Celine, Bulgari, Hublot, and TAG Heuer to Moët & Chandon –\nstands out as the largest multi-brand luxury conglomerate predominantly\ncontrolled by a single family. This wide array of strong brands provides LVMH\nwith distinct advantages, including economies of scale, diversified revenue\nstreams and increased bargaining power with suppliers and retailers. \n\nAt the same time, multi-brand luxury conglomerates like LVMH also face unique\nchallenges compared to mono-brand enterprises. First, harmonizing brand\nidentities and ensuring consistency across product lines and market segments\nposes a formidable task. Each brand boasts its own lineage, ethos, and customer\nbase, which need to be carefully navigated to preserve individual\nidentities. Resource allocation across brands with diverse needs demands a\ndelicate equilibrium. Investment decisions must align with each brand’s growth\npotential, market positioning and strategic objectives, while also safeguarding\nthe conglomerate’s overall financial health and longevity. \n\nStill yet, internal competition between the brands for market share, resources\nand talent means there needs to be clear delineation of roles and mechanisms.\nCollaboration without encroaching on brand autonomy is the name of the game.\n\n\nFAMILY STRATEGY V. LOOKING OUTSIDE\n\nBernard Arnault’s career at LVMH spans several decades, marked by bold\nacquisitions and strategic expansions, and real estate prowess. Under his\nstewardship, LVMH has emerged as a global powerhouse. In his succession plan for\nLVMH, Arnault has strategically positioned his children – Antoine, Delphine, and\nAlexandre – in key leadership roles within the company. Antoine Arnault, the\neldest son, has emerged as a prominent figure within the firm, responsible for\nguiding the strategic direction of LVMH’s retail businesses. Delphine Arnault,\nthe eldest daughter, holds an important position within LVMH’s fashion division,\nwhich encompasses some of the world’s most iconic luxury brands. As the\nexecutive vice president of Louis Vuitton, Delphine oversees the strategic\ndevelopment and expansion of the brand. Alexandre Arnault has been entrusted\nwith spearheading LVMH’s technology and digital initiatives, reflecting the\nconglomerate’s approach to innovation and growth.\n\nIt can sometimes pay dividends to keep things in the family. However,\nconsidering the challenges associated with heritage conglomerates, such as LVMH,\nappointing an external leader can offer certain advantages. External leaders,\nfor instance, can bring fresh perspectives and impartiality, unhampered by\ntricky familial biases or dynamics. This impartiality can be invaluable in\nnavigating intra-group conflicts, fostering collaboration between brands, and\npropelling innovation. \n\nBringing in an outsider can also mitigate risks tied to family dynamics, such as\nconflicts of interest or succession-related tensions, fostering a meritocratic\nculture where qualifications and performance are given priority. But when a\nbrand is so closely tied to one family name, introducing an external leader may\nlead to resistance from family members worried about a departure from\ntradition. \n\nPlus, the process of assimilating an external leader into the organization’s\nethos and aligning their vision with long-term strategic objectives can be a\nfine line to tread, and stakeholders must also be on board.\n\nSuccession planning in the luxury sector is a complex process that requires a\ncareful balance of tradition, innovation, and leadership. It serves as a\ncustodian of the brand’s essence and a safeguard of its legacy in a complex\nmarketplace. Getting the succession plan right, whether that means keeping\nthings in the family or looking outside for new leadership, is crucial to\nmaintain continuity and prosperity.\n\n--------------------------------------------------------------------------------\n\nQing Wang is a Professor of Marketing and Innovation and the Director, Marketing\nInnovation at Warwick Business School. (This article was initially published by\nThe Conversation.)",
        "summary": "French billionaire Bernard Arnault is the founder of the world’s largest luxury conglomerate, LVMH. The 75-year-old has raised his retirement age from 75 to 80 in 2022, which should keep him at the helm of the €440 billion empire for another few years at least. Two more of Arnault's five children were appointed to the LVMh board at the group's annual shareholders meeting in Paris.",
        "source": "The Fashion Law",
        "sentiment": 0.145771112293005,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-04-18",
        "title": "Two sons of world’s richest man Bernard Arnault join him on board of LVMH",
        "link": "https://www.theguardian.com/business/2024/apr/18/two-sons-of-worlds-richest-man-bernard-arnault-join-him-on-board-of-lvmh",
        "content": "Two sons of the world’s richest man, Bernard Arnault, have joined the board of\nLVMH after a shareholder vote, further cementing the family’s control of the\nFrench luxury goods company.\n\nThe pair joined their elder siblings on the board of directors of the company,\nwhich houses brands such as Dior and Louis Vuitton, meaning four of Bernard\nArnault’s five children now sit on the board.\n\nAlexandre, 31, is the executive vice-president of Tiffany, while Frédéric, 29,\nis the CEO of Swiss luxury watchmaker Tag Heuer.\n\nThe Forbes magazine currently lists Bernard Arnault, and his family, as the\nworld’s richest person, with a fortune of $214bn (£172bn), ahead of Amazon\nfounder Jeff Bezos and Elon Musk, who heads Tesla and X.\n\nEach son got a vote of more than 93% at the shareholder meeting, with the\nresults coming as no surprise.\n\nThe Arnault family group holds 48.6% of LVMH’s capital and 64.3% of the votes, a\nfact Arnault acknowledged shortly ahead of the proceedings.\n\n“I’ve got the majority of votes, so …” he said.\n\nTwo other children from a previous marriage, Delphine, 49, and Antoine, 46, are\nalready board members, but the youngest sibling, Jean, 26, still has to wait his\nturn.\n\n“He has time, he’s young,” said the 75-year-old founder.\n\nskip past newsletter promotion\n\nafter newsletter promotion\n\nLVMH (Moët Hennessy Louis Vuitton) also nominated Wei Sun Christianson to\nsucceed Antonio Belloni, the group’s number two, who announced his departure at\nthe end of March.\n\nChristianson, who joins from American investment bank Morgan Stanley, is “a\ngreat expert on business in China”, said Arnault, stressing the value of the\ncountry’s market.\n\n“The group has a strong presence in China, so it’s important to have precise\nviews on what’s happening,” he added.",
        "summary": "Alexandre, 31, is executive vice-president of Tiffany, while Frédéric, 29, is the CEO of Swiss luxury watchmaker Tag Heuer. Four of Bernard Arnault’s five children now sit on the board of LVMH.",
        "source": "theguardian.com",
        "sentiment": 0.06812789291143417,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2023-09-14",
        "title": "Bernard Arnault Built a Luxury Empire on ‘Desirability.’ Who Will Inherit It?",
        "link": "https://www.nytimes.com/2023/09/14/business/bernard-arnault-lvmh-family-succession.html",
        "content": "Business|Bernard Arnault Built a Luxury Empire on ‘Desirability.’ Who Will\nInherit It?\n\nhttps://www.nytimes.com/2023/09/14/business/bernard-arnault-lvmh-family-succession.html\n\nYou have a preview view of this article while we are checking your access. When\nwe have confirmed access, the full article content will load.\n\n\nBernard Arnault, in front of a painting by Jean Dubuffet, outside his office at\nthe Paris headquarters of LVMH Moët Hennessy Louis Vuitton.Credit...Jean\nDubuffet/Artists Rights Society (ARS), New York/ADAGP, Paris; Dmitry Kostyukov\nfor The New York Times\n\n\nBERNARD ARNAULT BUILT A LUXURY EMPIRE ON ‘DESIRABILITY.’ WHO WILL INHERIT IT?\n\n\n\nWith brands like Tiffany, Dom Pérignon and Louis Vuitton, LVMH turned him into\none of the world’s richest men. But with five children, he has a hard decision\nto make.\n\nBernard Arnault, in front of a painting by Jean Dubuffet, outside his office at\nthe Paris headquarters of LVMH Moët Hennessy Louis Vuitton.Credit...Jean\nDubuffet/Artists Rights Society (ARS), New York/ADAGP, Paris; Dmitry Kostyukov\nfor The New York Times\n\n * Sept. 14, 2023\n\nOne afternoon in July, not long after being named the wealthiest man on the\nplanet by Forbes, Bernard Arnault, the head of the LVMH Moët Hennessy Louis\nVuitton luxury goods empire, took his place on a stage with a view of the Eiffel\nTower before a packed crowd of French dignitaries and reporters.\n\nIn the front row sat four of his five adult children — the fifth was watching\nfrom New York, where he is an executive at Tiffany & Company. Their father had\nraised all of them since they could walk to one day run the LVMH conglomerate.\n\nThe occasion was Mr. Arnault’s announcement that LVMH would provide 150 million\neuros (about $161 million) to sponsor the 2024 Paris Olympics. LVMH companies\nwill play a starring role. Chaumet, a Paris jeweler whose clients once included\nNapoleon’s wife Joséphine, will design the Olympic medals, and Moët Hennessy\nwines will flow in hospitality suites.\n\n“The partnership will help promote France throughout the world,” Mr. Arnault\ndeclared. As television cameras zoomed in, his eldest son, Antoine, the head of\ncommunications and image for LVMH, uttered what could be a tagline for this huge\ncompany his father has built: “For a dream, there is no price.”\n\nIt was a moment of public triumph for Mr. Arnault, a sign of how embedded in the\nfabric of France LVMH has become. Over more than 30 years, he has forged LVMH\ninto the world’s largest luxury group and the most valuable company in France,\nwith a presence in 81 countries. His brands — 75 of them — are the stars of the\nluxury world, including Louis Vuitton, Christian Dior, Tiffany and Dom Pérignon\nChampagne. It has given him entree to prime ministers and presidents, and\nallowed him to amass a museum-worthy art collection.\n\nImage\n\nMr. Arnault with Anne Hidalgo, mayor of Paris, and Thomas Bach, left, the\npresident of the International Olympic Committee.Credit...Dmitry Kostyukov for\nThe New York Times\n\n--------------------------------------------------------------------------------\n\nThank you for your patience while we verify access. If you are in Reader mode\nplease exit and log into your Times account, or subscribe for all of The Times.\n\n--------------------------------------------------------------------------------\n\nThank you for your patience while we verify access.\n\nAlready a subscriber? Log in.\n\nWant all of The Times? Subscribe.",
        "summary": "With brands like Tiffany, Dom Pérignon and Louis Vuitton, LVMH turned him into one of the world’s richest men. But with five children, he has a hard decision to make. You have a preview view of this article while we are checking your access. When you have confirmed access, the full article content will load.",
        "source": "The New York Times",
        "sentiment": 0.03248119354248047,
        "keywords": [],
        "categories": [],
        "image": null
    }
]