[
    {
        "publication_date": "None",
        "title": "New World Development Co. Ltd.",
        "link": "https://asia.nikkei.com/Companies/New-World-Development-Co.-Ltd",
        "content": "New World Development is a Hong Kong conglomerate mainly focused on property\ndevelopment, hotels, department stores, infrastructure and services. The company\noperates businesses in more than 50 cities in Asia with a total asset value of\n300 billion Hong Kong dollars ($39.4 billion).\n\nIt owns three listed companies -- New World China Land, NWS Holdings and New\nWorld Department Store China. The company is expanding its businesses in\nmainland China, investing $16 billion in more than 20 provinces across the\ncountry.\n\nNew World Development plans to improve the efficiency of the group's hotel\noperations. In 2015, it sold interests in three upscale hotels to a joint\nventure with Abu Dhabi Investment Authority for HK$18.5 billion. The hotels are\nGrand Hyatt Hong Kong, Renaissance Harbour View, and Hyatt Regency TST.\n\nHong Kong billionaire Henry Cheng Kar-shun became chairman of New World\nDevelopment in 2012. His family holds a 42% stake in the company as the largest\nshareholder. He also leads Chow Tai Fook Jewellery Group, Hong Kong's largest\njewelry retailer.",
        "summary": "Hong Kong billionaire Henry Cheng Kar-shun became chairman of New World Development in 2012. His family holds a 42% stake in the company as the largestshareholder. He also leads Chow Tai Fook Jewellery Group, Hong Kong's largestjewelry retailer.",
        "source": "asia.nikkei.com",
        "sentiment": 0.4421143103390932,
        "keywords": [],
        "categories": [],
        "image": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fasia.nikkei.com%2Fbundles%2Fapp%2Fimages%2FNikkei-Asia-Square-Logo.png?width=630&height=630&fit=cover&gravity=faces&source=nar-cms"
    },
    {
        "publication_date": "None",
        "title": "New World Development: Latest News and Updates | South China Morning Post",
        "link": "https://www.scmp.com/topics/new-world-development",
        "content": " * The conglomerate sold a 30 per cent stake in the North tower of the Shenzhen\n   Qianhai Chow Tai Fook Finance Centre to parent Chow Tai Fook Enterprises\n\nCompany says it has secured multiple low-cost new loans to replenish its\nliquidity and increase the proportion of yuan loans as it seeks to control\nfinancing costs.\n\n24 Jun 2024 - 10:24PMvideocam\n\nThe mixed-use project, close to Fanling and Sheung Shui, will include a\nresidential component with some 2,000 flats. It will cover 150,000 sq ft and\nwill have a total buildable floor area of over 1 million sq ft.\n\nThe first 18 office units have been priced from HK$7.2 million to HK$22.7\nmillion, or around HK$12,000 to HK$14,000 per square foot, NWD said in a\nstatement on Thursday.\n\nJewellery chain Chow Tai Fook promises more technology-led shopping because\n‘that’s what younger customers want’.\n\n‘Impact Link’, or iLink, underscores Hong Kong’s determination to harness its\nstrengths and resources to drive positive change and to assist family offices in\nusing ‘wealth for good’, Financial Secretary Paul Chan says.\n\nNew home sales in Hong Kong stuttered slightly on Friday, with buyers giving a\nlukewarm response to Henderson Land Development’s latest project in Tai Kok\nTsui.\n\n22 Mar 2024 - 10:05PMvideocam\n\nSome 238 of the 336 units available in the first batch at Uptown East in Kowloon\nBay, worth about US$179 million, found buyers as of 6pm on Sunday, in a sign\nthat the removal of all market-cooling measures has revived demand in Hong Kong.\n\nHong Kong’s largest developer by market capitalisation is being tipped by\nanalysts to emerge as the ‘prime beneficiary’ of the city’s removal of all\nproperty cooling measures.\n\nNew World Development has agreed to sell its shopping centre and parking spaces\nin Tsuen Wan to Chinachem Group for US$510 million, speeding up asset sales to\ntrim its financing costs.\n\n1 Mar 2024 - 4:39PMvideocam\n\nNWD plans to launch 2,500 units ahead of schedule to capture the improved\nsentiment unleashed by the withdrawal of all property curbs in Hong Kong after\nposting a profit decline for the six months ending on December 31.\n\nCity leader John Lee is the only government official set to contribute extra to\npublic coffers under finance chief’s plan to introduce two-tiered standard rates\ntax regime.\n\n28 Feb 2024 - 11:08PMvideocam\n\nProperty agents say they expect sales to increase as a result of the end of\ncurbs.\n\nHong Kong developers have joined a chorus urging the government to remove all\nthe remaining cooling measures to revive the property sector.\n\nTransparency call comes after it was revealed on Friday organisers of the\n‘Chubby Hearts’ were in line for HK$7.8 million in government cash.\n\nAnya Hindmarch-designed giant heart-shaped balloons will float in Central’s\nStatue Square Gardens and elsewhere from Valentine’s Day until February 24.\n\nThe family of Henry Cheng, Hong Kong’s third-richest person, wants to replace\nCEO Peter Lau with Colin Currie and also appoint two of Henry’s children, Sonia\nand Christopher, as non-executive directors.\n\nA HK$10 billion property development venture in the city’s Northern Metropolis\nindicated Beijing-controlled China Resources Land’s support for Hong Kong’s\neconomic development, the chief of the state-backed company said.\n\nThe state-controlled conglomerate joined forces with Hong Kong’s New World\nDevelopment on a venture worth US$1.28 billion in the city’s Northern Metropolis\nmega project, according to sources familiar with the matter.\n\n27 Dec 2023 - 6:00AMvideocam\n\nHong Kong is gearing up to host the 17th Asian Financial Forum 2024, the first\nmajor international financial and business event of the year, aimed at\nhighlighting the city’s significance as an international financial centre.\n\nHong Kong developer bought back 15 per cent of its existing dollar-based bonds.\nInvestors holding its notes maturing in 2029, and perpetual securities issued in\n2021, offered to sell the biggest chunks.\n\n5 Dec 2023 - 5:37PMvideocam\n\nConroy Cheng, Chow Tai Fook’s vice-chairman and nephew of Henry Cheng, said\nthere was no discord or disputes in the family over succession plans following\nan interview by the patriarch last week.\n\n24 Nov 2023 - 12:22PMvideocam\n\nHong Kong developer, controlled by the city’s third-richest Cheng family, offers\nto buy back US$600 million of its bonds at above market prices to trim its debt\nload. It completed a US$2.8 billion asset sale this week.\n\nFacing low foot traffic and a surge in cross-border shopping, New World\nDevelopment and Nan Fung Development are among the landlords experimenting with\nnew concepts to catalyse a rebound.\n\nBuyout by family led by billionaire Henry Cheng will see New World Development\nreceive HK$21.75 billion (US$2.8 billion) to ease its debt burden and pay a\nspecial dividend of about HK$4 billion.\n\nChief Executive John Lee says US$450 million belt and road agreements part of\ndrive to strengthen city’s role in China’s international trade plan.\n\n11 Skies, touted as Hong Kong’s largest indoor entertainment hub, is adding\nVquarium, the city’s first-ever ‘virtual deep-ocean adventure experience’, to\nits list of attractions, as landlords beef up entertainment offerings in\nshopping malls.\n\n2 Oct 2023 - 9:00AMvideocam\n\nCompany reports a 28 per cent decline in profit attributable to shareholders and\ncuts final dividend by 80 per cent to ‘retain cash and strength’, CEO Adrian\nCheng says.\n\nNew World Development sold more than 10 billion yuan (US$1.37 billion) worth of\nresidential projects in mainland China in the first eight months of the year,\nthe company said in a statement on Monday.\n\nHong Kong’s property market has seen a marked slowdown this year, with only 55\nper cent of the 7,600 flats completed in the first half sold as of end-June,\ncompared with 78 per cent over the last five years.",
        "summary": "New World Development has agreed to sell its shopping centre and parking spaces to Chinachem Group for US$510 million. New home sales in Hong Kong stuttered slightly on Friday, with buyers giving alukewarm response to Henderson Land Development’s latest project in Tai Kok Tsui.",
        "source": "scmp.com",
        "sentiment": 0.339932844042778,
        "keywords": [],
        "categories": [],
        "image": "https://assets-v2.i-scmp.com/production/_next/static/media/default-image.d1be8967.png"
    },
    {
        "publication_date": "2024-06-28 00:00:00",
        "title": "New World Courts Creditors With Asset Sale, Bond Redemption Plan - Bloomberg",
        "link": "https://www.bloomberg.com/news/articles/2024-06-27/new-world-tells-investors-it-will-try-to-pay-perp-bond-next-year",
        "content": "New World Development Co. plans to redeem a perpetual bond and complete $1 billion of non-core asset sales as the Hong Kong-based property company tries to revive confidence in its financial health. \nNew World told some investors on Tuesday that it would try to redeem its perpetual bond callable in March 2025, and that the coupon would be much higher than the company’s average funding cost of 5% if it forgoes the call option. The bond was indicated at 95.7 cents on the dollar on Thursday, according to Bloomberg-compiled data.",
        "summary": "New World Development Co. plans to redeem a perpetual bond and complete $1 billion of non-core asset sales. New World told some investors on Tuesday that it would try to redeem its perpetual bond callable in March 2025. The bond was indicated at 95.7 cents on the dollar on Thursday.",
        "source": "Bloomberg.com",
        "sentiment": -0.04044749028980732,
        "keywords": [],
        "categories": [],
        "image": "https://assets.bwbx.io/s3/lightsaber/_next/static/media/social-markets.e062a0c0.jpg"
    },
    {
        "publication_date": "2024-07-03 00:00:00",
        "title": "New World Sells HK Apartments at Lowest Price in Eight Years - Bloomberg",
        "link": "https://www.bloomberg.com/news/articles/2024-07-04/new-world-sells-hk-apartments-at-lowest-price-in-eight-years",
        "content": "Hong Kong developers New World Development Co. and Far East Consortium International Ltd. are selling a residential project at the lowest price in eight years for the district, as competition for buyers intensifies amid high inventory.\nThe pair are marketing the first batch of apartments in The Pavilia Forest I at an average of HK$17,188 ($2,200) per square foot, the cheapest in the middle-class neighborhood of Kai Tak in eight years, according to Midland Realty. The pricing also represents an almost 30% discount to other projects in the area. ",
        "summary": "The Pavilia Forest I is the cheapest in the middle-class neighborhood of Kai Tak in eight years. Developers New World Development Co. and Far East Consortium International Ltd. are marketing the first batch of apartments at an average of HK$17,188 ($2,200) per square foot.",
        "source": "Bloomberg.com",
        "sentiment": -0.04044749028980732,
        "keywords": [],
        "categories": [],
        "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ie6RMSk7BqTs/v0/1200x800.jpg"
    },
    {
        "publication_date": "2024-06-26 00:00:00",
        "title": "New World Development Recognised in TIME Magazine's  Top 50 'World&#8217;s Most Sustainable Companies' ",
        "link": "https://markets.businessinsider.com/news/stocks/new-world-development-recognised-in-time-magazine-s-top-50-world-8217-s-most-sustainable-companies-1033507044",
        "content": "\nEQS Newswire / 26/06/2024 / 13:00 CET/CEST\n\n\nHONG KONG SAR - Media OutReach Newswire - 26 June 2024 - New World Development\nCompany Limited (\"NWD\" or \"New World Development\" or the \"Group\"; Hong Kong\nStock Code: 00017) is pleased to announce that it has been recognised by TIME\nMagazine as one of the \"World's Most Sustainable Companies of 2024,\" an\ninaugural list that names top 500 companies in the world promoting corporate\nresponsibility and advancing sustainable practices. Among the top 500 companies,\nNWD is ranked 43rd. The Group has been recognised in major areas of\nEnvironmental, Social, and Governance (ESG), including climate change actions,\nenergy conservation and emission reduction, successfully standing out from over\n5,000 companies to make it into the top 50.\n\nNWD Named One of TIME's Top 50 World's Most Sustainable Companies\n\nThe TIME's list is jointly organised by TIME and the statistics company\nStatista. Commenting on NWD's inclusion in the world's top 50 most sustainable\ncompanies, Adrian Cheng, CEO of NWD, said, \"We are very pleased that New World\nhas been selected as one of the world's top 50 most sustainable and impactful\ncompanies, affirming our achievements in sustainable development. We have\nproactively incorporated sustainability into our business models to develop\ngreen buildings, reduce carbon emissions and energy intensity, and support the\ntransition to a low-carbon economy. Building on this amazing accolade, we will\ncontinue our efforts towards the sustainable development of the company to\ncreate value for our stakeholders and a positive rippling effect across our\ncommunity and society.\"\n\nThe World's Most Sustainable Companies list rewards the leading companies in\ncorporate social responsibility with an evaluation based on more than 20\nindicators relating to sustainable development, information disclosure,\ntransparency, overall ESG performance, energy and carbon intensity, and female\nleadership, and commitments and targets set in these areas. The ranking process\nbegan with a comprehensive selection from over 5,000 of the world's largest and\nmost influential companies. From there, 500 companies from over 30 countries and\nregions were chosen. New World Development ranked 43rd and is the only Hong Kong\ncompany to make it into the top 50.\n\nNWD has long been actively promoting ESG. The Group highly values sustainable\ndevelopment throughout the project lifecycle, aiming to achieve best practices\nfrom planning and design to operation and management, minimising environmental\nimpact. The Group's short-term 1.5°C science-based targets have been approved by\nthe Science Based Targets initiative (SBTi), and the Group has committed to\nsetting long-term targets in line with SBTi's Net-Zero Standard.\n\nThe Group has also developed a Renewable Energy Roadmap, aiming to achieve 100%\nrenewable energy use in its rental properties in the Greater Bay Area and\nGreater China by the fiscal years 2026 and 2031, respectively, to reduce\ngreenhouse gas emissions. The Group also strives to install renewable energy\ngeneration systems in new and existing projects, promoting the broader\ndevelopment of the renewable energy market.\n\nAdditionally, NWD has integrated climate considerations into its risk management\nprocess investment decision-making. The Group was an early supporter of the Task\nForce on Climate-related Financial Disclosures (TCFD), formulating and\nimplementing the \"Climate Resilience Guideline\" and incorporating climate change\nmitigation and adaptation measures into various stages such as design, major\nrefurbishments and construction activities. Currently, New World has conducted\npreliminary climate-related risk assessments at multiple locations in Hong Kong\nand Mainland China and has conducted more in-depth surveys on assets identified\nas potentially high-risk to appropriately mitigate climate-related risks.\n\nNWD is one of Hong Kong's leading companies in promoting sustainable finance. In\n2018, the Group's property K11 ATELIER King's Road received triple platinum\ncertifications for WELL Building Standard, LEED, and Hong Kong's BEAM Plus,\nsuccessfully securing Hong Kong's first green loan. Additionally, the Group\npartnered with DBS Hong Kong to achieve Asia's first loan linked to the Global\nReal Estate Sustainability Benchmark (GRESB) performance. New World is also the\nworld's first developer to issue a s USD-denominated social and green dual\ntranche offering in the public bond markets.\n\nThe Group is also a leading force in promoting workplace diversity and\ninclusivity. NWD's female representation on board has reached 35.3%, among the\nhighest of Hong Kong-listed companies. In addition, the Group has implemented a\nseries of measures and social innovation programmes to support employees' mental\nand physical wellbeing.\n\nPlease download high-res images from here:\n\nhttps://nwdrive.nwplatform.com.cn:443/link/EBECB3228A31C58AEEF0560F11B09397\n\nValid Until: 2024-07-09 23:59\nPassword: T75V\nHashtag: #NewWorldDevelopment #NWD\n\nThe issuer is solely responsible for the content of this announcement.\n\nABOUT NEW WORLD DEVELOPMENT\n\nFounded in 1970, New World Development Company Limited (\"The Group\", Hong Kong\nstock code: 0017) was publicly listed in Hong Kong in 1972 and is a constituent\nstock of the Hong Kong Hang Seng Index. A premium brand infused with a unique\npersonality best defined by The Artisanal Movement, New World Group's core\nbusiness areas include property development, property investment and other\nstrategic operations in Greater China, especially the Greater Bay Area, with a\ntotal asset value of approximately HK$470.2 billion as at 31 December 2023. The\nGroup has an effective interest of approximately 75% in New World Department\nStore China Limited (Hong Kong stock code: 0825) and wholly owns New World China\nLand Limited.\n\n\nNews Source: New World Development\n\n\n26/06/2024 Dissemination of a Financial Press Release, transmitted by EQS News.\nThe issuer is solely responsible for the content of this announcement.\n\nMedia archive at www.todayir.com",
        "summary": "New World Development named one of TIME's Top 50 World's Most Sustainable Companies of 2024. New World Development ranked 43rd and is the only Hong Kong company to make it into the top 50. NWD is one of Hong Kong's leading companies in promoting sustainable finance.",
        "source": "markets.businessinsider.com",
        "sentiment": 0.6102253952994943,
        "keywords": [],
        "categories": [],
        "image": "https://images.media-outreach.com/Images/Thumb/550x/508244/508244-image-1-png-550x.png"
    },
    {
        "publication_date": "2024-02-29 00:00:00",
        "title": "New World to Cut $1 Billion of Non-Core Assets to Trim Debt - Bloomberg",
        "link": "https://www.bloomberg.com/news/articles/2024-02-29/new-world-core-profit-reaches-hk-4-9-billion-amid-debt-concerns",
        "content": "New World Development Co. is planning to trim HK$8 billion ($1 billion) worth of non-core assets this financial year, as concerns about debt dampens share prices. \nThe company announced the plans after first-half core profit rose 12% to HK$4.87 billion, following the discontinuation of some operations, it said in a filing on Thursday.",
        "summary": "The company announced the plans after first-half core profit rose 12% to HK$4.87 billion, following the discontinuation of some operations. New World Development Co. is planning to trim HK$8 billion ($1 billion) worth of non-core assets this financial year.",
        "source": "Bloomberg.com",
        "sentiment": -0.04044749028980732,
        "keywords": [],
        "categories": [],
        "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iLTWQJ.rPg98/v3/1200x800.jpg"
    },
    {
        "publication_date": "2024-02-29 00:00:00",
        "title": "New World Development Sells Hong Kong Mall D-PARK for $514 Million - Bloomberg",
        "link": "https://www.bloomberg.com/news/articles/2024-03-01/new-world-development-sells-hong-kong-mall-for-514-million",
        "content": "New World Development Co. sold a shopping mall for HK$4.02 billion ($514 million) as part of its plan to improve financial health by offloading non-core assets.\nThe company sold all of its interest in D-PARK and its parking space in the Tsuen Wan area in Hong Kong to local developer Chinachem Group, it said in a statement on Friday. The company will continue disposal of assets, it added.",
        "summary": "The company sold all of its interest in D-PARK and its parking space in the Tsuen Wan area in Hong Kong to local developer Chinachem Group. New World Development Co. will continue disposal of assets, it added. The company is trying to improve financial health by offloading non-core assets.",
        "source": "Bloomberg",
        "sentiment": -0.04044749028980732,
        "keywords": [],
        "categories": [],
        "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iLppkcOMp2rU/v1/1200x800.jpg"
    },
    {
        "publication_date": "2024-07-10 00:00:00",
        "title": "Emerging Market Economy: Definition, How It Works, and Examples ",
        "link": "https://www.investopedia.com/terms/e/emergingmarketeconomy.asp",
        "content": "WHAT IS AN EMERGING MARKET ECONOMY?\n\nAn emerging market economy is the economy of a developing nation that's becoming\nmore engaged with global markets as it grows. Countries classified as emerging\nmarket economies are those with some but not all of the characteristics of a\ndeveloped market.\n\nCharacteristics of developed markets can include strong economic growth, high\nper capita income, liquid equity and debt markets, accessibility by foreign\ninvestors, and a dependable regulatory system.\n\nIt typically becomes more integrated with the global economy as an emerging\nmarket economy develops. It can have increased liquidity in local debt and\nequity markets, increased trade volume, and foreign direct investment. It can\ndevelop modern financial and regulatory institutions. Some notable emerging\nmarket economies include India, Mexico, Russia, Iran, Saudi Arabia, China, and\nBrazil.\n\nAn emerging market economy is transitioning from a low-income, less developed,\noften pre-industrial economy toward a modern, industrial economy with a higher\nstandard of living.\n\n\nKEY TAKEAWAYS\n\n * An emerging market economy is one that's transitioning into a developed\n   economy.\n * Emerging market economies typically feature a unified currency, stock market,\n   and banking system. They're in the process of industrializing.\n * Emerging market economies can offer greater returns to investors due to their\n   rapid growth.\n * They also offer greater exposure to some inherent risks due to their status.\n * Emerging markets typically adopt reforms that are seen in developed markets\n   over time.\n\n\nUNDERSTANDING AN EMERGING MARKET ECONOMY\n\nInvestors seek emerging markets for the prospect of high returns because these\nmarkets often experience faster economic growth as measured by gross domestic\nproduct (GDP). Higher returns usually come with much greater risk, however.\n\n\nRISKS OF EMERGING MARKETS\n\nRisks can include political instability, domestic infrastructure problems,\ncurrency volatility, and illiquid equity because many large companies may still\nbe state-run or private. Local stock exchanges might not offer liquid markets to\noutside investors.\n\nEmerging markets generally don't have highly developed market and regulatory\ninstitutions like those found in developed nations. Market efficiency and strict\nstandards in accounting and securities regulation are generally not on par with\nadvanced economies such as those of the United States, Europe, and Japan.\n\n\nSIGNS OF PROGRESS\n\nEmerging markets typically have a physical financial infrastructure, including\nbanks, a stock exchange, and a unified currency. A key aspect of emerging market\neconomies is that they adopt reforms and institutions like those of modern\ndeveloped countries over time. This promotes economic growth.\n\nEmerging market economies tend to move away from activities that are focused on\nagricultural and resource extraction toward industrial and manufacturing\nactivities instead. Their governments usually pursue deliberate industrial and\ntrade strategies to encourage economic growth and industrialization. These\nstrategies include export-led growth and import-substituting industrialization.\n\nExport-led growth is more typical of economies that are considered emerging\nbecause it promotes more engagement and trade with the global economy. Emerging\nmarket countries also often pursue domestic programs such as investing in\neducational systems, building physical infrastructure, and enacting legal\nreforms to secure investors' property rights.\n\n\nFRONTIER MARKETS\n\nFrontier markets are usually smaller than emerging markets with lower per capita\nincome, less market liquidity, and less industrialization. They offer attractive\ninvestment opportunities but frontier markets are considered riskier for\ninvestors than emerging markets.\n\n\nHOW EMERGING MARKET ECONOMIES ARE CLASSIFIED\n\nEmerging market economies are classified in various ways. Levels of income,\nquality of financial systems, and growth rates are all popular criteria but the\nexact list of emerging market economies can vary depending on who you ask.\n\nThe International Monetary Fund (IMF) classifies 20 countries as emerging\nmarkets. Morgan Stanley Capital International (MSCI) classifies 24 countries as\nemerging markets. Standard and Poor's (S&P), FTSE Russell, and Dow Jones also\nvary slightly in their classification of countries as emerging markets.\n\nA country can be removed from the list by either upgrading it to developed\nnation status or downgrading it to a frontier nation at any of these\ninstitutions' discretion. Developed nations may likewise be downgraded to an\nemerging market as was the case with Greece. Frontier markets such as Qatar and\nArgentina may be upgraded to emerging markets.\n\n\nWHAT'S AN EMERGING MARKET ECONOMY?\n\nAn emerging market economy is generally considered an economy that's\ntransitioning into a developed market economy. It has rapid GDP growth, growing\nper capita income, increasing debt and equity markets liquidity, and an\nestablished financial system infrastructure.\n\n\nWHAT COUNTRIES ARE CLASSIFIED AS EMERGING MARKETS?\n\nClassifications differ but the so-called BRICS countries represent five emerging\nmarkets with major economic growth and opportunities for investment: Brazil,\nRussia, India, China, and South Africa. The GDPs of these countries have\nincreased steadily from 2000 through 2023. Data for 2024 isn't yet available.\n\nThat trend is expected to continue through the years ahead.\n\n\nDO EMERGING MARKETS MAKE GOOD INVESTMENTS?\n\nThey can make good investments due to their propensity for rapid GDP growth\ncompared to more mature markets but investing in emerging markets can be risky\ndue to potential political instability, lack of dependable information, currency\nfluctuations, lower liquidity, and investment volatility.\n\nInvestors should carefully weigh potential risks and rewards before making any\ninvestment.\n\n\nTHE BOTTOM LINE\n\nCountries that are classified as emerging market economies are those with\neconomies that are transitioning into being developed. They have a unified\ncurrency, stock market, and banking system, and they're in the process of\nindustrializing.\n\nEmerging market economies can be attractive to investors due to their rapid\ngrowth and greater returns but they also involve greater exposure and risk due\nto political instability or currency fluctuation.",
        "summary": "An emerging market economy is transitioning from a low-income, less developed, pre-industrial economy toward a modern, industrial economy. It typically becomes more integrated with the global economy as it develops. It can have increased liquidity in local debt and equity markets, increased trade volume, and foreign direct investment.",
        "source": "Investopedia",
        "sentiment": 0.05157258361577988,
        "keywords": [],
        "categories": [],
        "image": "https://www.investopedia.com/thmb/3cuQDORzGthbLiv0GBFcjOEejbE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/emergingmarketeconomy.asp-FINAL-9eeea54899d645a49ac9a913ee986371.png"
    },
    {
        "publication_date": "2024-07-10 00:00:00",
        "title": "2024 Midyear Investment Outlook | BlackRock Investment Institute",
        "link": "https://www.blackrock.com/us/individual/insights/blackrock-investment-institute/outlook",
        "content": "General disclosure: This material is intended for information purposes only, and\ndoes not constitute investment advice, a recommendation or an offer or\nsolicitation to purchase or sell any securities to any person in any\njurisdiction in which an offer, solicitation, purchase or sale would be unlawful\nunder the securities laws of such jurisdiction. The opinions expressed are as of\nJuly 2024, and are subject to change without notice. Reliance upon information\nin this material is at the sole discretion of the reader. Investing involves\nrisks. This information is not intended to be complete or exhaustive and no\nrepresentations or warranties, either express or implied, are made regarding the\naccuracy or completeness of the information contained herein. This material may\ncontain estimates and forward-looking statements, which may include forecasts\nand do not represent a guarantee of future performance.\n\nIn the U.S. and Canada, this material is intended for public distribution. In\nEMEA, in the UK and Non-European Economic Area (EEA) countries: this is Issued\nby BlackRock Investment Management (UK) Limited, authorised and regulated by the\nFinancial Conduct Authority. Registered office: 12 Throgmorton Avenue, London,\nEC2N 2DL. Tel: + 44 (0)20 7743 3000. Registered in England and Wales No.\n02020394. For your protection telephone calls are usually recorded. Please refer\nto the Financial Conduct Authority website for a list of authorised activities\nconducted by BlackRock. In the European Economic Area (EEA): this is Issued by\nBlackRock (Netherlands) B.V. is authorised and regulated by the Netherlands\nAuthority for the Financial Markets. Registered office Amstelplein 1, 1096 HA,\nAmsterdam, Tel: 020 – 549 5200, Tel: 31-20-549-5200. Trade Register No. 17068311\nFor your protection telephone calls are usually recorded. In Italy, for\ninformation on investor rights and how to raise complaints please go\nto https://www.blackrock.com/corporate/compliance/investor-right available in\nItalian. In Switzerland, for qualified investors in Switzerland: This document\nis marketing material. Until 31 December 2021, this document shall be\nexclusively made available to, and directed at, qualified investors as defined\nin the Swiss Collective Investment Schemes Act of 23 June 2006 (“CISA”), as\namended. From 1 January 2022, this document shall be exclusively made available\nto, and directed at, qualified investors as defined in Article 10 (3) of the\nCISA of 23 June 2006, as amended, at the exclusion of qualified investors with\nan opting-out pursuant to Art. 5 (1) of the Swiss Federal Act on Financial\nServices (\"FinSA\"). For information on art. 8 / 9 Financial Services Act (FinSA)\nand on your client segmentation under art. 4 FinSA, please see the following\nwebsite: www.blackrock.com/finsa For investors in Israel: BlackRock Investment\nManagement (UK) Limited is not licensed under Israel’s Regulation of Investment\nAdvice, Investment Marketing and Portfolio Management Law, 5755-1995 (the\n“Advice Law”), nor does it carry insurance thereunder. In South Africa, please\nbe advised that BlackRock Investment Management (UK) Limited is an authorized\nfinancial services provider with the South African Financial Services Board, FSP\nNo. 43288. In the DIFC this material can be distributed in and from the Dubai\nInternational Financial Centre (DIFC) by BlackRock Advisors (UK) Limited — Dubai\nBranch which is regulated by the Dubai Financial Services Authority (DFSA). This\nmaterial is only directed at 'Professional Clients’ and no other person should\nrely upon the information contained within it. Blackrock Advisors (UK) Limited -\nDubai Branch is a DIFC Foreign Recognised Company registered with the DIFC\nRegistrar of Companies (DIFC Registered Number 546), with its office at Unit\n06/07, Level 1, Al Fattan Currency House, DIFC, PO Box 506661, Dubai, UAE, and\nis regulated by the DFSA to engage in the regulated activities of ‘Advising on\nFinancial Products’ and ‘Arranging Deals in Investments’ in or from the DIFC,\nboth of which are limited to units in a collective investment fund (DFSA\nReference Number F000738). In the Kingdom of Saudi Arabia, issued in the Kingdom\nof Saudi Arabia (KSA) by BlackRock Saudi Arabia (BSA), authorised and regulated\nby the Capital Market Authority (CMA), License No. 18-192-30. Registered under\nthe laws of KSA. Registered office: 7976 Salim Ibn Abi Bakr Shaikan St, 2223\nWest Umm Al Hamam District Riyadh, 12329 Riyadh, Kingdom of Saudi Arabia, Tel:\n+966 11 838 3600. CR No, 1010479419. The information contained within is\nintended strictly for Sophisticated Investors as defined in the CMA Implementing\nRegulations. Neither the CMA or any other authority or regulator located in KSA\nhas approved this information. In the United Arab Emirates this material is only\nintended for -natural Qualified Investor as defined by the Securities and\nCommodities Authority (SCA) Chairman Decision No. 3/R.M. of 2017 concerning\nPromoting and Introducing Regulations. Neither the DFSA or any other authority\nor regulator located in the GCC or MENA region has approved this information. In\nthe State of Kuwait, those who meet the description of a Professional Client as\ndefined under the Kuwait Capital Markets Law and its Executive Bylaws. In the\nSultanate of Oman, to sophisticated institutions who have experience in\ninvesting in local and international securities, are financially solvent and\nhave knowledge of the risks associated with investing in securities. In Qatar,\nfor distribution with pre-selected institutional investors or high net worth\ninvestors. In the Kingdom of Bahrain, to Central Bank of Bahrain (CBB) Category\n1 or Category 2 licensed investment firms, CBB licensed banks or those who would\nmeet the description of an Expert Investor or Accredited Investors as defined in\nthe CBB Rulebook. The information contained in this document, does not\nconstitute and should not be construed as an offer of, invitation, inducement or\nproposal to make an offer for, recommendation to apply for or an opinion or\nguidance on a financial product, service and/or strategy. In Singapore, this is\nissued by BlackRock (Singapore) Limited (Co. registration no. 200010143N). This\nadvertisement or publication has not been reviewed by the Monetary Authority of\nSingapore. In Hong Kong, this material is issued by BlackRock Asset Management\nNorth Asia Limited and has not been reviewed by the Securities and Futures\nCommission of Hong Kong. In South Korea, this material is for distribution to\nthe Qualified Professional Investors (as defined in the Financial Investment\nServices and Capital Market Act and its sub-regulations). In Taiwan,\nindependently operated by BlackRock Investment Management (Taiwan) Limited.\nAddress: 28F., No. 100, Songren Rd., Xinyi Dist., Taipei City 110, Taiwan. Tel:\n(02)23261600. In Japan, this is issued by BlackRock Japan. Co., Ltd. (Financial\nInstruments Business Operator: The Kanto Regional Financial Bureau. License\nNo375, Association Memberships: Japan Investment Advisers Association, the\nInvestment Trusts Association, Japan, Japan Securities Dealers Association, Type\nII Financial Instruments Firms Association.) For Professional Investors only\n(Professional Investor is defined in Financial Instruments and Exchange Act). In\nAustralia, issued by BlackRock Investment Management (Australia) Limited ABN 13\n006 165 975 AFSL 230 523 (BIMAL). The material provides general information only\nand does not take into account your individual objectives, financial situation,\nneeds or circumstances. In New Zealand, issued by BlackRock Investment\nManagement (Australia) Limited ABN 13 006 165 975, AFSL 230 523 (BIMAL) for the\nexclusive use of the recipient, who warrants by receipt of this material that\nthey are a wholesale client as defined under the New Zealand Financial Advisers\nAct 2008. In China, this material may not be distributed to individuals resident\nin the People’s Republic of China (“PRC”, for such purposes, not applicable to\nHong Kong, Macau and Taiwan) or entities registered in the PRC unless such\nparties have received all the required PRC government approvals to participate\nin any investment or receive any investment advisory or investment management\nservices. For Other APAC Countries, this material is issued for Institutional\nInvestors only (or professional/sophisticated /qualified investors, as such term\nmay apply in local jurisdictions). In Latin America, no securities regulator\nwithin Latin America has confirmed the accuracy of any information contained\nherein. The provision of investment management and investment advisory services\nis a regulated activity in Mexico thus is subject to strict rules. For more\ninformation on the Investment Advisory Services offered by BlackRock Mexico\nplease refer to the Investment Services Guide available at www.blackrock.com/mx",
        "summary": "This material is intended for information purposes only, and does not constitute investment advice, a recommendation or an offer or solicitation to purchase or sell any securities. The opinions expressed are as of July 2024, and are subject to change without notice. This material may contain estimates and forward-looking statements, which may include forecasts and do not represent a guarantee of future performance.",
        "source": "BlackRock",
        "sentiment": -0.013328233733773232,
        "keywords": [],
        "categories": [],
        "image": "/blk-one-c-assets/include/common/images/blackrock_logo.png"
    },
    {
        "publication_date": "None",
        "title": "New World Development Co Ltd - Company Profile and News - Bloomberg Markets",
        "link": "https://www.bloomberg.com/profile/company/17:HK",
        "content": "No content found",
        "summary": "summarize: No content found. No content for this article. Use the weekly Newsquiz to test your knowledge of stories you saw on CNN iReport. Send your own photos and videos of the U.S. to iReport@cnn.com.",
        "source": "bloomberg.com",
        "sentiment": -0.04044749028980732,
        "keywords": [],
        "categories": [],
        "image": "/images/markets-logo.png"
    },
    {
        "publication_date": "2024-03-25 00:00:00",
        "title": "Hong Kong Property Tycoons Are Selling Super Call Options - Bloomberg",
        "link": "https://www.bloomberg.com/opinion/articles/2024-03-25/hong-kong-property-tycoons-are-selling-super-call-options",
        "content": "Do people see residential property as a utility or an investment? Hong Kong’s property tycoons are racing to find out. \nConsider Uptown East in Kowloon Bay, developed by Wong Sun Hing Ltd. Its latest pre-sales pitch included a so-called “super flex stage payment plan”, where buyers only need to put down 5% deposit, with the rest to be paid upon completion, expected in 2025. This payment plan was not available earlier this month. Last week, Wong Sun Hing and its partner New World Development Co. sold 50 of the latest 132 units on offer in the first 30 minutes. A recent survey by Bloomberg Intelligence shows that more than half of Hong Kong’s home buyers could accelerate their purchase plansBloomberg Terminal over fears of price hikes. ",
        "summary": "Consider Uptown East in Kowloon Bay, developed by Wong Sun Hing Ltd. Its latest pre-sales pitch included a so-called ‘super flex stage payment plan’ Buyers only need to put down 5% deposit, with the rest to be paid upon completion, expected in 2025.",
        "source": "Bloomberg",
        "sentiment": -0.04044749028980732,
        "keywords": [],
        "categories": [],
        "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iOakDB8ZH.H0/v1/1200x800.jpg"
    },
    {
        "publication_date": "2024-03-19 00:00:00",
        "title": "New World Development Co Ltd's Dividend Analysis",
        "link": "https://finance.yahoo.com/news/world-development-co-ltds-dividend-110730305.html",
        "content": "UNDERSTANDING THE DIVIDEND DYNAMICS OF NWWDF\n\nNew World Development Co Ltd () recently announced a of $0.2 per share, payable\non 2024-04-18, with the ex-dividend date set for 2024-03-20. As investors look\nforward to this upcoming payment, the spotlight also shines on the company's\ndividend history, yield, and growth rates. Using the data from GuruFocus, let's\ndelve into New World Development Co Ltd's dividend performance and assess its\nsustainability.\n\n\nWHAT DOES NEW WORLD DEVELOPMENT CO LTD DO?\n\n * \n * \n\n * This Powerful Chart Made Peter Lynch 29% A Year For 13 Years\n\n * How to calculate the intrinsic value of a stock?\n\nNew World Development, or NWD, is the listed property arm of Chow Tai Fook,\nowned by the Cheng family. Chow Tai Fook owns a 45% stake in NWD, which mainly\nengages in residential property development and investment properties of retail\nmalls and offices in Hong Kong and mainland China. NWD also develops high-end\nhotels across Hong Kong, mainland China, and in Southeast Asia. Additionally,\nNWD holds a 75% interest in New World Department Store China, which operates 24\ndepartment stores in mainland China.\n\n\n\n\nA GLIMPSE AT NEW WORLD DEVELOPMENT CO LTD'S DIVIDEND HISTORY\n\nNew World Development Co Ltd has maintained a consistent record since 1999.\nDividends are currently distributed on a bi-annual basis. Below is a chart\nshowing annual for tracking historical trends.\n\n\nBREAKING DOWN NEW WORLD DEVELOPMENT CO LTD'S DIVIDEND YIELD AND GROWTH\n\nAs of today, New World Development Co Ltd currently has a 12-month of 8.09% and\na 12-month of 4.26%. This suggests an expectation of decreased dividend payments\nover the next 12 months.\n\nOver the past three years, New World Development Co Ltd's annual was -1.30%.\nExtended to a five-year horizon, this rate increased to 1.20% per year. And over\nthe past decade, New World Development Co Ltd's annual dividends per share\ngrowth rate stands at 3.10%.\n\nBased on New World Development Co Ltd's dividend yield and five-year growth\nrate, the of New World Development Co Ltd stock as of today is approximately\n8.59%.\n\n\n\n\nTHE SUSTAINABILITY QUESTION: PAYOUT RATIO AND PROFITABILITY\n\nTo assess the sustainability of the dividend, one needs to evaluate the\ncompany's payout ratio. The provides insights into the portion of earnings the\ncompany distributes as dividends. A lower ratio suggests that the company\nretains a significant part of its earnings, thereby ensuring the availability of\nfunds for future growth and unexpected downturns. As of 2023-12-31, New World\nDevelopment Co Ltd's dividend payout ratio is 2.77, which may suggest that the\ncompany's dividend may not be sustainable.\n\nNew World Development Co Ltd's , offers an understanding of the company's\nearnings prowess relative to its peers. GuruFocus ranks New World Development Co\nLtd's profitability 7 out of 10 as of 2023-12-31, suggesting good profitability\nprospects. The company has reported positive for each year over the past decade,\nfurther solidifying its high profitability.\n\n\nGROWTH METRICS: THE FUTURE OUTLOOK\n\nTo ensure the sustainability of dividends, a company must have robust growth\nmetrics. New World Development Co Ltd's of 7 out of 10 suggests that the\ncompany's growth trajectory is good relative to its competitors.\n\nRevenue is the lifeblood of any company, and New World Development Co Ltd's ,\ncombined with the , indicates a strong revenue model. New World Development Co\nLtd's revenue has increased by approximately 17.90% per year on average, a rate\nthat outperforms approximately 75.09% of global competitors.\n\nThe company's showcases its capability to grow its earnings, a critical\ncomponent for sustaining dividends in the long run. During the past three years,\nNew World Development Co Ltd's earnings increased by approximately 17.30% per\nyear on average, a rate that outperforms approximately 68.78% of global\ncompetitors.\n\nLastly, the company's of -35.80%, which outperforms approximately 4.42% of\nglobal competitors, presents a mixed picture but does not overshadow the\ncompany's overall strong performance.\n\n\nENGAGING CONCLUSION: EVALUATING NEW WORLD DEVELOPMENT CO LTD'S DIVIDEND\nPROSPECTS\n\nIn conclusion, New World Development Co Ltd's upcoming dividend payment, along\nwith its historical dividend performance, presents an interesting case for\ninvestors. While the dividend growth rate and high yield on cost are attractive,\nthe low payout ratio raises questions about the dividend's sustainability.\nHowever, the company's solid profitability and positive growth metrics provide\nconfidence in its ability to sustain dividends. Investors should weigh these\nfactors carefully and consider New World Development Co Ltd's overall financial\nhealth when making investment decisions. Will the company continue to reward\nshareholders with consistent dividend payments? Only time will tell.\n\nGuruFocus Premium users can screen for high-dividend yield stocks using the .\n\nThis article, generated by GuruFocus, is designed to provide general insights\nand is not tailored financial advice. Our commentary is rooted in historical\ndata and analyst projections, utilizing an impartial methodology, and is not\nintended to serve as specific investment guidance. It does not formulate a\nrecommendation to purchase or divest any stock and does not consider individual\ninvestment objectives or financial circumstances. Our objective is to deliver\nlong-term, fundamental data-driven analysis. Be aware that our analysis might\nnot incorporate the most recent, price-sensitive company announcements or\nqualitative information. GuruFocus holds no position in the stocks mentioned\nherein.\n\nThis article first appeared on .\n",
        "summary": "New World Development Co Ltd recently announced a of $0.2 per share, payable on 2024-04-18, with the ex-dividend date set for 2024-03-20. New World Development, or NWD, is the listed property arm of Chow Tai Fook, owned by the Cheng family.",
        "source": "Yahoo Finance",
        "sentiment": 0.3215905800461769,
        "keywords": [],
        "categories": [],
        "image": "https://s.yimg.com/ny/api/res/1.2/yVVt4iWmGS1dI3seOs..ow--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NjU-/https://media.zenfs.com/en/us.finance.gurufocus/af9bd2e84bdca2354c3eff2f0cde9cb3"
    },
    {
        "publication_date": "2024-03-20 00:00:00",
        "title": "McKinsey Global Private Markets Review 2024: Private markets in a slower era",
        "link": "https://www.mckinsey.com/industries/private-capital/our-insights/mckinseys-private-markets-annual-review",
        "content": "AT A GLANCE\n\n\nMACROECONOMIC CHALLENGES CONTINUED\n\nIf 2022 was a tale of two halves, with robust fundraising and deal activity in\nthe first six months followed by a slowdown in the second half, then 2023 might\nbe considered a tale of one whole. Macroeconomic headwinds persisted throughout\nthe year, with rising financing costs, and an uncertain growth outlook taking a\ntoll on private markets. Full-year fundraising continued to decline from 2021’s\nlofty peak, weighed down by the “denominator effect” that persisted in part due\nto a less active deal market. Managers largely held onto assets to avoid selling\nin a lower-multiple environment, fueling an activity-dampening cycle in which\ndistribution-starved limited partners (LPs) reined in new commitments.\n\nPerformance in most private asset classes remained below historical averages for\na second consecutive year. Decade-long tailwinds from low and falling interest\nrates and consistently expanding multiples seem to be things of the past. As\nprivate market managers look to boost performance in this new era of investing,\na deeper focus on revenue growth and margin expansion will be needed now more\nthan ever.\n\n\n\n\nGLOBAL FUNDRAISING CONTRACTED\n\nFundraising fell 22 percent across private market asset classes globally to just\nover $1 trillion, as of year-end reported data—the lowest total since 2017.\nFundraising in North America, a rare bright spot in 2022, declined in line with\nglobal totals, while in Europe, fundraising proved most resilient, falling just\n3 percent. In Asia, fundraising fell precipitously and now sits 72 percent below\nthe region’s 2018 peak.\n\nDespite difficult fundraising conditions, headwinds did not affect all\nstrategies or managers equally. Private equity (PE) buyout strategies posted\ntheir best fundraising year ever, and larger managers and vehicles also fared\nwell, continuing the prior year’s trend toward greater fundraising\nconcentration.\n\n\nTHE NUMERATOR EFFECT PERSISTED\n\nDespite a marked recovery in the denominator—the 1,000 largest US retirement\nfunds grew 7 percent in the year ending September 2023, after falling 14 percent\nthe prior year, for example1—many LPs remain overexposed to private markets\nrelative to their target allocations. LPs started 2023 overweight: according to\nanalysis from CEM Benchmarking, average allocations across PE, infrastructure,\nand real estate were at or above target allocations as of the beginning of the\nyear. And the numerator grew throughout the year, as a lack of exits and\nrebounding valuations drove net asset values (NAVs) higher. While not all LPs\nstrictly follow asset allocation targets, our analysis in partnership with\nglobal private markets firm StepStone Group suggests that an overallocation of\njust one percentage point can reduce planned commitments by as much as 10 to 12\npercent per year for five years or more.\n\nDespite these headwinds, recent surveys indicate that LPs remain broadly\ncommitted to private markets. In fact, the majority plan to maintain or increase\nallocations over the medium to long term.\n\n\nINVESTORS FLED TO KNOWN NAMES AND LARGER FUNDS\n\nFundraising concentration reached its highest level in over a decade, as\ninvestors continued to shift new commitments in favor of the largest fund\nmanagers. The 25 most successful fundraisers collected 41 percent of aggregate\ncommitments to closed-end funds (with the top five managers accounting for\nnearly half that total). Closed-end fundraising totals may understate the extent\nof concentration in the industry overall, as the largest managers also tend to\nbe more successful in raising non-institutional capital.\n\nWhile the largest funds grew even larger—the largest vehicles on record were\nraised in buyout, real estate, infrastructure, and private debt in 2023—smaller\nand newer funds struggled. Fewer than 1,700 funds of less than $1 billion were\nclosed during the year, half as many as closed in 2022 and the fewest of any\nyear since 2012. New manager formation also fell to the lowest level since 2012,\nwith just 651 new firms launched in 2023.\n\nWhether recent fundraising concentration and a spate of M&A activity signals the\nbeginning of oft-rumored consolidation in the private markets remains uncertain,\nas a similar pattern developed in each of the last two fundraising downturns\nbefore giving way to renewed entrepreneurialism among general partners (GPs) and\ncommitment diversification among LPs. Compared with how things played out in the\nlast two downturns, perhaps this movie really is different, or perhaps we’re\nwatching a trilogy reusing a familiar plotline.\n\n\nDRY POWDER INVENTORY SPIKED (AGAIN)\n\nPrivate markets assets under management totaled $13.1 trillion as of June 30,\n2023, and have grown nearly 20 percent per annum since 2018. Dry powder\nreserves—the amount of capital committed but not yet deployed—increased to $3.7\ntrillion, marking the ninth consecutive year of growth. Dry powder inventory—the\namount of capital available to GPs expressed as a multiple of annual\ndeployment—increased for the second consecutive year in PE, as new commitments\ncontinued to outpace deal activity. Inventory sat at 1.6 years in 2023, up\nmarkedly from the 0.9 years recorded at the end of 2021 but still within the\nhistorical range. NAV grew as well, largely driven by the reluctance of managers\nto exit positions and crystallize returns in a depressed multiple environment.\n\n\nPRIVATE EQUITY STRATEGIES DIVERGED\n\nBuyout and venture capital, the two largest PE sub-asset classes, charted wildly\ndifferent courses over the past 18 months. Buyout notched its highest\nfundraising year ever in 2023, and its performance improved, with funds posting\na (still paltry) 5 percent net internal rate of return through September 30. And\nalthough buyout deal volumes declined by 19 percent, 2023 was still the\nthird-most-active year on record. In contrast, venture capital (VC) fundraising\ndeclined by nearly 60 percent, equaling its lowest total since 2015, and deal\nvolume fell by 36 percent to the lowest level since 2019. VC funds returned –3\npercent through September, posting negative returns for seven consecutive\nquarters. VC was the fastest-growing—as well as the highest-performing—PE\nstrategy by a significant margin from 2010 to 2022, but investors appear to be\nreevaluating their approach in the current environment.\n\n\nPRIVATE EQUITY ENTRY MULTIPLES CONTRACTED\n\nPE buyout entry multiples declined by roughly one turn from 11.9 to 11.0 times\nEBITDA, slightly outpacing the decline in public market multiples (down from\n12.1 to 11.3 times EBITDA), through the first nine months of 2023. For nearly a\ndecade leading up to 2022, managers consistently sold assets into a\nhigher-multiple environment than that in which they had bought those assets,\nproviding a substantial performance tailwind for the industry. Nowhere has this\nbeen truer than in technology. After experiencing more than eight turns of\nmultiple expansion from 2009 to 2021 (the most of any sector), technology\nmultiples have declined by nearly three turns in the past two years, 50 percent\nmore than in any other sector. Overall, roughly two-thirds of the total return\nfor buyout deals that were entered in 2010 or later and exited in 2021 or before\ncan be attributed to market multiple expansion and leverage. Now, with falling\nmultiples and higher financing costs, revenue growth and margin expansion are\ntaking center stage for GPs.\n\n\nREAL ESTATE RECEDED\n\nDemand uncertainty, slowing rent growth, and elevated financing costs drove cap\nrates higher and made price discovery challenging, all of which weighed on deal\nvolume, fundraising, and investment performance. Global closed-end fundraising\ndeclined 34 percent year over year, and funds returned −4 percent in the first\nnine months of the year, losing money for the first time since the 2007–08\nglobal financial crisis. Capital shifted away from core and core-plus strategies\nas investors sought liquidity via redemptions in open-end vehicles, from which\nnet outflows reached their highest level in at least two decades. Opportunistic\nstrategies benefited from this shift, with investors focusing on capital\nappreciation over income generation in a market where alternative sources of\nyield have grown more attractive. Rising interest rates widened bid–ask spreads\nand impaired deal volume across food groups, including in what were formerly hot\nsectors: multifamily and industrial.\n\n\nPRIVATE DEBT PAYS DIVIDENDS\n\nDebt again proved to be the most resilient private asset class against a\nturbulent market backdrop. Fundraising declined just 13 percent, largely driven\nby lower commitments to direct lending strategies, for which a slower PE deal\nenvironment has made capital deployment challenging. The asset class also posted\nthe highest returns among all private asset classes through September 30. Many\nprivate debt securities are tied to floating rates, which enhance returns in a\nrising-rate environment. Thus far, managers appear to have successfully\nnavigated the rising incidence of default and distress exhibited across the\nbroader leveraged-lending market. Although direct lending deal volume declined\nfrom 2022, private lenders financed an all-time high 59 percent of leveraged\nbuyout transactions last year and are now expanding into additional strategies\nto drive the next era of growth.\n\n\nINFRASTRUCTURE TOOK A DETOUR\n\nAfter several years of robust growth and strong performance, infrastructure and\nnatural resources fundraising declined by 53 percent to the lowest total since\n2013. Supply-side timing is partially to blame: five of the seven largest\ninfrastructure managers closed a flagship vehicle in 2021 or 2022, and none of\nthose five held a final close last year. As in real estate, investors shied away\nfrom core and core-plus investments in a higher-yield environment. Yet there are\nreasons to believe infrastructure’s growth will bounce back. Limited partners\n(LPs) surveyed by McKinsey remain bullish on their deployment to the asset\nclass, and at least a dozen vehicles targeting more than $10 billion were\nactively fundraising as of the end of 2023. Multiple recent acquisitions of\nlarge infrastructure GPs by global multi-asset-class managers also indicate\nmarketwide conviction in the asset class’s potential.\n\n\nPRIVATE MARKETS STILL HAVE WORK TO DO ON DIVERSITY\n\nPrivate markets firms are slowly improving their representation of females (up\ntwo percentage points over the prior year) and ethnic and racial minorities (up\none percentage point). On some diversity metrics, including entry-level\nrepresentation of women, private markets now compare favorably with corporate\nAmerica. Yet broad-based parity remains elusive and too slow in the making.\nEthnic, racial, and gender imbalances are particularly stark across more\ninfluential investing roles and senior positions. In fact, McKinsey’s\nresearch reveals that at the current pace, it would take several decades for\nprivate markets firms to reach gender parity at senior levels. Increasing\nrepresentation across all levels will require managers to take fresh approaches\nto hiring, retention, and promotion.\n\n\nARTIFICIAL INTELLIGENCE GENERATING EXCITEMENT\n\nThe transformative potential of generative AI was perhaps 2023’s hottest topic\n(beyond Taylor Swift). Private markets players are excited about the potential\nfor the technology to optimize their approach to thesis generation, deal\nsourcing, investment due diligence, and portfolio performance, among other\nareas. While the technology is still nascent and few GPs can boast scaled\nimplementations, pilot programs are already in flight across the industry,\nparticularly within portfolio companies. Adoption seems nearly certain to\naccelerate throughout 2024.\n\nIf private markets investors entered 2023 hoping for a return to the heady days\nof 2021, they likely left the year disappointed. Many of the headwinds that\nemerged in the latter half of 2022 persisted throughout the year, pressuring\nfundraising, dealmaking, and performance. Inflation moderated somewhat over the\ncourse of the year but remained stubbornly elevated by recent historical\nstandards. Interest rates started high and rose higher, increasing the cost of\nfinancing. A reinvigorated public equity market recovered most of 2022’s losses\nbut did little to resolve the valuation uncertainty private market investors\nhave faced for the past 18 months.\n\nWithin private markets, the denominator effect remained in play, despite the\npublic market recovery, as the numerator continued to expand. An\nactivity-dampening cycle emerged: higher cost of capital and lower multiples\nlimited the ability or willingness of general partners (GPs) to exit positions;\nfewer exits, coupled with continuing capital calls, pushed LP allocations\nhigher, thereby limiting their ability or willingness to make new commitments.\nThese conditions weighed on managers’ ability to fundraise. Based on data\nreported as of year-end 2023, private markets fundraising fell 22 percent from\nthe prior year to just over $1 trillion, the largest such drop since 2009\n(Exhibit 1).\n\nThe impact of the fundraising environment was not felt equally among GPs.\nContinuing a trend that emerged in 2022, and consistent with prior downturns in\nfundraising, LPs favored larger vehicles and the scaled GPs that typically\nmanage them. Smaller and newer managers struggled, and the number of sub–$1\nbillion vehicles and new firm launches each declined to its lowest level in more\nthan a decade.\n\nDespite the decline in fundraising, private markets assets under management\n(AUM) continued to grow, increasing 12 percent to $13.1 trillion as of June 30,\n2023. 2023 fundraising was still the sixth-highest annual haul on record,\npushing dry powder higher, while the slowdown in deal making limited\ndistributions.\n\nInvestment performance across private market asset classes fell short of\nhistorical averages. Private equity (PE) got back in the black but generated the\nlowest annual performance in the past 15 years, excluding 2022. Closed-end real\nestate produced negative returns for the first time since 2009, as\ncapitalization (cap) rates expanded across sectors and rent growth dissipated in\nformerly hot sectors, including multifamily and industrial. The performance of\ninfrastructure funds was less than half of its long-term average and even\nfurther below the double-digit returns generated in 2021 and 2022. Private debt\nwas the standout performer (if there was one), outperforming all other private\nasset classes and illustrating the asset class’s countercyclical appeal.\n\n\n\nHigher financing costs, lower multiples, and an uncertain macroeconomic\nenvironment created a challenging backdrop for private equity managers in 2023.\nFundraising declined for the second year in a row, falling 15 percent to $649\nbillion, as LPs grappled with the denominator effect and a slowdown in\ndistributions. Managers were on the fundraising trail longer to raise this\ncapital: funds that closed in 2023 were open for a record-high average of 20.1\nmonths, notably longer than 18.7 months in 2022 and 14.1 months in 2018. VC and\ngrowth equity strategies led the decline, dropping to their lowest level of\ncumulative capital raised since 2015. Fundraising in Asia fell for the fourth\nyear of the last five, with the greatest decline in China.\n\nDespite the difficult fundraising context, a subset of strategies and managers\nprevailed. Buyout managers collectively had their best fundraising year on\nrecord, raising more than $400 billion. Fundraising in Europe surged by more\nthan 50 percent, resulting in the region’s biggest haul ever. The largest\nmanagers raised an outsized share of the total for a second consecutive year,\nmaking 2023 the most concentrated fundraising year of the last decade (Exhibit\n2).\n\nDespite the drop in aggregate fundraising, PE assets under management increased\n8 percent to $8.2 trillion. Only a small part of this growth was performance\ndriven: PE funds produced a net IRR of just 2.5 percent through September 30,\n2023. Buyouts and growth equity generated positive returns, while VC lost money.\nPE performance, dating back to the beginning of 2022, remains negative,\nhighlighting the difficulty of generating attractive investment returns in a\nhigher interest rate and lower multiple environment. As PE managers devise value\ncreation strategies to improve performance, their focus includes ensuring\noperating efficiency and profitability of their portfolio companies.\n\nDeal activity volume and count fell sharply, by 21 percent and 24 percent,\nrespectively, which continued the slower pace set in the second half of 2022.\nSponsors largely opted to hold assets longer rather than lock in underwhelming\nreturns. While higher financing costs and valuation mismatches weighed on\noverall deal activity, certain types of M&A gained share. Add-on deals, for\nexample, accounted for a record 46 percent of total buyout deal volume last\nyear.\n\n\n\nFor real estate, 2023 was a year of transition, characterized by a litany of new\nand familiar challenges. Pandemic-driven demand issues continued, while elevated\nfinancing costs, expanding cap rates, and valuation uncertainty weighed on\ncommercial real estate deal volumes, fundraising, and investment performance.\n\nManagers faced one of the toughest fundraising environments in many years.\nGlobal closed-end fundraising declined 34 percent to $125 billion. While\nfundraising challenges were widespread, they were not ubiquitous across\nstrategies. Dollars continued to shift to large, multi-asset class platforms,\nwith the top five managers accounting for 37 percent of aggregate closed-end\nreal estate fundraising. In April, the largest real estate fund ever raised\nclosed on a record $30 billion.\n\nCapital shifted away from core and core-plus strategies as investors sought\nliquidity through redemptions in open-end vehicles and reduced gross\ncontributions to the lowest level since 2009. Opportunistic strategies benefited\nfrom this shift, as investors turned their attention toward capital appreciation\nover income generation in a market where alternative sources of yield have grown\nmore attractive.\n\nIn the United States, for instance, open-end funds, as represented by the\nNational Council of Real Estate Investment Fiduciaries Fund Index—Open-End\nEquity (NFI-OE), recorded $13 billion in net outflows in 2023, reversing the\ntrend of positive net inflows throughout the 2010s. The negative flows mainly\nreflected $9 billion in core outflows, with core-plus funds accounting for the\nremaining outflows, which reversed a 20-year run of net inflows.\n\nAs a result, the NAV in US open-end funds fell roughly 16 percent year over\nyear. Meanwhile, global assets under management in closed-end funds reached a\nnew peak of $1.7 trillion as of June 2023, growing 14 percent between June 2022\nand June 2023.\n\nReal estate underperformed historical averages in 2023, as previously\nhigh-performing multifamily and industrial sectors joined office in producing\nnegative returns caused by slowing demand growth and cap rate expansion.\nClosed-end funds generated a pooled net IRR of −3.5 percent in the first nine\nmonths of 2023, losing money for the first time since the global financial\ncrisis. The lone bright spot among major sectors was hospitality, which—thanks\nto a rush of postpandemic travel—returned 10.3 percent in 2023.2 As a whole, the\naverage pooled lifetime net IRRs for closed-end real estate funds from 2011–20\nvintages remained around historical levels (9.8 percent).\n\nGlobal deal volume declined 47 percent in 2023 to reach a ten-year low of $650\nbillion, driven by widening bid–ask spreads amid valuation uncertainty and\nhigher costs of financing (Exhibit 3).3 Deal flow in the office sector remained\ndepressed, partly as a result of continued uncertainty in the demand for space\nin a hybrid working world.\n\n\n\nDuring a turbulent year for private markets, private debt was a relative bright\nspot, topping private markets asset classes in terms of fundraising growth, AUM\ngrowth, and performance.\n\nFundraising for private debt declined just 13 percent year over year, nearly ten\npercentage points less than the private markets overall. Despite the decline in\nfundraising, AUM surged 27 percent to $1.7 trillion. And private debt posted the\nhighest investment returns of any private asset class through the first three\nquarters of 2023.\n\nPrivate debt’s risk/return characteristics are well suited to the current\nenvironment. With interest rates at their highest in more than a decade, current\nyields in the asset class have grown more attractive on both an absolute and\nrelative basis, particularly if higher rates sustain and put downward pressure\non equity returns (Exhibit 4). The built-in security derived from debt’s\nprivileged position in the capital structure, moreover, appeals to investors\nthat are wary of market volatility and valuation uncertainty.\n\nDirect lending continued to be the largest strategy in 2023, with fundraising\nfor the mostly-senior-debt strategy accounting for almost half of the asset\nclass’s total haul (despite declining from the previous year). Separately,\nmezzanine debt fundraising hit a new high, thanks to the closings of three of\nthe largest funds ever raised in the strategy.\n\nOver the longer term, growth in private debt has largely been driven by\ninstitutional investors rotating out of traditional fixed income in favor of\nprivate alternatives. Despite this growth in commitments, LPs remain underweight\nin this asset class relative to their targets. In fact, the allocation gap has\nonly grown wider in recent years, a sharp contrast to other private asset\nclasses, for which LPs’ current allocations exceed their targets on average.\nAccording to data from CEM Benchmarking, the private debt allocation gap now\nstands at 1.4 percent, which means that, in aggregate, investors must commit\nhundreds of billions in net new capital to the asset class just to reach current\ntargets.\n\nPrivate debt was not completely immune to the macroeconomic conditions last\nyear, however. Fundraising declined for the second consecutive year and now sits\n23 percent below 2021’s peak. Furthermore, though private lenders took share in\n2023 from other capital sources, overall deal volumes also declined for the\nsecond year in a row. The drop was largely driven by a less active PE deal\nenvironment: private debt is predominantly used to finance PE-backed companies,\nthough managers are increasingly diversifying their origination capabilities to\ninclude a broad new range of companies and asset types.\n\n\n\nFor infrastructure and natural resources fundraising, 2023 was an exceptionally\nchallenging year. Aggregate capital raised declined 53 percent year over year to\n$82 billion, the lowest annual total since 2013. The size of the drop is\nparticularly surprising in light of infrastructure’s recent momentum. The asset\nclass had set fundraising records in four of the previous five years, and\ninfrastructure is often considered an attractive investment in uncertain\nmarkets.\n\nWhile there is little doubt that the broader fundraising headwinds discussed\nelsewhere in this report affected infrastructure and natural resources\nfundraising last year, dynamics specific to the asset class were at play as\nwell. One issue was supply-side timing: nine of the ten largest infrastructure\nGPs did not close a flagship fund in 2023. Second was the migration of investor\ndollars away from core and core-plus investments, which have historically\naccounted for the bulk of infrastructure fundraising, in a higher rate\nenvironment.\n\nThe asset class had some notable bright spots last year. Fundraising for\nhigher-returning opportunistic strategies more than doubled the prior year’s\ntotal (Exhibit 5). AUM grew 18 percent, reaching a new high of $1.5 trillion.\nInfrastructure funds returned a net IRR of 3.4 percent in 2023; this was below\nhistorical averages but still the second-best return among private asset\nclasses. And as was the case in other asset classes, investors concentrated\ncommitments in larger funds and managers in 2023, including in the largest\ninfrastructure fund ever raised.\n\nThe outlook for the asset class, moreover, remains positive. Funds targeting a\nrecord amount of capital were in the market at year-end, providing a robust\nfoundation for fundraising in 2024 and 2025. A recent spate of infrastructure GP\nacquisitions signal multi-asset managers’ long-term conviction in the asset\nclass, despite short-term headwinds. Global megatrends like decarbonization and\ndigitization, as well as revolutions in energy and mobility, have spurred new\ninfrastructure investment opportunities around the world, particularly for\nvalue-oriented investors that are willing to take on more risk.\n\n\n\nDiversity, equity, and inclusion (DEI) has become an important part of the\nfundraising, talent, and investing landscape for private market participants.\nEncouragingly, incremental progress has been made in recent years, including\nmore diverse talent being brought to entry-level positions, investing roles, and\ninvestment committees. The scope of DEI metrics provided to institutional\ninvestors during fundraising has also increased in recent years: more than half\nof PE firms now provide data across investing teams, portfolio company boards,\nand portfolio company management (versus investment team data only).4\n\nIn 2023, McKinsey surveyed 66 global private markets firms that collectively\nemploy more than 60,000 people for the second annual State of diversity in\nglobal private markets report.5 The research offers insight into the\nrepresentation of women and ethnic and racial minorities in private investing as\nof year-end 2022. In this chapter, we discuss where the numbers stand and how\nfirms can bring a more diverse set of perspectives to the table.\n\nThe statistics indicate signs of modest advancement. Overall representation of\nwomen in private markets increased two percentage points to 35 percent, and\nethnic and racial minorities increased one percentage point to 30 percent\n(Exhibit 6). Entry-level positions have nearly reached gender parity, with\nfemale representation at 48 percent. The share of women holding C-suite roles\nglobally increased 3 percentage points, while the share of people from ethnic\nand racial minorities in investment committees increased 9 percentage points.\nThere is growing evidence that external hiring is gradually helping close the\ndiversity gap, especially at senior levels. For example, 33 percent of external\nhires at the managing director level were ethnic or racial minorities, higher\nthan their existing representation level (19 percent).\n\nYet, the scope of the challenge remains substantial. Women and minorities\ncontinue to be underrepresented in senior positions and investing roles. They\nalso experience uneven rates of progress due to lower promotion and higher\nattrition rates, particularly at smaller firms. Firms are also navigating an\nincreasingly polarized workplace today, with additional scrutiny and a growing\nnumber of lawsuits against corporate diversity and inclusion programs,\nparticularly in the US, which threatens to impact the industry’s pace of\nprogress.\n\n\n\nFredrik Dahlqvist is a senior partner in McKinsey’s Stockholm office; Alastair\nGreen is a senior partner in the Washington, DC, office, where Paul Maia and\nAlexandra Nee are partners; David Quigley is a senior partner in the New York\noffice, where Connor Mangan is an associate partner and Aditya Sanghvi is a\nsenior partner; Rahel Schneider is an associate partner in the Bay Area office;\nJohn Spivey is a partner in the Charlotte office; and Brian Vickery is a partner\nin the Boston office.\n\nThe authors wish to thank Jonathan Christy, Louis Dufau, Vaibhav Gujral, Graham\nHealy-Day, Laura Johnson, Ryan Luby, Tripp Norton, Alastair Rami, Henri Torbey,\nand Alex Wolkomir for their contributions\n\nThe authors would also like to thank CEM Benchmarking and the StepStone Group\nfor their partnership in this year's report.\n\n--------------------------------------------------------------------------------\n\nThis article was edited by Arshiya Khullar, an editor in the Gurugram office.\n\nEXPLORE A CAREER WITH US",
        "summary": "Fundraising fell 22 percent across private market asset classes globally to just over $1 trillion. Private equity (PE) buyout strategies posted their best fundraising year ever. The 25 most successful fundraisers collected 41 percent of aggregatecommitments to closed-end funds.",
        "source": "McKinsey & Company",
        "sentiment": -0.6417946740984917,
        "keywords": [],
        "categories": [],
        "image": "https://www.mckinsey.com/~/media/mckinsey/industries/private%20equity%20and%20principal%20investors/our%20insights/mckinseys%20private%20markets%20annual%20review/2024/private-markets-a-slower-era-1657210194-thumb-1536x1536.jpg"
    },
    {
        "publication_date": "2024-07-15 00:00:00",
        "title": "Chinese firms' new-age ventures elevate BRI",
        "link": "http://global.chinadaily.com.cn/a/202407/15/WS669455b6a31095c51c50df75.html",
        "content": "A view of the NEV production line of BYD in Rayong, Thailand. SUN WEITONG/XINHUA\n\nAt Chinese automaker Great Wall Motor's welding workshop in Rayong, Thailand,\nnumerous robotic arms in operation indicate the level of high-tech in use even\nas Chinese technicians guide local employees through the welding process.\n\nFollowing the successful rollout of its first electric vehicle at its plant in\nThailand this January, the Baoding, Hebei province-based carmaker said that\nmultiple batches of Thai workers have now mastered the production processes of\nits EV products. They have thus become valuable assets for the company, aiding\nits expansion efforts in other Southeast Asian markets.\n\nElsewhere, Beijing-based artificial intelligence services provider Terminus\nGroup is charting a similar course to bring additional value to an overseas\nmarket. Amid the intensified efforts by many Middle Eastern countries to\nleverage the digital economy for sustainable growth, Terminus launched its\ninternational headquarters in Dubai, the United Arab Emirates, in February.\n\nIt will not only facilitate Terminus' projects and business expansion\ninitiatives in the UAE, Saudi Arabia, Qatar, Oman and other countries in the\nregion, but also support the group's operations in Singapore, Australia and\nnumerous countries participating in the Belt and Road Initiative.\n\nBoth GWM and Terminus are epitomes of a larger trend — that of Chinese\nenterprises operating in the vast BRI landscape going beyond big-ticket\ninfrastructure projects like dams, highways, railroads, airports and municipal\nengineering works.\n\nAs many parts of the world enter a new phase of development, Chinese companies,\nparticularly those from high-end manufacturing and trade in services, are\nadjusting their strategies to better align with the evolving environment in BRI\neconomies, said Wan Zhe, a researcher at the Belt and Road School of Beijing\nNormal University.\n\nFacing challenges like escalating geopolitical tensions and rising protectionism\nin certain countries, Chinese enterprises are focusing on avoiding risks and\ngenerating revenue through higher-value business ventures that serve the\nchanging landscape better, said Wan.\n\nFor instance, GWM plans to start operations at its new factories in Vietnam,\nIndonesia and Malaysia this year or the next.\n\nSimilarly, Chang'an Automobile Co, a Chongqing-based State-owned automaker, is\nbuilding a factory in Rayong province, Thailand. The first phase of the project\nwill involve an investment of over $240 million and is scheduled to begin\nproduction in 2025.\n\nEmployees work on a battery production line of BYD in Brazil. WANG\nTIANCONG/XINHUA\n\nThe new energy vehicles produced will be not only marketed in Thailand but also\nexported to other neighboring ASEAN (the Association of Southeast Asian Nations)\ncountries, as well as Australia, New Zealand, the United Kingdom and South\nAfrica, said Shen Xinghua, president of Chang'an Automobile's business for\nSoutheast Asia.\n\nShen said that the initial annual production capacity of this plant is 100,000\nunits, which will be gradually expanded to 200,000 units in the next phase.\n\nChen Bin, deputy director of an expert committee at the Beijing-based China\nMachinery Industry Federation, said that South Africa, Hungary, Saudi Arabia,\nIndonesia, Vietnam and Malaysia have all formulated EV-related policies to\nencourage and support the development and growth of the industry.\n\nHighlighting that electrification and intelligence complement each other, Chen\nsaid with growing populations in many countries, particularly in Africa and\nSoutheast Asia, an increasing number of young consumers who prefer smart\ntechnologies are emerging, making these markets more proactive in embracing EVs.\n\nHis observation reflects a trend. China's NEVs are becoming popular in overseas\nmarkets thanks to their quality, driving range and multifunctionality.\n\nSome 519,000 EVs and plug-in hybrids were exported from China between January\nand May, up 13.7 percent year-on-year, said the China Association of Automobile\nManufacturers.\n\nChina's continuous efforts to enhance institutional opening-up and secure\nhigh-standard economic and free trade agreements, alongside the swift expansion\nof its tech-intensive green product industries, are anticipated to propel its\ncompanies to strategically invest in new plants, service centers and innovation\nfacilities in markets involved in the BRI, said Yu Jianlong, vice-chairman of\nthe Beijing-headquartered China Council for the Promotion of International\nTrade.\n\nIn addition to automakers such as SAIC Motor, Beijing Automotive Group,\nGuangzhou Automobile Group and BYD, Chinese battery and component manufacturers,\nincluding Contemporary Amperex Technology Co Ltd, Gotion High-tech Co Ltd and\nEVE Energy Co Ltd, have invested in BRI economies to supply products to their\ndomestic partners and create jobs for local communities.\n\nRecognizing this trend, Matthias Loebich, partner and leader for international\nbusiness at Bearing-Point, a European management and technology consultancy with\nmore than 10,000 employees across 70 countries and regions, said that China's\nfast-growing EV sector will continue to lead the world's green transition and\ncreate enormous growth opportunities for upstream and downstream industries in\nthe BRI landscape.\n\n\"This is evident in our doubling of Chinese automotive clients seeking\nconsulting support over the past two years,\" said Loebich, noting that Chinese\nautomakers are enhancing their internal capabilities in management, digital\ntransformation and overseas strategies, learning from advanced markets to\nelevate their global presence.\n\nThe company established a dedicated team to help Chinese automakers conduct\nsustainability-related activities in both home and global markets in 2023, in\norder to further enhance their growth strength.\n\nCollectively, such moves have had a positive effect on official data. China's\nnonfinancial outbound direct investment came in at $60.2 billion in the first\nfive months, up 16.3 percent year-on-year, statistics from the Ministry of\nCommerce showed.\n\nChina's cooperation with countries and regions participating in the BRI\ncontinued to show growth momentum as ODI in these economies came in at $12.81\nbillion, up nearly 13 percent year-on-year.\n\nThe value of trade between China and BRI economies was worth 8.31 trillion yuan\n($1.14 trillion) during the January-May period, up 7.2 percent year-on-year,\ndata from the General Administration of Customs showed.\n\nSuch a rise will likely be sustained given certain strategic Chinese corporate\nmoves. For instance, in late June, Chinese train maker CRRC Corp, driven by its\nproduct upgrade and technology accumulation, unveiled seven new energy\nlocomotives in Beijing, to offer the world new solutions for green, low-carbon\ndevelopment in rail transport. These will enrich CRRC Corp's overall product\nofferings. This marked a notable step forward in green transition efforts in\nboth domestic and global markets.\n\nLin Cunzeng, CRRC's vice-president, said the development of this series of new\nenergy locomotives is a concrete step to promote the renewal and upgrade of\noutdated equipment in both home and foreign markets, and advance the green and\nlow-carbon transformation of rail transit equipment.\n\n\"They will contribute to the high-quality growth of the BRI and enrich China's\nexport content,\" said Lin.\n\nThese new locomotives, he said, will drive the demand for diverse new energy\nproducts like power batteries and hydrogen energy power packs. They will,\ntherefore, stimulate the development of upstream industries like basic materials\nand core components, fostering new drivers of economic growth.\n\nThe current reshaping of the global supply chain has generated new avenues for\nChinese companies to match their capabilities with shifting market needs, said\nLyu Yue, a professor at the Academy of China Open Economy Studies, part of the\nUniversity of International Business and Economics in Beijing.\n\n\"Showing strong competitiveness, Chinese companies excel in industries like new\nenergy vehicles, lithium-ion batteries and photovoltaic products,\" said Lyu,\nadding this has resulted in increased acceptance and collaboration from many\ncountries involved in the BRI.\n\nAgreed Michael Dyke, CEO of the Riyadh-based New Murabba Development Co, a\nbusiness unit of Saudi Arabia's Public Investment Fund. Dyke said that the\ntangible growth of the BRI and enhanced Sino-Saudi business relations will\nattract more Chinese companies to expand their market presence in Saudi Arabia.\n\nNew Murabba Development is responsible for building a modern town in Riyadh. Its\ndevelopment spans 19 square kilometers. The project will include 2 million\nsquare meters of floor space featuring retail areas, tourist attractions,\n104,000 residential units, 9,000 hotel rooms and 80 entertainment venues. Its\nfirst phase is scheduled to be completed and operationalized in 2030.\n\nChina Harbour Engineering Co Ltd, a Beijing-headquartered subsidiary of\nState-owned China Communications Construction Co Ltd, will carry out the first\nphase of excavation work for this project.",
        "summary": "Chinese automaker Great Wall Motor is building a factory in Rayong, Thailand. Beijing-based artificial intelligence services provider Terminus is charting a similar course. China's NEVs are becoming popular in overseas markets thanks to their quality, driving range and multifunctionality.",
        "source": "China Daily - Global Edition",
        "sentiment": 0.7642823047935963,
        "keywords": [],
        "categories": [],
        "image": "//img2.chinadaily.com.cn/images/202407/15/66945642a31095c551b5224e.jpeg"
    },
    {
        "publication_date": "2024-06-11 00:00:00",
        "title": "What Is a Multinational Corporation?",
        "link": "https://www.investopedia.com/terms/m/multinationalcorporation.asp",
        "content": "WHAT IS A MULTINATIONAL CORPORATION?\n\nA multinational corporation (MNC) is a company that has business operations in\nat least one country other than its home country and generates revenue beyond\nits borders. Chances are the clothes you're wearing, the smartphone in your\npocket, and the transportation you take to work all have one thing in common:\nthey were likely manufactured by an MNC, as are 90% of American imports.\n\nMultinationals permeate nearly every aspect of our modern lives while wielding a\nstaggering influence politically and economically, with more than a quarter of\nAmerican workers employed by one. The first multinationals were colonial\nenterprises. The East India Company (formed 1600), Dutch East India Company\n(VOC; 1602), and the Hudson Bay Colony (HBC, 1649) stand out as central to\nimperialist histories whose rapaciousness still haunts anyone with even the\nvaguest sense of history. Remarkably, HBC endures, as does its core business\nmodel, sourcing clothing and other materials—while holding massive amounts of\nreal estate—in one part of the world to sell finished goods to Western\nconsumers.\n\nThe MNCs formed more recently have often not equipped themselves much better:\nJust 57 multinationals were responsible for unleashing 80% of global carbon\nemissions between 2016 and 2022. Yet, despite their ubiquity in what we wear and\neven the air we breathe, there is still widespread confusion about what defines\na company as \"multinational.\" Is it simply having offices or factories overseas?\nSelling products internationally? Or is there more to it?\n\n\nKEY TAKEAWAYS\n\n * A multinational corporation (MNC) has business operations in at least two\n   countries, often with headquarters in one country and subsidiaries,\n   manufacturing plants, and offices in other nations.\n * MNCs have expanded rapidly in recent decades because of falling trade\n   barriers, the search for new markets, expanding global supply chains, and\n   outsourcing operations to lower-cost regions.\n * Multinational corporations can bring benefits like job creation,\n   infrastructure investment, and improved quality of goods in the countries\n   where they operate, but many are known for disreputable tax, environmental,\n   and labor practices.\n * Well-known examples of multinational corporations include Apple Inc. (AAPL),\n   Toyota Motor Corporation (TM), Nestle SA (NSRGY), Exxon Mobil Corp. (XOM),\n   and Coca-Cola Co. (KO).\n\nMultinationals have fundamentally shaped the flow of capital, goods, and\nservices in a world that they helped connect, perhaps more than any military,\nduring the centuries-long process of globalization. Their incredible economic\nclout has also sparked heated debates around their power, labor practices,\nenvironmental impacts, and tax avoidance strategies. In this article, we take\nyou through their history, organizational structures, and complex role in\nglobalization.\n\nInvestopedia / Jessica Olah\n\n\nHOW A MULTINATIONAL CORPORATION WORKS\n\nMNCs operate in at least two countries, with significant business activities and\ninvestments spanning across national borders. Their rise can be traced to the\n1600s and colonialism, though the modern corporation took shape with the\nemergence of large-scale industries such as oil, automobiles, and consumer goods\nin the late 19th and early 20th centuries. Companies like Standard Oil, Ford,\nand Coca-Cola were among the forerunners in expanding their operations globally\nwhile amassing revenues on par with entire nations.\n\nLater, the post-World War II era saw their accelerated growth, driven by trade\nliberalization, advances in shipping and other technologies, and the increasing\ninterconnectedness of global markets.\n\nVinci SA, the French multinational construction firm, had the most subsidiaries\nworldwide, at 2,689. In second place is HCA Healthcare, the U.S. pharmaceutical\nand healthcare giant, with 2,447.\n\nBut what are they? These companies take different forms, from giant\nconglomerates with diverse portfolios to specialized firms focusing on specific\nindustries or regions. Here are the main points about their structure:\n\n * Definition: MNCs are often formally defined as business entities with one or\n   more foreign affiliates in which the parent company holds at least a 10%\n   ownership stake. Most foreign affiliates are 100% owned by their parents.\n * Structure: MNCs typically consist of a parent company headquartered in one\n   country, with subsidiaries, branches, or joint ventures in multiple host\n   countries. The parent company maintains strategic control over its global\n   operations, setting overall goals, policies, and standards. Subsidiaries are\n   separate legal entities in the countries where they operate.\n * Governance: MNCs often have centralized management, with the most important\n   decisions made at the headquarters. However, some adopt a more decentralized\n   approach, giving regional or country-specific management teams greater\n   autonomy. MNCs may also have a matrix-like structure, where employees report\n   to both functional (e.g. marketing, finance) and geographic managers (e.g.\n   country or regional heads).\n\nThe foreign direct investment (FDI) flows of multinational corporations\nincreased by over 106 times between 1970 and 2023, from $13 billion to $1.37\ntrillion.\n\nThe specific organizational design of MNCs depends on where they are and their\nindustry. Though the two terms are often used interchangeably, multinational\nenterprises (MNEs) and MNCs are different. MNEs are entities that engage in\nforeign direct investment (FDI) and own or control production or material\ndevelopment firms in more than one country. This is a very broad definition for\na reason: MNEs include corporations, partnerships, state-run enterprises, and\nother types of business structures. MNEs can be private or state-owned and may\noperate in various sectors, such as manufacturing, services, or extractive\nindustries. MNCs are a specific type of MNE that takes the form of a\ncorporation. In sum, while all MNCs are MNEs, not all MNEs are MNCs.\n\nDeveloping an international presence can open up new markets where\nmultinationals can sell goods or produce the same quality of products at lower\ncosts. MNCs can thus reduce prices and increase the purchasing power of\nconsumers worldwide. They may also take advantage of lower tax rates in\ncountries eager for FDI, and critics point to their propensity for developing\nmonopolies where they operate. This can drive up prices, squelch competition,\nand inhibit innovation.\n\nCharacteristics of a Multinational Corporation Characteristic Description\nBenefits Challenges Examples Global Reach Operates and has a significant market\npresence in multiple countries. Access to diverse markets Navigating different\nregulations Coca-Cola, operating in over 200 countries and territories. Diverse\nOperations Engages in a wide range of business activities across different\nindustries and sectors. Diversification of risk and new markets Potential\noverextension Samsung Electronics Co., Ltd. (SSNLF), involved in electronics,\nconstruction, shipbuilding, and financial services. Intricate Business Structure\nMaintains a complicated business model and organizational structure to manage\nglobal operations. Efficient management of diverse operations Coordination and\ncommunication complexity Proctor & Gamble Co. (PG), which combines global\nbusiness units and selling and market operations. Foreign Direct Investment\nInvests directly in foreign countries, establishing subsidiaries and production\nfacilities. Control over foreign operations High initial investment, political\nrisks Toyota Motor Corporation (TM) has established numerous production plants\nand research centers across the globe. Breadth of scale Typically giant\nenterprises with significant financial resources and market power. Cost\nefficiencies, diversification of risk, market power Complexity and bureaucracy\nApple, with a market capitalization of about $3 trillion. Brand Recognition\nTypically have strong brand recognition and global marketing strategies. Enables\nMNCs to command premium prices and foster customer loyalty Maintaining a\nconsistent and positive brand image across different cultures and regulatory\nenvironments can be challenging and costly McDonald's Corp. (MCD), with its\niconic golden arches recognized worldwide. International Taxation Pays taxes in\nmultiple countries, navigating different statutory tax rates. Potential tax\nsavings through optimization Complex tax compliance, risk of penalties Starbucks\nCorp. (SBUX) has faced scrutiny controversy for using complex tax structures to\nshift profits to low-tax jurisdictions. Financial Reporting Standards Reports\nfinancial information according to International Financial Reporting Standards.\nTransparency, comparability across borders Adhering to different accounting\nstandards Siemens AG (SIEGY), the German conglomerate, must adhere to diverse\nfinancial reporting standards across across jurisdictions.\n\n\nTYPES OF MULTINATIONAL CORPORATIONS\n\n * Decentralized corporation: This type of MNC maintains a presence in its home\n   country and has autonomous offices and other facilities globally. Each office\n   manages the local business itself, making its own decisions.\n * Centralized global corporation: A central headquarters is located in the home\n   country. Executive officers and management manage the overseas offices and\n   operations, as well as domestic operations. The subsidiaries must get\n   approval from headquarters for significant activities.\n * International division of a corporation: This is the part of an MNC\n   responsible for all global operations. They can function independently of\n   domestic operations, which can pose problems when overall corporate consensus\n   and action are required.\n * Transnational corporation: A parent-subsidiary structure in which the parent\n   company oversees the operations of subsidiaries in foreign countries and the\n   home country. Subsidiaries can use the parent's assets, such as research and\n   development data. Subsidiaries may be different brands. Though differentiated\n   in the past, the term is now virtually synonymous with MNCs.\n\n\nMULTINATIONAL CORPORATIONS AND FOREIGN DIRECT INVESTMENTS\n\nThe post-World War II era saw a significant acceleration in the growth of MNCs,\nfueled by advances in transportation, shipping, communication, and trade\nliberalization. The rise of global brands like Coca-Cola, International Business\nMachines Corporation (IBM), and McDonald's exhibited the growing reach and\ninfluence of MNCs.\n\nThese global entities had the power to shape economies, industries, and\nsocieties across borders, making them a force to be reckoned with in the modern\nworld. For critics, it seemed that as the armies of Europe receded from their\ncolonies, MNCs stepped in to take their place.\n\n\nTHE CONTRIBUTIONS OF MNCS\n\nSpanning continents and with the ability to mobilize resources larger than many\nnations' annual revenues, MNCs can drive economic growth and development for\nmillions. Multinationals have attracted praise for their benefits to economic\ngrowth and criticism for their potential to exert undue influence over so-called\n\"host\" countries—those nations where their subsidiaries set up shop.\nInternational Monetary Fund (IMF) and other economists generally credit MNCs'\npositive contributions to global development. Among the most significant is\ntheir ability to attract foreign direct investment (FDI), which can inject\nmuch-needed capital, technology, and expertise into an economy.\n\nThe most common method of FDI is when a multinational acquires a local firm, but\nit can include foreign joint ventures, constructing new plants, and reinvesting\nearnings in a foreign subsidiary. Given the natural involvement of MNCs in these\ninvestments, it's an indirect measure of their spread into new markets.\nAccording to the World Bank, total FDI inflows to developing countries were\n$1.37 trillion in 2023.\n\nTypically, economists analyze inflows for specific nations to see if MNCs and\nothers are finding a country a good place to invest. The more FDI coming into a\ncountry, the more jobs it can produce and the more taxes it can collect. FDI\ninflows don't include portfolio investments like buying bonds, stocks, and other\nassets in a foreign country without gaining ownership control.\n\nFor decades, the IMF argued for countries to increase their FDI inflows through\nlower taxes and less regulation (hence shrinking the size of the state), which\nits economists typically couch in the moral language of \"macroeconomic\ndiscipline.\" As such, for much of the post-colonial period, the IMF and other\nmultinational organizations have been pushing developing economies to attract\nMNCs to set up shop there, making FDI the most capital flows into less-developed\ncountries for the decades after decolonization.\n\n\nCRITIQUES OF MNCS\n\nHowever, this push for increased FDI has not been without its critics,\nparticularly those in developing countries. MNC influence has raised complex\nquestions about the role of foreign investment, the distribution of benefits,\nand popular and local sovereignty. Once an MNC moves into an area, it can often\nsideline local industries and then use its monopolistic hold to gain significant\npolitical influence in the country. Then, in moves reminiscent, for some, of the\nflows of capital during the era of state colonialism, the profits might be\nrepatriated by MNCs to their home country, limiting the benefits of FDI for host\ncountries. These issues have led to various responses from host governments,\nincluding protests, restrictions, exclusion, and even expropriation of MNCs.\n\nMeanwhile, it's become clear that many MNCs aren't returning their funds to\nwhere they're headquartered. As a percentage of GDP, the highest FDI inflows\naren't into the U.S. or newly opened markets but tax havens like the Cayman\nIslands, which have no corporate income, capital gains, or payroll taxes. This\nmakes it an attractive destination for multinational corporations to park funds\nto minimize their taxes to the countries where that wealth was earned.\n\nCritiques of MNCs tend to fall under the following categories:\n\n * Environmental devastation: MNCs have been accused of prioritizing profits\n   over environmental protection, leading to deforestation, pollution, and\n   unsustainable resource extraction in the pursuit of cheap inputs.\n * Labor exploitation: Critics point to poor working conditions, low wages, and\n   lack of worker rights in many places where MNCs operate, amounting to a race\n   to the bottom in labor standards among the countries competing for FDI\n   inflows.\n * Tax avoidance: Countries worldwide lose billions in tax revenues due to\n   aggressive tax planning strategies MNCs use to shift profits to low-tax\n   jurisdictions.\n * Crowding out local businesses: The market power and economies of scale of\n   large MNCs make it difficult for local firms to compete, stifling local\n   entrepreneurs.\n * Political blackmail: Some argue that the IMF and World Bank's policy\n   prescriptions to attract FDI, such as deregulation and austerity, undermine\n   governments' ability to invest in public services and protect national\n   interests. However, giving up FDI would mean turning away funds needed for\n   local development, leading to Faustian bargains for many developing\n   countries.\n\n\nTHE SLOWDOWN IN FDI FLOWS\n\nBelow is a chart of the global FDI inflows as a percentage of gross domestic\nproduct (GDP) in recent decades. As you can see, the percentage spikes at the\nturn of the millennium, during the financial crisis, and then immediately after.\nThis indicates a substantial increase in the flow of foreign capital into\neconomies worldwide, reflecting a growing interest from multinational\ncorporations and investors in expanding their operations and investments abroad.\nIt could also, of course, suggest moments when capital flowed abroad, when there\nwas significant volatility in the home markets. The largest FDI inflows occur\ninto the U.S. and other developed economies.\n\n\nDeveloping countries have encouraged FDI—that is, the expansion of MNCs—to\nfinance infrastructure and create new jobs for local workers. For their part,\nthe MNCs gain from FDI by expanding further into international markets.\n\nSeveral factors are said to drive increases in FDI inflows, a measure of MNC\nexpansion beyond their home countries' borders:\n\n * Economic liberalization: Many countries have opened up their economies to\n   foreign investment by reducing trade barriers, easing restrictions on capital\n   flows, and creating more favorable investment climates.\n * Technological advances: Improvements in communication and transportation have\n   made it easier for companies to operate across borders and manage global\n   supply chains.\n * Emerging markets: The rapid growth of emerging markets has created new\n   prospects for foreign investors seeking higher returns in relatively untapped\n   markets.\n * Financial globalization: The increasing integration of financial markets has\n   made cross-border capital flows possible and made it easier for investors to\n   invest in foreign projects.\n\nGlobal FDI flows have declined significantly as a share of GDP from around 3.3%\nin the 2000s to only 1.5% or so in recent years, and this drop has\ndisproportionately affected emerging markets. While FDI flows to developed\ncountries like the U.S. increased by 29% in 2023, flows to developing countries\ndecreased by 9%. \n\nWhile the percentages and acronyms thrown around in many of these discussions\ncan seem abstract, the consequences are not. These represent millions of jobs,\nthe aspirations of local and regional economies, and massive inequalities\nworldwide that keep poverty entrenched in some regions of the globe.\n\nThe political stakes couldn't be higher. The terms economists use for the recent\ndrop in FDI flows include \"global economic fragmentation,\" which suggests a\nmovement away from a previous era's economic integration and globalization. The\ntrade wars between the U.S. and China, the pandemic, rising nationalism, and\nregional wars have upended earlier investment patterns, just as they have\nbillions of lives. We seem to have entered a new chapter, perhaps, in the\nhistory of the multinational corporation.\n\n\n\nWHY WOULD A BUSINESS WANT TO BECOME A MULTINATIONAL COMPANY?\n\nUsually, a business's primary goal is to increase profits and growth. If it can\ngrow a global customer base and increase its market share abroad, it may believe\nopening offices in foreign countries is worth the expense and effort. Companies\nmay benefit from certain tax structures or regulatory regimes found abroad.\n\n\nHOW DO MULTINATIONAL CORPORATIONS INFLUENCE GLOBAL TRADE POLICIES?\n\nMNCs greatly affect trade policies through lobbying efforts and economic\ndiplomacy. They advocate for trade agreements and regulations that favor their\nbusiness operations, often helping to shape policies to reduce tariffs, improve\nmarket access, and protect intellectual property rights. MNCs leverage their\neconomic might to negotiate favorable terms with governments, influencing\ninternational trade to attain environments conducive to their growth.\n\n\nWHAT ARE SOME RISKS MULTINATIONAL CORPORATIONS FACE?\n\nMultinational corporations are exposed to risks related to the different\ncountries and regions in which they operate. These can include regulatory or\nlegal risks, political instability, crime and violence, cultural sensitivities,\nand fluctuations in currency exchange rates.\n\n\nTHE BOTTOM LINE\n\nMultinational corporations are as influential as any stakeholders in the global\neconomy, with the potential to drive economic growth and development in the\ncountries where they operate. However, their impact on host countries,\nparticularly in the developing world, is not without controversy. While MNCs can\nbring valuable foreign direct investment, technology, and expertise, they also\nraise concerns about exploitation, loss of sovereignty, and uneven distribution\nof benefits.\n\nAs global FDI flows decline, especially in developing countries, policymakers,\nbusinesses, and civil society must work together to create a more balanced and\nequitable framework for international investment. Ultimately, the role of MNCs\nin global development is complex and constantly evolving, shaped by the actions\nand decisions of countless stakeholders worldwide.",
        "summary": "A multinational corporation (MNC) has business operations in at least two countries, often with headquarters in one country and subsidiaries, manufacturing plants, and offices in other nations. MNCs have expanded rapidly in recent decades because of falling trade barriers, the search for new markets, expanding global supply chains.",
        "source": "Investopedia",
        "sentiment": -0.1610151156783104,
        "keywords": [],
        "categories": [],
        "image": "https://www.investopedia.com/thmb/udOnLlllE9ksQ8SpF5wxPztGyuw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Term-Definitions_multinationalcorporation-479269d2539f4eda88a90b97705558a4.jpg"
    },
    {
        "publication_date": "None",
        "title": "Listed Company Information Title Search",
        "link": "https://www1.hkexnews.hk/search/titlesearch.xhtml?lang=EN&market=SEHK&stockId=150743&category=0",
        "content": "Information contained in the materials available under the web page containing\nthe hyperlink to this disclaimer is posted on this website for the purpose of\nproviding information to the public in Hong Kong. It is not intended as\ninvestment advice and must not be relied on as such. It is the sole\nresponsibility of any person who is located outside of Hong Kong to check and\ncomply with all applicable laws and regulations before accessing and using the\nmaterials and information.\n\nPlease note that the web page contains materials and information provided to\nHKEX electronically (including information provided in electronic format) by\nlisted issuers, new listing applicants and relevant parties and there is no\nagency, employee or partner relationship between HKEX and such parties. HKEX\ndoes not assume responsibility for screening, editing or monitoring such\nmaterials and the information contained in the materials. The information\ncontained in the materials is not verified by HKEX.\n\nHKEX and/or its subsidiaries take no responsibility for the materials and\ninformation available under the web page, make no representation as to their\naccuracy, reliability, completeness or ownership and expressly disclaim any\nliability whatsoever for any loss howsoever arising from or in reliance upon the\nwhole or any part of the information. Some materials may contain hyperlinks to\nexternal websites or web pages for which HKEX and/or its subsidiaries are not\nresponsible. (Please see HKEX's \"Hyperlink Policy\").\n\nNothing herein shall constitute or be considered to be a limitation upon or a\nwaiver of the privileges and immunities of HKEX and its subsidiaries, which are\nspecifically reserved.\n\nCopyright exists in the information and materials available under the web page\nand may belong to HKEX, to the author or to any other party depending on the\ncircumstances of publications. Reproduction, distribution, use and/or linking\nwithout consent from the relevant parties is not permitted.\n\nIf you believe or are aware that any information contained in the materials is\ninaccurate, erroneous, unlawful, obscene, defamatory or infringes any\nintellectual property rights of a third party, please contact HKEX e-Submission\nby email at: ESSHotline@hkex.com.hk.",
        "summary": "This website is for the purpose of providing information to the public in Hong Kong. It is not intended as investment advice and must not be relied on as such. Some materials may contain hyperlinks toexternal websites or web pages for which HKEX and/or its subsidiaries are not responsible.",
        "source": "www1.hkexnews.hk",
        "sentiment": -0.14881515875458717,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-01-14 00:00:00",
        "title": "AI Will Transform the Global Economy. Let’s Make Sure It Benefits Humanity.",
        "link": "https://www.imf.org/en/Blogs/Articles/2024/01/14/ai-will-transform-the-global-economy-lets-make-sure-it-benefits-humanity",
        "content": "We are on the brink of a technological revolution that could jumpstart\nproductivity, boost global growth and raise incomes around the world. Yet it\ncould also replace jobs and deepen inequality.\n\nThe rapid advance of artificial intelligence has captivated the world, causing\nboth excitement and alarm, and raising important questions about its potential\nimpact on the global economy. The net effect is difficult to foresee, as AI will\nripple through economies in complex ways. What we can say with some confidence\nis that we will need to come up with a set of policies to safely leverage the\nvast potential of AI for the benefit of humanity.\n\nReshaping the Nature of Work\n\nIn a new analysis, IMF staff examine the potential impact of AI on the global\nlabor market. Many studies have predicted the likelihood that jobs will be\nreplaced by AI. Yet we know that in many cases AI is likely to complement human\nwork. The IMF analysis captures both these forces.\n\nThe findings are striking: almost 40 percent of global employment is exposed to\nAI. Historically, automation and information technology have tended to affect\nroutine tasks, but one of the things that sets AI apart is its ability to impact\nhigh-skilled jobs. As a result, advanced economies face greater risks from\nAI—but also more opportunities to leverage its benefits—compared with emerging\nmarket and developing economies.\n\nIn advanced economies, about 60 percent of jobs may be impacted by AI. Roughly\nhalf the exposed jobs may benefit from AI integration, enhancing productivity.\nFor the other half, AI applications may execute key tasks currently performed by\nhumans, which could lower labor demand, leading to lower wages and reduced\nhiring. In the most extreme cases, some of these jobs may disappear.\n\nIn emerging markets and low-income countries, by contrast, AI exposure is\nexpected to be 40 percent and 26 percent, respectively. These findings suggest\nemerging market and developing economies face fewer immediate disruptions from\nAI. At the same time, many of these countries don’t have the infrastructure or\nskilled workforces to harness the benefits of AI, raising the risk that over\ntime the technology could worsen inequality among nations.\n\n\n\nAI could also affect income and wealth inequality within countries. We may see\npolarization within income brackets, with workers who can harness AI seeing an\nincrease in their productivity and wages—and those who cannot falling behind.\nResearch shows that AI can help less experienced workers enhance their\nproductivity more quickly. Younger workers may find it easier to exploit\nopportunities, while older workers could struggle to adapt.\n\nThe effect on labor income will largely depend on the extent to which AI will\ncomplement high-income workers. If AI significantly complements higher-income\nworkers, it may lead to a disproportionate increase in their labor income.\nMoreover, gains in productivity from firms that adopt AI will likely boost\ncapital returns, which may also favor high earners. Both of these phenomena\ncould exacerbate inequality.\n\nIn most scenarios, AI will likely worsen overall inequality, a troubling trend\nthat policymakers must proactively address to prevent the technology from\nfurther stoking social tensions. It is crucial for countries to establish\ncomprehensive social safety nets and offer retraining programs for vulnerable\nworkers. In doing so, we can make the AI transition more inclusive, protecting\nlivelihoods and curbing inequality.\n\nAn Inclusive AI-Driven World\n\nAI is being integrated into businesses around the world at remarkable speed,\nunderscoring the need for policymakers to act.\n\nTo help countries craft the right policies, the IMF has developed an AI\nPreparedness Index that measures readiness in areas such as digital\ninfrastructure, human-capital and labor-market policies, innovation and economic\nintegration, and regulation and ethics.\n\nThe human-capital and labor-market policies component, for example, evaluates\nelements such as years of schooling and job-market mobility, as well as the\nproportion of the population covered by social safety nets. The regulation and\nethics component assesses the adaptability to digital business models of a\ncountry’s legal framework and the presence of strong governance for effective\nenforcement.\n\nUsing the index, IMF staff assessed the readiness of 125 countries. The findings\nreveal that wealthier economies, including advanced and some emerging market\neconomies, tend to be better equipped for AI adoption than low-income countries,\nthough there is considerable variation across countries. Singapore, the United\nStates and Denmark posted the highest scores on the index, based on their strong\nresults in all four categories tracked.\n\n\n\nGuided by the insights from the AI Preparedness Index, advanced economies should\nprioritize AI innovation and integration while developing robust regulatory\nframeworks. This approach will cultivate a safe and responsible AI environment,\nhelping maintain public trust. For emerging market and developing economies, the\npriority should be laying a strong foundation through investments in digital\ninfrastructure and a digitally competent workforce.\n\nThe AI era is upon us, and it is still within our power to ensure it brings\nprosperity for all.\n\n—For more on artificial intelligence and the economy, see the December issue of\nFinance & Development, the IMF’s quarterly magazine.\n\n",
        "summary": "IMF staff examine the potential impact of AI on the global labor market. In advanced economies, about 60 percent of jobs may be impacted by AI. Roughly half the exposed jobs may benefit from AI integration, enhancing productivity. The other half, AI applications may execute key tasks currently performed by humans.",
        "source": "International Monetary Fund",
        "sentiment": 0.21344460546970367,
        "keywords": [],
        "categories": [],
        "image": "https://www.imf.org/-/media/Images/IMF/Blog/Articles/Hero/2024/01/BLOG-2099x600-MD-AI-BLOG-X-poser-Adobe-Stock.ashx"
    },
    {
        "publication_date": "2024-01-04 00:00:00",
        "title": "Hong Kong's New World Development Creates Mental Health First Responders - Bloomberg",
        "link": "https://www.bloomberg.com/news/articles/2024-01-04/hong-kong-s-new-world-development-creates-mental-health-first-responders",
        "content": "A Hong Kong family-run conglomerate is boosting its mental health support for employees, including creating “first responders” in the workplace, setting itself apart from peers in a city that has some of the most stressed out workers in the world, but where discussion around worker wellbeing is still nascent.\nNew World Development Co., the flagship property arm of the Cheng family’s business empire, is introducing mental health support as a pilot program that initially includes courses focusing on topics such as how to identify colleagues in need and handling mental health for managers and senior executives, head of sustainability Michael Long said. It will then form a longer-term strategy based on survey data collected during the pilot phase.",
        "summary": "New World Development Co., the flagship property arm of the Cheng family’s business empire, is introducing mental health support as a pilot program. It will then form a longer-term strategy based on survey data collected during the pilot phase.",
        "source": "Bloomberg",
        "sentiment": -0.04044749028980732,
        "keywords": [],
        "categories": [],
        "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iWFug17UyWZ0/v3/1200x800.jpg"
    }
]