[
    {
        "publication_date": "None",
        "title": "FOYLE FOOD GROUP LIMITED overview - Find and update company information - GOV.UK",
        "link": "https://find-and-update.company-information.service.gov.uk/company/NI034218",
        "content": "ACCOUNTS\n\nNext accounts made up to 31 December 2023\ndue by 30 September 2024\n\nLast accounts made up to 31 December 2022\n\n\nCONFIRMATION STATEMENT\n\nNext statement date 15 May 2025\ndue by 29 May 2025\n\nLast statement dated 15 May 2024",
        "summary": "summarize: ACCOUNTS.summarized: Accounts made up to 31 December 2023, 2023-2024, 2024-2025, 2026, 2027, 2028, 2029, 2030, 2031.",
        "source": "find-and-update.company-information.service.gov.uk",
        "sentiment": -0.023685818538069725,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "None",
        "title": "Bloomberg - Are you a robot?",
        "link": "https://www.bloomberg.com/profile/company/0678574D:LN",
        "content": "WHY DID THIS HAPPEN?\n\nPlease make sure your browser supports JavaScript and cookies and that you are\nnot blocking them from loading. For more information you can review our Terms of\nService and Cookie Policy.\n\n\nNEED HELP?\n\nFor inquiries related to this message please contact our support team and\nprovide the reference ID below.\n\nBlock reference ID:",
        "summary": "summarize: WHY DID THIS HAPPEN? Please make sure your browser supports JavaScript and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy. For inquiries related to this message please contact our support team and provide a reference ID.",
        "source": "bloomberg.com",
        "sentiment": -0.04044749028980732,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-03-11 00:00:00",
        "title": "Lakeland Dairies appoints new chief financial officer - Agriland.co.uk",
        "link": "https://www.agriland.co.uk/farming-news/lakeland-dairies-appoints-new-chief-financial-officer/",
        "content": "Cross-border dairy cooperative Lakeland Dairies has appointed Oliver McAllister\nas its new chief financial officer (CFO).\n\nMcAllister has over 20 years’ experience in finance and strategy and has spent\nthe last decade in some of the largest agri-food companies on the island.\n\nHe departs his current role as CFO with veterinary pharmaceuticals company\nNorbrook and will join Lakeland Dairies where he will be a member of the co-op’s\nsenior leadership team.\n\n\nNEW CHIEF FINANCIAL OFFICER\n\nMcAllister started his career working on mergers and acquisitions with PwC\nbefore pursuing a path in the agri-food industry.\n\nPrior to his role at Norbrook, he was CFO at Dale Farm Ltd. and CFO at Foyle\nFood Group. According to Lakeland, during his tenure as CFO of these businesses,\nthey experienced significant growth with McAllister playing a key and strategic\nrole.\n\nWelcoming Oliver McAllister to Lakeland Dairies, group CEO Colin Kelly said: “In\nOliver, we have appointed a CFO with a tremendous track record of innovation,\nstrategic thinking, and business growth.\n\n> “He has a deep, intrinsic and invaluable understanding of the cooperative\n> sector as well as the wider agri-food industry.\n\n“We are at a hugely exciting time for Lakeland Dairies as we continue to execute\nour ambitious strategy ‘Foundations for a Better Future’.”\n\nKelly said the processor’s goal is to deliver “sustainable prosperity” for 3,200\nfarm families who supply the co-op.\n\n“Oliver’s vision, talent and acumen will ensure that we can realise the\nambitions of our strategy for the benefit of our farmers, our people, our\ncustomers and the communities we serve,” Kelly continued.\n\n\n‘EXCITED’ TO JOIN LAKELAND DAIRIES\n\nCommenting on his appointment with Lakeland Dairies, Oliver McAllister said:\n“I’m delighted to be joining my local dairy cooperative.\n\n> “The dairy industry and the wider cooperative movement play a hugely important\n> role in enhancing the lives of people and communities across rural Ireland,\n> and this is a contribution that I deeply value.\n\n“I’m excited to be joining Lakeland Dairies at such an important time for the\ncompany. I look forward to working collectively and collaboratively with all the\ngreat people throughout the cooperative to ensure we realise our new strategic\ndirection.”\n\nA native of Co. Antrim, Oliver McAllister holds a bachelor of science in finance\nfrom Queen’s University, Belfast.\n\nHe is a chartered accountant and is a fellow of the Institute of Chartered\nAccountants in Ireland. Oliver lives in Co. Fermanagh with his wife and three\ndaughters.",
        "summary": "Oliver McAllister has over 20 years’ experience in finance and strategy. He departs his current role as CFO with veterinary pharmaceuticals company Norbrook. He will join Lakeland Dairies as a member of the co-op’s senior leadership team.",
        "source": "Agriland.co.uk",
        "sentiment": 0.35058136098086834,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-01-24 00:00:00",
        "title": "Rollercoaster year for factory prices 24 January 2024 Free",
        "link": "https://www.farmersjournal.ie/agribusiness/news/rollercoaster-year-for-factory-prices-801370",
        "content": "No matter what the price of beef is, there is always a big range of prices paid\nbetween factories for the exact same type of animal. Based on average slaughter\nweights, up to €225 per head more was paid for R3 cows and €180 per head more\nfor O=3= steers between the highest- and lowest-paying factories that reported\nprices for at least 10 weeks last year. The smallest gap in prices paid was €71\nfor U=3= heifers.\n\nOne of the frequent warnings we give in presenting this data is to be conscious\nof how external factors may influence the prices paid. These include the likes\nof organic and speciality breeds for which factories pay a premium – if there\nare substantial numbers of these in a factory’s kill, then the prices they\nreport will be inflated. Similarly, some factories pay an extra bonus to attract\ncattle in a narrow weight range, which others buy off the grid, and deals at\nflat-rate prices will often reflect higher prices for lower grades and lower\nprices for the top grades.\n\nAnother variable that can distort the picture is the effect of a factory killing\na minuscule number of cattle over the year and if these were bought at either an\nexceptionally high or exceptionally low price, they won’t necessarily reflect\nthe mainstream value.\n\nTo address this, an extra column has been added to this year’s league tables\nidentifying the number of weeks in the year for which prices in each particular\ngrade for each factory were reported.\n\nMain findings\n\nThe categories chosen to reflect 2023 are four different grades from steers,\nheifers, young bulls and cows.\n\nThese are U=3=, R=3=, O=3= and P+ 3= giving 16 categories overall and cover the\nvast majority of cattle that are going through Irish factories.\n\nAll the factories that reported for 2022 are still reporting in 2023. Kavanagh\nMeats Enniscorthy started price reporting during 2023 but are excluded from the\nleagues as they don’t have a full year of data. Kildare Chilling is separate\nfrom the Dawn group because that deal was only concluded during the year.\n\nWhile factories outside the main groups claimed several podium positions, some\nof which were based on a small number of cattle reported, several of them\nincluding ABP, Dawn and Kepak occupied positions in top half of the table. (See\nbelow)\n\nFoyle may have had less podium positions than previous years but it was still\nthere or thereabouts and it is one of the factories that pays extra for a narrow\nweight range on steers and heifers.\n\nAshbourne pushed into the top three for O=3= steers and was a consistent buyer\nas it reported for 52 weeks in that category. It was second for P+3= young bulls\nthough with a small sample size.\n\nMoyvalley claimed a first and second place in P+3= and O=3= young bulls, while\nEurofarm was second for R=3= young bulls with Foyle top for the U=3= grade.\nLiffey claimed a third place finish in the P+3= young bull category.\n\nCows\n\nWhen it comes to cows, the top positions are dominated by factories outside the\nmain groups. C&J Meats is widely known as a strong buyer of top-quality cows and\nthis is reflected in the table where it occupies the top position for U=3= and\nR=3= cows and a second place for O=3= cows.\n\nThese are the best-quality suckler-bred cows and C&J reported on these for 46\nand 52 weeks for the U and R grading cows, respectively, in 2023.\n\nTraditional Meat Company took top position for the O=3= and P+3= cows, reporting\non 50 and 25 weeks, respectively, and a second place for the R=3= grade based on\n51 weeks reporting.\n\nLiffey is also a strong cow buyer and had two third places, with Dawn\nBallyhaunis and ABP Nenagh claiming one each.\n\nGroup performance\n\nABP has the edge on U=3= and R=3= steers and heifers though it is pipped by Dawn\nfor the O=3= grade, who are also top for the P+3= grade followed by Kepak with\nABP back in third.\n\nThe top positions are divided between the big three for young bulls but when it\ncomes to cows, when the factories outside the main groups are taken together,\nthey are the top-payers in all categories apart from P+3= grade. There were some\nexcellent cow prices paid in 2023 and this merits further analysis.\n\nFactory margins\n\nIrish beef processing is privately owned and there are no accounts published\nwith the exception of Foyle and C&J Meats whose businesses operate both sides of\nthe border and in the case of Foyle it has two abattoirs in Britain as well.\n\nDunbia, which is the UK division of Dawn Meats also publishes accounts and while\nthis is outside the Republic of Ireland, between them they will give an\nindication of the financial performance. As well as being a very limited sample,\nwe also have to note that in these cases accounts are for the 2022 financial\nyear.\n\n\n\nSuckler cows and calves.\n\n\n\nC&J has a factory outside Lifford in Co Donegal, a cutting plant in Co Armagh\nand is a stakeholder in an abattoir in Co Antrim. In the year to 30 November\n2022, it had a turnover of £69.1m (€80.3m), up from £58.9m (€68.5m) in 2021.\n\nOperating profit for the year was £727,025 (€845,377) and after interest and\ntaxation, profit for the year was £490,692 (€570,572). The breakdown of sales is\n£37m (€43m) to the UK with £32m (€37m) to Europe.\n\nDunbia, the UK division of Dawn Meats since 2020, also continues to publish\nannual accounts. It is headquartered in Dungannon Co Tyrone, where it has a beef\nand sheep abattoir, cutting plant and retail packing unit. Across the UK, it has\n13 locations and for 2022 posted a £1.37bn (€1.59bn) turnover with an operating\nprofit of £12.79m (€14.87m).\n\nThe Foyle Food Group has an abattoir and cutting plant located in Cargins, Co\nDonegal, and two in Northern Ireland at Lisahally, Co Derry, and Omagh, Co\nTyrone. It also has two factories in Britain. Turnover at the Foyle Food Group\nHoldings Ltd increased to £482m (€560.4m) in 2022, up from £410m (€476.7m) in\n2021 with operating profit at £12.9m (€15m) compared with £14.6m (€17m) the\nprevious year and net profits were £9.3m (€10.8m), down from £10.7m (€12.4m) in\n2021.\n\nNumbers useful for guidance and an indication of trends\n\nLooking at factory profit figures where they exist, profits that are stated in\nmultiple millions look spectacular. There is do doubt that a well-run beef\nprocessing business can be extremely profitable but when the numbers are\nanalysed in these examples, we can see that profit margins are running between\njust under 1% and 2.7%.\n\nQuestion\n\nThe other question that remains unanswered is how representative are these\nnumbers for beef processing in the Republic of Ireland?\n\nAll of the Dunbia business is UK-based as is the largest percentage of the Foyle\nbusiness and the C&J business has a significant contribution from northern\ncattle, as well as from its Donegal factory. As with the factory league tables\nfor cattle prices, these numbers are useful for guidance and an indication of\ntrends.",
        "summary": "Up to €225 per head more was paid for R3 cows than O=3 cows. The smallest gap in prices paid was €71 per head for U=3= heifers. C&J Meats is widely known as a strong buyer of top-quality cows.",
        "source": "Irish Farmers journal",
        "sentiment": -0.2126430794596672,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "None",
        "title": "FOYLE FOOD GROUP LIMITED people - Find and update company information - GOV.UK",
        "link": "https://find-and-update.company-information.service.gov.uk/company/NI034218/officers",
        "content": " * Company Overview for FOYLE FOOD GROUP LIMITED (NI034218)\n * Filing history for FOYLE FOOD GROUP LIMITED (NI034218)\n * People for FOYLE FOOD GROUP LIMITED (NI034218)\n * Charges for FOYLE FOOD GROUP LIMITED (NI034218)\n * More for FOYLE FOOD GROUP LIMITED (NI034218)\n\n * Officers\n * Persons with significant control\n\n\nOFFICERS: 22 OFFICERS / 14 RESIGNATIONS\n\n\nFORSYTHE, STEPHEN ROBERT\n\nCorrespondence address 52 Doogary Road, Omagh, Northern Ireland, BT79 0BQ\nRole Active Secretary Appointed on 1 July 2020\n\n\nACHESON, JAMES\n\nCorrespondence address 79 Kiltyclogher Road, Cookstown, County Tyrone, Northern\nIreland, BT80 9HA\nRole Active Director Date of birth February 1966 Appointed on 18 May 1998\nNationality British Country of residence United Kingdom Occupation Company\nDirector\n\n\nACHESON, TRACEY ELIZABETH\n\nCorrespondence address 43 Killygarvan Road, Dungannon, Co Tyrone, BT71 4DE\nRole Active Director Date of birth January 1967 Appointed on 20 March 2000\nNationality British Country of residence United Kingdom Occupation Co. Director\n\n\nACHESON, WALTER TERENCE\n\nCorrespondence address 33 Tullylagan Road, Cookstown, Co Tyrone, BT80 9BE\nRole Active Director Date of birth January 1965 Appointed on 18 May 1998\nNationality British Country of residence Northern Ireland Occupation Co Director\n\n\nACHESON, WAYNE GEORGE\n\nCorrespondence address 60 Kiltyclogher Road, Cookstown, County Tyrone, Northern\nIreland, BT80 9HA\nRole Active Director Date of birth July 1968 Appointed on 18 May 1998\nNationality British Country of residence United Kingdom Occupation Company\nDirector\n\n\nFORSYTHE, STEPHEN ROBERT\n\nCorrespondence address 52 Doogary Road, Omagh, Northern Ireland, BT79 0BQ\nRole Active Director Date of birth June 1975 Appointed on 1 July 2020\nNationality British Country of residence Northern Ireland Occupation Finance\nDirector\n\n\nFREESTON, PAUL ROBERT\n\nCorrespondence address 52 Doogary Road, Omagh, Northern Ireland, BT79 0BQ\nRole Active Director Date of birth September 1959 Appointed on 1 July 2024\nNationality British Country of residence England Occupation Company Director\n\n\nMCATEER, MALACHY\n\nCorrespondence address 1 Gortmacrane Road, Kilrea, Coleraine, County\nLondonderry, Northern Ireland, BT51 5XX\nRole Active Director Date of birth April 1967 Appointed on 1 March 2013\nNationality Irish Country of residence Northern Ireland Occupation Company\nDirector\n\n\nMCALLISTER, OLIVER\n\nCorrespondence address 52 Doogary Road, Omagh, Northern Ireland, BT79 0BQ\nRole Resigned Secretary Appointed on 1 July 2017 Resigned on 30 June 2020\n\n\nMCILWAINE OBE, NIGEL OWENS\n\nCorrespondence address Cherryvale House, 100 Seacoast Road, Limavady, County\nLondonderry, Northern Ireland, BT49 9EG\nRole Resigned Secretary Appointed on 1 June 2007 Resigned on 1 July 2017\n\n\nWATSON, ROBERT ANDREW\n\nCorrespondence address Ivybank House, 7 Main Street, Donaghmore, Co. Tyrone,\nBT70 3EZ\nRole Resigned Secretary Appointed on 18 May 1998 Resigned on 21 April 2009\n\n\nARMSTRONG, PAUL\n\nCorrespondence address 10 Alandale Park, Eglinton, Co Londonderry, BT47 3QF\nRole Resigned Director Date of birth March 1969 Appointed on 16 September 2002\nResigned on 31 March 2019\nNationality Northern Irish Country of residence Northern Ireland Occupation\nCompany Director\n\n\nGIBSON OBE, CHRISTOPHER DUFFIELD\n\nCorrespondence address 18 Ballymorran Road, Killinchy, Newtownards, County Down,\nNorthern Ireland, BT23 6UE\nRole Resigned Director Date of birth April 1940 Appointed on 1 October 2005\nResigned on 31 May 2019\nNationality Irish Country of residence Northern Ireland Occupation Non Executive\nDirector\n\n\nKELSO, KAREN\n\nCorrespondence address 117a, Portadown Road, Tandragee, Craigavon, Northern\nIreland, BT62 2JX\nRole Resigned Director Date of birth February 1977 Appointed on 1 October 2019\nResigned on 12 April 2024\nNationality British Country of residence Northern Ireland Occupation Sales\nDirector\n\n\nLINDARS, DAVID\n\nCorrespondence address 12 Ray, Raynsford Road, Ware, Hertfordshire, England,\nSG12 7AJ\nRole Resigned Director Date of birth April 1962 Appointed on 5 May 2014 Resigned\non 27 February 2015\nNationality British Country of residence England Occupation Company Director\n\n\nMCALLISTER, OLIVER\n\nCorrespondence address 52 Doogary Road, Omagh, Northern Ireland, BT79 0BQ\nRole Resigned Director Date of birth December 1975 Appointed on 1 July 2017\nResigned on 30 June 2020\nNationality Irish Country of residence Northern Ireland Occupation Chartered\nAccountant\n\n\nMCCOLLUM, JANET SUSANNE BURGOYNE\n\nCorrespondence address 3 Farm Court, Waringstown, Craigavon, Northern Ireland,\nBT66 7TD\nRole Resigned Director Date of birth February 1965 Appointed on 1 October 2019\nResigned on 30 June 2024\nNationality British Country of residence Northern Ireland Occupation Company\nDirector\n\n\nMCILWAINE OBE, NIGEL OWENS\n\nCorrespondence address Cherryvale House, 100 Seacoast Road, Limavady, Co.\nLondonderry, BT49 9EG\nRole Resigned Director Date of birth January 1963 Appointed on 18 May 1998\nResigned on 1 July 2017\nNationality British Country of residence United Kingdom Occupation Company\nDirector\n\n\nMILLAR, JOHN MERVYN\n\nCorrespondence address 33 Deramore Park South, Belfast, BT9 5JY\nRole Resigned Director Date of birth July 1947 Appointed on 18 February 2008\nResigned on 31 May 2019\nNationality British Country of residence Northern Ireland Occupation Non\nExecutive Director\n\n\nO'BROIN, PAUL CAOIMH\n\nCorrespondence address Drumaville, Malin, Co Donegal, Ireland\nRole Resigned Director Date of birth June 1965 Appointed on 18 September 2009\nResigned on 24 January 2013\nNationality Irish Country of residence Ireland Occupation Company Director\n\n\nWATSON, RICHARD SAMUEL\n\nCorrespondence address Treetops, Upper Ballinderry Road, Moira\nRole Resigned Director Date of birth December 1966 Appointed on 18 May 1998\nResigned on 21 April 2009\nNationality British Occupation Company Direstor\n\n\nWATSON OBE, ROBERT ANDREW\n\nCorrespondence address Ivybank House, 7 Main Street, Donaghmore, Co Tyrone, BT70\n3EZ\nRole Resigned Director Date of birth June 1958 Appointed on 18 May 1998 Resigned\non 1 June 2007\nNationality British Occupation Co Director",
        "summary": "Filing history for FOYLE FOOD GROUP LIMITED (NI034218) is as follows: Company Overview: FOYle FOOD Group Limited (NI035218) People: 22 OFFICERS / 14 RESIGNATIONS. Charges: Charges for FOyle FOED GROUP Limited ( NI035218): 22.",
        "source": "find-and-update.company-information.service.gov.uk",
        "sentiment": -0.1170604508370161,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-07-15 00:00:00",
        "title": "Foyle farm suckler herd trials 'virtual fencing' for hill grazing - Agriland.ie",
        "link": "https://www.agriland.ie/farming-news/foyle-farm-suckler-herd-trials-virtual-fencing-for-hill-grazing/",
        "content": "The suckler herd involved in the trial\n\nFoyle Food Group’s ‘Farms of Excellence’ in Co. Tyrone has partnered with a\nNorwegian-based agri-tech company in a new hill-farm grazing trial.\n\nThe trial is set to examine how ‘virtual fencing’ can optimise the grazing\nmanagement of a suckler herd in a hill farm setting.\n\nSpeaking to Agriland, Foyle Food Group’s Andrew Clarke explained what the\nresearch hopes to achieve.\n\nHe explained that the project is being initially trialled on 26 cows and a\nbreeding bull. No collars are placed on the calves.\n\nThe trial will examine how effective the virtual fencing is in the hill\nlandscape where phone signal is poor.\n\nInitial indications are showing the virtual fence is effective despite the low\nsignal in the region and the farm has plans to expand the project to more cattle\nin the near future.\n\nClarke added that the ‘virtual fence’ is essentially a collar that is placed on\nthe livestock. A phone app shows the farmer where the cattle are located.\n\nL-r: Foyle Food Group’s Andrew Clarke, Ann Elinor Aasen from Monel, Wayne\nAcheson from Foyle Food Group and Christoffer Grindheim from Monel\n\n“I’m sitting here in the office and if I want to give the cattle grazing on the\nhill a fresh area to graze, I can use the technology to create a bigger grazing\nzone for the cattle to make their way into.\n\n> “It’s free entry for the cattle to get into the zone but once they try to go\n> out of the zone they hear a noise and they get that noise three times and then\n> it goes to a shock.\n\n“There’s a solar panel on the collars. They’re charged up at the start of the\nyear and the solar panel will keep them charged for the rest of the season.\n\n“The phone app will tell you what each collar battery is and if you have a\ncollar not working or the battery’s not charging, it will let you know,” he\noutlined.\n\nThe collars were fitted last week and have been “working well” on the herd so\nfar, according to the Foyle representative.\n\nWilson Marshall from the Foyle Food Group agri-team (left) pictured with Monil\nstaff\n\nClarke said: “There’s two reasons we wanted to trial the collars. Firstly, we\nwant to better manage the grazing of the cattle on the hill.\n\n“We want to bring the cattle to graze areas of the hill where they wouldn’t\nnormally go as a group.\n\n> “Secondly, whenever we’re serving cows with a bull on the hill, sometimes the\n> cows could be on one end of the hill and the bull could be on the other. The\n> cow could be cycling and the bull would never see her within 24 hours.\n\n“The aim of the virtual fencing is to keep the livestock batched and moved\nacross the hill. We hope to be able to basically rotationally graze the hill.\nThat’s what were trying to achieve.”\n\nThe fence can be managed from a smartphone\n\nThe Norwegian-based company involved in the trial with Foyle is ‘Monil’.\n\nAccording to their website, Monil is “a startup [business] challenging\ntraditional fences with our innovative virtual fencing technology, allowing\nanimals to roam freely while giving farmers complete control over their herd’s\nlocation and well-being”.\n\n\nFOYLE FARM\n\nFoyle Food Group’s ‘Farms of Excellence’ is located in Co. Tyrone and the\noverall farming operation encompasses 1,100ac of land. 570ac of this is\nmountain-type ground, 250ac is lowland grazing and the rest is lowland silage\nground.\n\nThe farm is continuously conducting research and trials with the aim of\nproviding practical and up-to-date information to Foyle’s beef suppliers on ways\nto further improve the economic and environmental sustainability of their farms.\n\nSome of the areas on which the farm is currently conducting research includes\nbest practice on grassland management, soil health, animal nutrition, and\nbedding for livestock.\n\nMore information on the farm can be found here.",
        "summary": "Foyle Food Group’s ‘Farms of Excellence’ in Co. Tyrone has partnered with aNorwegian-based agri-tech company in a new hill-farm grazing trial. The trial is set to examine how ‘virtual fencing’ can optimise the grazing of a suckler herd in a hill farm setting.",
        "source": "Agriland",
        "sentiment": 0.06555285304784775,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-01-13 00:00:00",
        "title": "Innovative technologies used by leading beef company",
        "link": "https://www.impartialreporter.com/news/24044770.fermanagh-grassland-club-meeting-announces-new-officers/",
        "content": "Fermanagh Grassland Club has a new Chairman for 2024 – Robin Clements, a dairy\nfarmer from Trillick, who has been Vice-Chairman for the past year.\n\nRobin succeeds Roly Graham, who ended his term as Chairman at the annual meeting\nin mid-December.\n\nFollowing the various reports from the Club Secretary, William Johnston;\nTreasurer, Philip Clarke and Chairman Roly Graham, all positions were declared\nvacant, and the guest speaker at the meeting, Andrew Clarke from the Foyle Food\nGroup, conducted the election of officers as follows:\n\nChairman: Robin Clements;\n\nVice-Chairman: Alan Burleigh;\n\nSecretary: William Johnston;\n\nTreasurer: Philip Clarke; and\n\nCommittee members: Chairman and John Egerton, Trevor Dunn, Alan Warnock, James\nMurphy, Nigel Graham and David Foster.\n\nThe main focus of the meeting was new technologies for beef, with a talk\npresented by Andrew Clarke from Foyle Group.\n\nAlso attending was Wayne Acheson, Procurement Director, Foyle Group.\n\nAndrew, who is Agricultural Manager, outlined the remit of the Group, which was\nestablished by the Acheson family in 1977 with four divisions: primary, further\nprocessing, proteins and eco.\n\nThey now operate from five sites and eight business units across the UK and\nIreland with a total of 1,150 employees, with a throughput of 7,000 cattle a\nweek.\n\nThe Foyle Group was the first of the meat plants to DNA test all cattle\nindependently following the horsegate scandal.\n\nThe group specialises in slaughtering, deboning, further processing and\nrendering, supplying the retail market, food service and butchery sectors.\n\nThey have already set an agriculture decarbonisation road map to 2030 focusing\non three main areas of animal health and nutrition, environment and genetics.\n\nThe group already works with farmers through knowledge transfer groups as well\nas best practice farms, site visits and through communications and through four\nproducer clubs: Foyle Valley, Donegal Direct, Severn Vale and Melton Moubray.\n\nAndrew explained how their hill farm, grassland farm and finishing farm all have\nprojects and targets with the aim of improving farm performance.\n\nThe hill farm is stocked with Galloway/Blue Grey crosses using the top one per\ncent of genetics, with the AA cross calves outwintered on the hill, and progeny\nfinishing at 19 months at an average 354kgs carcase weight highlighting the\nbenefits of genetics.\n\nOn the finishing farm, 100 cattle a week are brought in to replace the same\nnumber of finished cattle, where they are subject to various feeding and housing\ntrials.\n\nThey are currently experimenting with composted material for bedding as well as\nhousing design.\n\nAn innovative handling facility includes a double race.\n\nAn extensive area of the grassland farm is planted in multi-species swards.\n\nOther ideas used are in regenerative agriculture, adopting foliar feeding using\nTow and Fert machines, resulting in a 50 per cent reduction in nitrogen applied.",
        "summary": "Robin Clements succeeds Roly Graham, who ended his term as Chairman at the annual meeting in mid-December. The main focus of the meeting was new technologies for beef, with a talk from Andrew Clarke from the Foyle Food Group. The group specialises in slaughtering, deboning, further processing andrendering.",
        "source": "Impartial Reporter",
        "sentiment": 0.05056098476052284,
        "keywords": [],
        "categories": [],
        "image": null
    }
]