[
    {
        "publication_date": "2024-06-06",
        "title": "15% Of This China Mengniu Dairy Insider's Holdings Were Sold",
        "link": "https://simplywall.st/stocks/hk/food-beverage-tobacco/hkg-2319/china-mengniu-dairy-shares/news/15-of-this-china-mengniu-dairy-insiders-holdings-were-sold",
        "content": "Insiders were net sellers of China Mengniu Dairy Company Limited's (HKG:2319 )\nstock during the past year. That is, insiders sold more stock than they bought.\n\nWhile insider transactions are not the most important thing when it comes to\nlong-term investing, we do think it is perfectly logical to keep tabs on what\ninsiders are doing.\n\nSee our latest analysis for China Mengniu Dairy\n\n\nCHINA MENGNIU DAIRY INSIDER TRANSACTIONS OVER THE LAST YEAR\n\nIn the last twelve months, the biggest single sale by an insider was when the\nExecutive Vice-Chairman, Minfang Lu, sold HK$13m worth of shares at a price of\nHK$26.33 per share. While we don't usually like to see insider selling, it's\nmore concerning if the sales take place at a lower price. It's of some comfort\nthat this sale was conducted at a price well above the current share price,\nwhich is HK$14.76. So it may not shed much light on insider confidence at\ncurrent levels. The only individual insider seller over the last year was\nMinfang Lu.\n\nMinfang Lu sold a total of 634.00k shares over the year at an average price of\nCN¥26.40. You can see a visual depiction of insider transactions (by companies\nand individuals) over the last 12 months, below. If you want to know exactly who\nsold, for how much, and when, simply click on the graph below!\n\nSEHK:2319 Insider Trading Volume June 6th 2024\n\nIf you like to buy stocks that insiders are buying, rather than selling, then\nyou might just love this free list of companies. (Hint: Most of them are flying\nunder the radar).\n\n\nINSIDER OWNERSHIP\n\nLooking at the total insider shareholdings in a company can help to inform your\nview of whether they are well aligned with common shareholders. A high insider\nownership often makes company leadership more mindful of shareholder interests.\nIt appears that China Mengniu Dairy insiders own 0.1% of the company, worth\nabout HK$84m. We've certainly seen higher levels of insider ownership elsewhere,\nbut these holdings are enough to suggest alignment between insiders and the\nother shareholders.\n\n\nSO WHAT DOES THIS DATA SUGGEST ABOUT CHINA MENGNIU DAIRY INSIDERS?\n\nIt doesn't really mean much that no insider has traded China Mengniu Dairy\nshares in the last quarter. Still, the insider transactions at China Mengniu\nDairy in the last 12 months are not very heartening. But we do like the fact\nthat insiders own a fair chunk of the company. In addition to knowing about\ninsider transactions going on, it's beneficial to identify the risks facing\nChina Mengniu Dairy. Case in point: We've spotted 2 warning signs for China\nMengniu Dairy you should be aware of.\n\nIf you would prefer to check out another company -- one with potentially\nsuperior financials -- then do not miss this free list of interesting companies,\nthat have HIGH return on equity and low debt.\n\nFor the purposes of this article, insiders are those individuals who report\ntheir transactions to the relevant regulatory body. We currently account for\nopen market transactions and private dispositions of direct interests only, but\nnot derivative transactions or indirect interests.\n\n\nVALUATION IS COMPLEX, BUT WE'RE HELPING MAKE IT SIMPLE.\n\nFind out whether China Mengniu Dairy is potentially over or undervalued by\nchecking out our comprehensive analysis, which includes fair value estimates,\nrisks and warnings, dividends, insider transactions and financial health.\n\nView the Free Analysis\n\nHave feedback on this article? Concerned about the content? Get in touch with us\ndirectly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based\non historical data and analyst forecasts only using an unbiased methodology and\nour articles are not intended to be financial advice. It does not constitute a\nrecommendation to buy or sell any stock, and does not take account of your\nobjectives, or your financial situation. We aim to bring you long-term focused\nanalysis driven by fundamental data. Note that our analysis may not factor in\nthe latest price-sensitive company announcements or qualitative material. Simply\nWall St has no position in any stocks mentioned.",
        "summary": "Insiders were net sellers of China Mengniu Dairy Company Limited's (HKG:2319) stock during the past year. The biggest single sale by an insider was when the Executive Vice-Chairman, Minfang Lu, sold HK$13m worth of shares at a price of HK$26.33 per share.",
        "source": "Simply Wall Street",
        "sentiment": 0.00031257420778274536,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-06-26",
        "title": " No related news. ",
        "link": "http://www.aastocks.com/en/stocks/news/aamm-news/AAV2406254925/1",
        "content": "Copyright(C) AASTOCKS.com Limited 2000. All rights reserved.\nDisclaimer: AASTOCKS.com Ltd, HKEx Information Services Limited, its holding\ncompanies and/or any subsidiaries of such holding companies endeavour to ensure\nthe accuracy and reliability of the Information provided but do not guarantee\nits accuracy or reliability and accept no liability (whether in tort or contract\nor otherwise) for any loss or damage arising from any inaccuracies or omissions.",
        "summary": "AASTOCKS.com does not guarantee the accuracy and reliability of the Information provided. We accept no liability (whether in tort or contractor otherwise) for any loss or damage arising from any inaccuracies or omissions. For confidential support call the Samaritans on 08457 90 90 90, visit a local Samaritans branch or see www.samaritans.org.",
        "source": "AASTOCKS.com",
        "sentiment": -0.010922953486442566,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-07-13",
        "title": "China Mengniu Dairy Company Limited (OTCMKTS:CIADY) Sees Significant Increase in Short Interest",
        "link": "https://www.defenseworld.net/2024/07/13/china-mengniu-dairy-company-limited-otcmktsciady-sees-significant-increase-in-short-interest.html",
        "content": "Posted by on Jul 13th, 2024\n\nChina Mengniu Dairy Company Limited (OTCMKTS:CIADY – Get Free Report) saw a\nlarge growth in short interest in June. As of June 30th, there was short\ninterest totalling 25,100 shares, a growth of 1,221.1% from the June 15th total\nof 1,900 shares. Based on an average trading volume of 94,800 shares, the\ndays-to-cover ratio is presently 0.3 days.\n\n\nCHINA MENGNIU DAIRY STOCK PERFORMANCE\n\nCIADY stock opened at $18.81 on Friday. China Mengniu Dairy has a 1-year low of\n$16.29 and a 1-year high of $38.17. The business has a 50 day simple moving\naverage of $19.03 and a two-hundred day simple moving average of $21.76.\n\n\nCHINA MENGNIU DAIRY INCREASES DIVIDEND\n\nThe firm also recently declared a dividend, which was paid on Thursday, July\n11th. Shareholders of record on Monday, June 17th were paid a $0.6052 dividend.\nThis is an increase from China Mengniu Dairy’s previous dividend of $0.53. The\nex-dividend date of this dividend was Monday, June 17th.\n\n\nCHINA MENGNIU DAIRY COMPANY PROFILE\n\n(Get Free Report)\n\nChina Mengniu Dairy Company Limited, an investment holding company, engages in\nthe manufacture and distribution of dairy products under the MENGNIU brand in\nthe People's Republic of China and internationally. It operates through Liquid\nMilk Business, Ice Cream Business, Milk Formula Business, and Cheese Business,\nand Other segments.\n\n\nFEATURED ARTICLES\n\n * Five stocks we like better than China Mengniu Dairy\n * 5 discounted opportunities for dividend growth investors\n * Top 3 Beverage Stocks: Summer Earnings Reveal Key Trends\n * Top Biotech Stocks: Exploring Innovation Opportunities\n * This Financial Stock’s Earnings Signal a Buying Opportunity\n * How to Read Stock Charts for Beginners\n * Social Platform Stock Hits New Highs: Is More Growth Ahead?\n\nReceive News & Ratings for China Mengniu Dairy Daily - Enter your email address\nbelow to receive a concise daily summary of the latest news and analysts'\nratings for China Mengniu Dairy and related companies with MarketBeat.com's FREE\ndaily email newsletter.\n\n\n« PREVIOUS HEADLINE\n\nGSA Capital Partners LLP Makes New $700,000 Investment in Banco Bradesco S.A.\n(NYSE:BBD)\n\n\nNEXT HEADLINE »\n\nShort Interest in Galecto, Inc. (NASDAQ:GLTO) Increases By 1,084.6%\n\n\nYOU MIGHT BE INTERESTED IN:\n",
        "summary": "China Mengniu Dairy Company Limited (OTCMKTS:CIADY – Get Free Report) saw a large growth in short interest in June. As of June 30th, there was short interest totalling 25,100 shares, a growth of 1,221.1% from the June 15th total. The firm also recently declared a dividend, which was paid on Thursday, July 11th.",
        "source": "Defense World",
        "sentiment": 0.5977776199579239,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-07-14",
        "title": "Here's What To Make Of China Mengniu Dairy's (HKG:2319) Decelerating Rates Of Return",
        "link": "https://simplywall.st/stocks/hk/food-beverage-tobacco/hkg-2319/china-mengniu-dairy-shares/news/heres-what-to-make-of-china-mengniu-dairys-hkg2319-decelerat",
        "content": "There are a few key trends to look for if we want to identify the next\nmulti-bagger. Firstly, we'll want to see a proven return on capital employed\n(ROCE) that is increasing, and secondly, an expanding base of capital employed.\nPut simply, these types of businesses are compounding machines, meaning they are\ncontinually reinvesting their earnings at ever-higher rates of return. However,\nafter investigating China Mengniu Dairy (HKG:2319), we don't think it's current\ntrends fit the mold of a multi-bagger.\n\n\nRETURN ON CAPITAL EMPLOYED (ROCE): WHAT IS IT?\n\nJust to clarify if you're unsure, ROCE is a metric for evaluating how much\npre-tax income (in percentage terms) a company earns on the capital invested in\nits business. To calculate this metric for China Mengniu Dairy, this is the\nformula:\n\nReturn on Capital Employed = Earnings Before Interest and Tax (EBIT) ÷ (Total\nAssets - Current Liabilities)\n\n0.066 = CN¥5.5b ÷ (CN¥115b - CN¥33b) (Based on the trailing twelve months to\nDecember 2023).\n\nTherefore, China Mengniu Dairy has an ROCE of 6.6%. In absolute terms, that's a\nlow return and it also under-performs the Food industry average of 8.6%.\n\nCheck out our latest analysis for China Mengniu Dairy\n\nSEHK:2319 Return on Capital Employed July 14th 2024\n\nIn the above chart we have measured China Mengniu Dairy's prior ROCE against its\nprior performance, but the future is arguably more important. If you'd like, you\ncan check out the forecasts from the analysts covering China Mengniu Dairy for\nfree.\n\n\nTHE TREND OF ROCE\n\nIn terms of China Mengniu Dairy's historical ROCE trend, it doesn't exactly\ndemand attention. Over the past five years, ROCE has remained relatively flat at\naround 6.6% and the business has deployed 100% more capital into its operations.\nThis poor ROCE doesn't inspire confidence right now, and with the increase in\ncapital employed, it's evident that the business isn't deploying the funds into\nhigh return investments.\n\n\nOUR TAKE ON CHINA MENGNIU DAIRY'S ROCE\n\nIn summary, China Mengniu Dairy has simply been reinvesting capital and\ngenerating the same low rate of return as before. And investors appear hesitant\nthat the trends will pick up because the stock has fallen 50% in the last five\nyears. In any case, the stock doesn't have these traits of a multi-bagger\ndiscussed above, so if that's what you're looking for, we think you'd have more\nluck elsewhere.\n\nLike most companies, China Mengniu Dairy does come with some risks, and we've\nfound 2 warning signs that you should be aware of.\n\nFor those who like to invest in solid companies, check out this free list of\ncompanies with solid balance sheets and high returns on equity.\n\n\nVALUATION IS COMPLEX, BUT WE'RE HELPING MAKE IT SIMPLE.\n\nFind out whether China Mengniu Dairy is potentially over or undervalued by\nchecking out our comprehensive analysis, which includes fair value estimates,\nrisks and warnings, dividends, insider transactions and financial health.\n\nView the Free Analysis\n\nHave feedback on this article? Concerned about the content? Get in touch with us\ndirectly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based\non historical data and analyst forecasts only using an unbiased methodology and\nour articles are not intended to be financial advice. It does not constitute a\nrecommendation to buy or sell any stock, and does not take account of your\nobjectives, or your financial situation. We aim to bring you long-term focused\nanalysis driven by fundamental data. Note that our analysis may not factor in\nthe latest price-sensitive company announcements or qualitative material. Simply\nWall St has no position in any stocks mentioned.\n\n\nVALUATION IS COMPLEX, BUT WE'RE HELPING MAKE IT SIMPLE.\n\nFind out whether China Mengniu Dairy is potentially over or undervalued by\nchecking out our comprehensive analysis, which includes fair value estimates,\nrisks and warnings, dividends, insider transactions and financial health.\n\nView the Free Analysis\n\nHave feedback on this article? Concerned about the content? Get in touch with us\ndirectly. Alternatively, email editorial-team@simplywallst.com",
        "summary": "China Mengniu Dairy (HKG:2319) has an ROCE of 6.6%. In absolute terms, that's a low return and it also under-performs the Food industry average. Over the past five years, the business has deployed 100% more capital into its operations.",
        "source": "Simply Wall Street",
        "sentiment": -0.0854417160153389,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-03-26",
        "title": "China Mengniu Dairy Company Limited's (HKG:2319) Shares May Have Run Too Fast Too Soon",
        "link": "https://simplywall.st/stocks/hk/food-beverage-tobacco/hkg-2319/china-mengniu-dairy-shares/news/china-mengniu-dairy-company-limiteds-hkg2319-shares-may-have",
        "content": "When close to half the companies in Hong Kong have price-to-earnings ratios (or\n\"P/E's\") below 8x, you may consider China Mengniu Dairy Company Limited\n(HKG:2319) as a stock to avoid entirely with its 15.4x P/E ratio. Although, it's\nnot wise to just take the P/E at face value as there may be an explanation why\nit's so lofty.\n\nChina Mengniu Dairy could be doing better as its earnings have been going\nbackwards lately while most other companies have been seeing positive earnings\ngrowth. One possibility is that the P/E is high because investors think this\npoor earnings performance will turn the corner. You'd really hope so, otherwise\nyou're paying a pretty hefty price for no particular reason.\n\nCheck out our latest analysis for China Mengniu Dairy\n\nSEHK:2319 Price to Earnings Ratio vs Industry March 26th 2024\n\nWant the full picture on analyst estimates for the company? Then our free report\non China Mengniu Dairy will help you uncover what's on the horizon.\n\n\nDOES GROWTH MATCH THE HIGH P/E?\n\nThere's an inherent assumption that a company should far outperform the market\nfor P/E ratios like China Mengniu Dairy's to be considered reasonable.\n\nIf we review the last year of earnings, dishearteningly the company's profits\nfell to the tune of 22%. However, a few very strong years before that means that\nit was still able to grow EPS by an impressive 41% in total over the last three\nyears. Accordingly, while they would have preferred to keep the run going,\nshareholders would probably welcome the medium-term rates of earnings growth.\n\nShifting to the future, estimates from the analysts covering the company suggest\nearnings should grow by 16% per annum over the next three years. Meanwhile, the\nrest of the market is forecast to expand by 15% per year, which is not\nmaterially different.\n\nIn light of this, it's curious that China Mengniu Dairy's P/E sits above the\nmajority of other companies. It seems most investors are ignoring the fairly\naverage growth expectations and are willing to pay up for exposure to the stock.\nThese shareholders may be setting themselves up for disappointment if the P/E\nfalls to levels more in line with the growth outlook.\n\n\nTHE FINAL WORD\n\nIt's argued the price-to-earnings ratio is an inferior measure of value within\ncertain industries, but it can be a powerful business sentiment indicator.\n\nWe've established that China Mengniu Dairy currently trades on a higher than\nexpected P/E since its forecast growth is only in line with the wider market.\nWhen we see an average earnings outlook with market-like growth, we suspect the\nshare price is at risk of declining, sending the high P/E lower. This places\nshareholders' investments at risk and potential investors in danger of paying an\nunnecessary premium.\n\nBefore you settle on your opinion, we've discovered 1 warning sign for China\nMengniu Dairy that you should be aware of.\n\nYou might be able to find a better investment than China Mengniu Dairy. If you\nwant a selection of possible candidates, check out this free list of interesting\ncompanies that trade on a low P/E (but have proven they can grow earnings).\n\n\nVALUATION IS COMPLEX, BUT WE'RE HELPING MAKE IT SIMPLE.\n\nFind out whether China Mengniu Dairy is potentially over or undervalued by\nchecking out our comprehensive analysis, which includes fair value estimates,\nrisks and warnings, dividends, insider transactions and financial health.\n\nView the Free Analysis\n\nHave feedback on this article? Concerned about the content? Get in touch with us\ndirectly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based\non historical data and analyst forecasts only using an unbiased methodology and\nour articles are not intended to be financial advice. It does not constitute a\nrecommendation to buy or sell any stock, and does not take account of your\nobjectives, or your financial situation. We aim to bring you long-term focused\nanalysis driven by fundamental data. Note that our analysis may not factor in\nthe latest price-sensitive company announcements or qualitative material. Simply\nWall St has no position in any stocks mentioned.",
        "summary": "China Mengniu Dairy Company Limited(HKG:2319) has a 15.4x P/E ratio. The company's earnings have been going backwards while most other companies have been seeing positive earningsgrowth. The P/ E is high because investors think this poor earnings performance will turn the corner.",
        "source": "Simply Wall Street",
        "sentiment": 0.29810330271720886,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-03-27",
        "title": "Chinese dairy giant Mengniu sees profit, revenue growth in 2023",
        "link": "http://english.news.cn/20240327/799ea5b0efd944ce960364b99336f108/c.html",
        "content": "HOHHOT, March 27 (Xinhua) -- China Mengniu Dairy Company Limited reported an\noperating profit of 6.17 billion yuan (about 870 million U.S. dollars) in 2023,\nup 13.8 percent year on year, the company said in its annual report.\n\nThe company's revenue totaled 98.62 billion yuan last year, marking a\nyear-on-year increase of 6.5 percent, according to the report.\n\nIts liquid milk business contributed 82.07 billion yuan in revenue, followed by\ncontributions from ice cream, cheese and milk powder businesses.\n\nChina's dairy industry faced challenges such as a short-term slowdown in growth\nand declining raw milk prices in 2023 but demands for dairy products remain\nresilient thanks to rising public awareness of nutrition and health in the\npost-pandemic era, according to the company. ■",
        "summary": "China Mengniu Dairy Company Limited reported profit of 6.17 billion yuan (about 870 million U.S. dollars) in 2023. Revenue totaled 98.62 billion yuan last year, marking a 6.5 percent increase. Liquid milk business contributed 82.07 billion yuan in revenue, followed by ice cream, cheese and milk powder.",
        "source": "english.news.cn",
        "sentiment": 0.9208827707916498,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-03-28",
        "title": "Mengniu: 2023 domestic dairy consumption in China showed signs of a modest recovery",
        "link": "https://dairynews.today/global/news/mengniu-2023-domestic-dairy-consumption-showed-signs-of-a-modest-recovery.html",
        "content": "China Mengniu Dairy Company Limited (Stock Code: 2319) has unveiled its 2023\nannual results, showcasing robust performance despite challenges in the dairy\nsector.\n\nThe report reveals a total annual revenue of RMB 98.62 billion, marking a\nnotable year-on-year growth of 6.5%. Operating profit surged to RMB6.17 billion,\nreflecting an increase of 13.8%.\n\nThroughout 2023, Mengniu navigated a dynamic landscape characterized by a modest\nrecovery in domestic dairy consumption, evolving consumer preferences, and\nintensified market competition.\n\n\"Throughout 2023, domestic dairy consumption showed signs of a modest recovery,\nwith the growth rate of dairy product consumption experiencing a short-term\nslowdown and the reorganization of online and offline sales channels. These\nfactors contributed to increased market competition. In the post-pandemic era,\nChinese consumers' awareness of nutrition and health has continued to rise,\nshowcasing the strong resilience in demand for dairy products\", - company\nreported.\n\nKey highlights of Mengniu's performance include:\n\n * Growth in the core \"liquid milk\" business, expanding market share\n   continuously.\n * Strengthened market position of \"Milk Deluxe,\" maintaining leadership in the\n   high-end market segment.\n * Counter-trend growth and sustained market leadership in chilled yogurt\n   business, emphasizing taste, nutrition, and functionality.\n * Outpacing industry growth in the fresh milk segment, with \"Shiny Meadow\"\n   leading the high-end market with upgraded quality.\n * Successful channel transformation, leveraging offline and online retail\n   channels to reach consumers effectively.\n * Continued dominance in online sales, with over 74 million online members in\n   new retail channels.\n * Strengthened control over rural markets, covering extensive distribution\n   points across townships.\n * Flagship products like \"Milk Deluxe\" and \"Just Yoghurt\" drove market\n   innovation through product differentiation and brand enhancement.\n\nMengniu's commitment to nutritional innovation resulted in the successful launch\nof products like \"Mengniu Fresh Yogurt\" and \"Shiny Meadow 4.0 Fresh Jersey\nMilk,\" capturing market share in the nutritious segment.\n\nFurthermore, sub-brands like \"Xiaoxianyu\" targeted at young consumers achieved\nremarkable sales growth, solidifying Mengniu's position in the mid-to-high-end\nfresh milk market.\n\nAmidst evolving consumer trends and market dynamics, Mengniu remains focused on\ninnovation, brand-building, and meeting consumer needs across various product\nsegments, ensuring sustained growth and market leadership in the dairy industry.",
        "summary": "China Mengniu Dairy Company Limited (Stock Code: 2319) has unveiled its 2023 annual results. The report reveals a total annual revenue of RMB 98.62 billion, marking a year-on-year growth of 6.5%. Operating profit surged to RMB6.17 billion,reflecting an increase of 13.8%.",
        "source": "DairyNews",
        "sentiment": 0.9413892729207873,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-03-28",
        "title": "China Mengniu Dairy Full Year 2023 Earnings: EPS Misses Expectations",
        "link": "https://simplywall.st/stocks/hk/food-beverage-tobacco/hkg-2319/china-mengniu-dairy-shares/news/china-mengniu-dairy-full-year-2023-earnings-eps-misses-expec",
        "content": "CHINA MENGNIU DAIRY (HKG:2319) FULL YEAR 2023 RESULTS\n\n\nKEY FINANCIAL RESULTS\n\n * Revenue: CN¥98.6b (up 6.5% from FY 2022).\n * Net income: CN¥4.81b (down 9.3% from FY 2022).\n * Profit margin: 4.9% (down from 5.7% in FY 2022). The decrease in margin was\n   driven by higher expenses.\n * EPS: CN¥1.22 (down from CN¥1.34 in FY 2022).\n\nSEHK:2319 Earnings and Revenue Growth March 28th 2024\n\nAll figures shown in the chart above are for the trailing 12 month (TTM) period\n\n\nCHINA MENGNIU DAIRY EPS MISSES EXPECTATIONS\n\nRevenue was in line with analyst estimates. Earnings per share (EPS) missed\nanalyst estimates by 13%.\n\nLooking ahead, revenue is forecast to grow 6.6% p.a. on average during the next\n3 years, compared to a 7.6% growth forecast for the Food industry in Hong Kong.\n\nPerformance of the Hong Kong Food industry.\n\nThe company's shares are down 15% from a week ago.\n\n\nBALANCE SHEET ANALYSIS\n\nWhile earnings are important, another area to consider is the balance sheet. See\nour latest analysis on China Mengniu Dairy's balance sheet health.\n\n\nVALUATION IS COMPLEX, BUT WE'RE HELPING MAKE IT SIMPLE.\n\nFind out whether China Mengniu Dairy is potentially over or undervalued by\nchecking out our comprehensive analysis, which includes fair value estimates,\nrisks and warnings, dividends, insider transactions and financial health.\n\nView the Free Analysis\n\nHave feedback on this article? Concerned about the content? Get in touch with us\ndirectly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based\non historical data and analyst forecasts only using an unbiased methodology and\nour articles are not intended to be financial advice. It does not constitute a\nrecommendation to buy or sell any stock, and does not take account of your\nobjectives, or your financial situation. We aim to bring you long-term focused\nanalysis driven by fundamental data. Note that our analysis may not factor in\nthe latest price-sensitive company announcements or qualitative material. Simply\nWall St has no position in any stocks mentioned.",
        "summary": "Revenue was in line with analyst estimates. Earnings per share (EPS) missed analyst estimates by 13%. Revenue is forecast to grow 6.6% p.a. on average during the next three years. The company's shares are down 15% from a week ago.",
        "source": "Simply Wall Street",
        "sentiment": -0.7732159346342087,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-04-02",
        "title": "Dairy Giant Mengniu Sees Revenue Up 6.5% In 2023 | ESM Magazine",
        "link": "https://www.esmmagazine.com/fresh-produce/dairy-giant-mengniu-sees-revenue-up-6-5-in-2023-262494",
        "content": "Chinese dairy giant Mengniu has reported annual revenue of RMB98.62 billion\n(€12.71 billion) in its 2023 financial year, representing year-on-year growth of\n6.5%.\n\nOperating profit reached RMB6.17 billion (€790 million) for the period, an\nincrease of 13.8% from the previous year, with the company noting a 'continuous\nyear-on-year improvement in operating profit margin', of 40 basis points, to\n6.3%.\n\nThe group said that during 2023, it 'demonstrated steadfast confidence in its\nbusiness development, profitability, and future prospects', while also engaging\nin a share buyback scheme and raising its dividend payout ratio for\nshareholders.\n\nThroughout 2023, domestic dairy consumption exhibited a modest recovery, with\nthe growth rate of dairy product consumption experiencing a temporary slowdown\ndue to the reorganisation of online and offline sales channels, leading to\nheightened competition, the company stated.\n\nAdditionally, it highlighted that Chinese consumers' awareness of nutrition and\nhealth has continued to increase since the pandemic, indicating robust\nresilience in demand for dairy products.\n\n\nCORE BUSINESS\n\n'In the face of external challenges, Mengniu maintained its commitment to a\nstrategy focused on high-quality growth, actively strengthening its core\nbusiness, optimising its business structure, and refining its operational\nmanagement,' Mengniu said in a statement.\n\n'These actions have led to steady revenue growth and a consistent improvement in\noperating profit margins.'\n\n\nPRODUCT DEVELOPMENT\n\nThe group's Milk Deluxe brand experienced a robust year, supported by product\ninnovation and the enhancement of brand value. Similarly, its Just Yoghurt brand\nintroduced a new packaging format and invested in brand differentiation, while\nMengniu also invested in a high-end yoghurt brand called YO! Fine Diary.\n\nAdditionally, the company launched a flagship lactose-free milk product under\nits parent brand, catering to specific consumer needs, known as Yoyi C.",
        "summary": "Mengniu reported annual revenue of RMB98.62 billion (€12.71 billion) in its 2023 financial year, representing year-on-year growth of 6.5%. The group's Milk Deluxe brand experienced a robust year, supported by product innovation and the enhancement of brand value.",
        "source": "European Supermarket Magazine",
        "sentiment": 0.9441865617409348,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-02-19",
        "title": "FAST NEWS: Modern Dairy’s profit plunges on weaker margins - Bamboo Works - Where China Stocks meet global investors",
        "link": "https://thebambooworks.com/fast-news-modern-dairys-profit-plunges-on-weaker-margins/",
        "content": "The latest: Dairy farming company China Modern Dairy Holdings Ltd. (1117.HK)\nsaid on Friday it expects to report a profit of 160 million yuan ($22.5 million)\nto 200 million yuan for 2023, down 66% to 72% year-on-year.\n\nLooking up: The company’s new business areas such as feed, digital intelligence\nplatforms and forage grass planting, contributed to its profit last year as its\nrevenue jumped 40% to 3.3 billion yuan.\n\nTake Note: The decrease in the company’s profit owed primarily to higher losses\nrelated to changes in the fair value of its dairy cows, and lower profit margins\nfor its raw milk business.\n\nDigging Deeper: Established in 2005 in China’s Anhui Province, Modern Dairy\nfocuses on dairy farming and milk production in China and raised HK$2.6 billion\n($330 million) in a 2010 Hong Kong listing. It became a subsidiary of Mengniu\nDairy (2319.HK) in 2017 when the dairy giant purchased 965 million Modern Dairy\nshares, raising its stake to 39.9%. Modern Dairy’s business was growing, but\ntook a hit during the pandemic on reduced overseas demand.\n\nMarket Reaction: Modern Dairy’s shares fell on Monday, closing down 4.3% to\nHK$0.67 at the midday break. The stock now trades near the lower end of its\n52-week range.\n\nTranslation by A. Au\n\nTo subscribe to Bamboo Works weekly free newsletter, click here\n\n\nRELATED ARTICLES\n\n\n\n\nRECENT ARTICLES\n\n\n\n\nJINKOSOLAR FINDS RARE BRIGHT SPOT IN NEW SAUDI TIE-UP\n\nThe company unveiled a $1 billion joint venture with two local entities to\nproduce cutting-edge solar panels in the Middle East Key Takeaways: JinkoSolar\nis forming a $1 billion joint…\n\nJuly 17, 2024\n\nJKS.US 688223.SHG\n\n\nJ&T DITCHES LOW-PRICE STRATEGY TO FOCUS ON CUSTOMIZED DELIVERIES\n\nThe upstart logistics provider has moved on from its controversial pricing-based\nstrategy, as it continues to log rapid growth  Key Takeaways: J&T’s average\ndaily parcel volume in China rose 36.3%…\n\n\nPODCAST: HEADWINDS FOR CHINA-EUROPEAN FLIGHTS, AND AN AUTONOMOUS DRIVING IPO\nEXPLOSION\n\nA year and a half after ending its Covid restrictions, flights between China and\nEurope are still well below pre-pandemic levels. What's holding things back? And\na steady flow of autonomous driving companies are suddenly accelerating towards\nIPOs in the US and Hong Kong. What's fueling the drive, and will investors buy\ninto it?\n\n\nXIAOHONGSHU’S NEW FUNDING: RETURN TO OLD TIMES OR END OF A CHAPTER?\n\nThe social e-commerce company, whose name means ‘Little Red Book,’ scored a\nrelative rarity by attracting Western big-name DST in its latest funding round\nKey Takeaways: Xiaohongshu was valued at…",
        "summary": "Dairy farming company China Modern Dairy Holdings Ltd. (1117.HK) said on Friday it expects to report a profit of 160 million yuan ($22.5 million)                to 200 million yuan for 2023, down 66% to 72% year-on-year. Established in 2005 in China’s Anhui Province, Modern Dairyfocuses on dairy farming and milk production in China.",
        "source": "Bamboo Works",
        "sentiment": -0.7459348514676094,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-04-30",
        "title": "Here's Why China Mengniu Dairy (HKG:2319) Can Manage Its Debt Responsibly",
        "link": "https://simplywall.st/stocks/hk/food-beverage-tobacco/hkg-2319/china-mengniu-dairy-shares/news/heres-why-china-mengniu-dairy-hkg2319-can-manage-its-debt-re-1",
        "content": "David Iben put it well when he said, 'Volatility is not a risk we care about.\nWhat we care about is avoiding the permanent loss of capital.' So it seems the\nsmart money knows that debt - which is usually involved in bankruptcies - is a\nvery important factor, when you assess how risky a company is. As with many\nother companies China Mengniu Dairy Company Limited (HKG:2319) makes use of\ndebt. But the real question is whether this debt is making the company risky.\n\n\nWHAT RISK DOES DEBT BRING?\n\nDebt is a tool to help businesses grow, but if a business is incapable of paying\noff its lenders, then it exists at their mercy. Ultimately, if the company can't\nfulfill its legal obligations to repay debt, shareholders could walk away with\nnothing. However, a more usual (but still expensive) situation is where a\ncompany must dilute shareholders at a cheap share price simply to get debt under\ncontrol. Of course, plenty of companies use debt to fund growth, without any\nnegative consequences. When we think about a company's use of debt, we first\nlook at cash and debt together.\n\nSee our latest analysis for China Mengniu Dairy\n\n\nHOW MUCH DEBT DOES CHINA MENGNIU DAIRY CARRY?\n\nYou can click the graphic below for the historical numbers, but it shows that\nChina Mengniu Dairy had CN¥36.2b of debt in December 2023, down from CN¥38.0b,\none year before. However, it does have CN¥13.7b in cash offsetting this, leading\nto net debt of about CN¥22.6b.\n\nSEHK:2319 Debt to Equity History April 30th 2024\n\n\nHOW HEALTHY IS CHINA MENGNIU DAIRY'S BALANCE SHEET?\n\nAccording to the last reported balance sheet, China Mengniu Dairy had\nliabilities of CN¥32.6b due within 12 months, and liabilities of CN¥32.0b due\nbeyond 12 months. Offsetting this, it had CN¥13.7b in cash and CN¥12.5b in\nreceivables that were due within 12 months. So its liabilities outweigh the sum\nof its cash and (near-term) receivables by CN¥38.4b.\n\nThis is a mountain of leverage relative to its market capitalization of\nCN¥59.8b. This suggests shareholders would be heavily diluted if the company\nneeded to shore up its balance sheet in a hurry.\n\nIn order to size up a company's debt relative to its earnings, we calculate its\nnet debt divided by its earnings before interest, tax, depreciation, and\namortization (EBITDA) and its earnings before interest and tax (EBIT) divided by\nits interest expense (its interest cover). This way, we consider both the\nabsolute quantum of the debt, as well as the interest rates paid on it.\n\nChina Mengniu Dairy has a debt to EBITDA ratio of 2.7, which signals significant\ndebt, but is still pretty reasonable for most types of business. However, its\ninterest coverage of 1k is very high, suggesting that the interest expense on\nthe debt is currently quite low. One way China Mengniu Dairy could vanquish its\ndebt would be if it stops borrowing more but continues to grow EBIT at around\n18%, as it did over the last year. When analysing debt levels, the balance sheet\nis the obvious place to start. But ultimately the future profitability of the\nbusiness will decide if China Mengniu Dairy can strengthen its balance sheet\nover time. So if you're focused on the future you can check out this free report\nshowing analyst profit forecasts.\n\nFinally, while the tax-man may adore accounting profits, lenders only accept\ncold hard cash. So it's worth checking how much of that EBIT is backed by free\ncash flow. Over the most recent three years, China Mengniu Dairy recorded free\ncash flow worth 63% of its EBIT, which is around normal, given free cash flow\nexcludes interest and tax. This cold hard cash means it can reduce its debt when\nit wants to.\n\n\nOUR VIEW\n\nWhen it comes to the balance sheet, the standout positive for China Mengniu\nDairy was the fact that it seems able to cover its interest expense with its\nEBIT confidently. But the other factors we noted above weren't so encouraging.\nFor instance it seems like it has to struggle a bit to handle its total\nliabilities. Considering this range of data points, we think China Mengniu Dairy\nis in a good position to manage its debt levels. But a word of caution: we think\ndebt levels are high enough to justify ongoing monitoring. When analysing debt\nlevels, the balance sheet is the obvious place to start. However, not all\ninvestment risk resides within the balance sheet - far from it. We've identified\n1 warning sign with China Mengniu Dairy , and understanding them should be part\nof your investment process.\n\nIf, after all that, you're more interested in a fast growing company with a\nrock-solid balance sheet, then check out our list of net cash growth stocks\nwithout delay.\n\n\nVALUATION IS COMPLEX, BUT WE'RE HELPING MAKE IT SIMPLE.\n\nFind out whether China Mengniu Dairy is potentially over or undervalued by\nchecking out our comprehensive analysis, which includes fair value estimates,\nrisks and warnings, dividends, insider transactions and financial health.\n\nView the Free Analysis\n\nHave feedback on this article? Concerned about the content? Get in touch with us\ndirectly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based\non historical data and analyst forecasts only using an unbiased methodology and\nour articles are not intended to be financial advice. It does not constitute a\nrecommendation to buy or sell any stock, and does not take account of your\nobjectives, or your financial situation. We aim to bring you long-term focused\nanalysis driven by fundamental data. Note that our analysis may not factor in\nthe latest price-sensitive company announcements or qualitative material. Simply\nWall St has no position in any stocks mentioned.",
        "summary": "China Mengniu Dairy Company Limited (HKG:2319) makes use of debt to fund growth. Debt is a tool to help businesses grow, but if a business is incapable of paying its lenders, then it exists at their mercy. The company had CN¥36.2b of debt in December 2023, down fromCN¥38.0b the year before.",
        "source": "Simply Wall Street",
        "sentiment": -0.02085253596305847,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-05-20",
        "title": "IOC president visits Olympic-themed booth in Shanghai",
        "link": "https://www.chinadaily.com.cn/a/202405/20/WS664b3453a31082fc043c81ea.html",
        "content": "By He Qi in Shanghai | chinadaily.com.cn | Updated: 2024-05-20 19:30\n\nShare\n\nShare - WeChat\n\nInternational Olympic Committee (IOC) President Thomas Bach visits the\nexhibition booth of China Mengniu Dairy Company Limited at the Olympic Qualifier\nSeries in Shanghai on Sunday. [Photo provided to chinadaily.com.cn]\n\nInternational Olympic Committee (IOC) President Thomas Bach visited the\nOlympic-themed exhibition booth of China Mengniu Dairy Company Limited\n(Mengniu), the worldwide TOP Partner of the IOC, at the Olympic Qualifier Series\nin Shanghai on Sunday.\n\nGao Fei, CEO of Mengniu, held talks with Bach on topics related to jointly\npromoting global sports and sustainable development apart from the expectations\nfor the upcoming Paris Olympic Games.\n\n\"IOC is very pleased to establish a partnership with Mengniu and, during the\ncooperation process, the IOC deeply perceives the compatibility of Mengniu with\nthe Olympic spirit... IOC is looking forward to continuing to join hands with\nMengniu to make greater contributions for a peaceful and better world,\" said\nBach.\n\nGao said: \"Mengniu will work together with the IOC and Olympic organizations\naround the world to promote the development and popularization of the Olympic\nmovement worldwide.\"\n\nDuring the visit, Bach had exchanges and interactions with Meng Niu’s Ambassador\nof Perseverance, Liao Zhi, a dancer who lost her legs in an earthquake and\npersisted with her unwavering spirit and passion for dancing.\n\n\"Having experienced that earthquake caused me to have a very depressed period,\nbut it happened to be the Olympics at that time, so when those Olympic scenes\nwere aired in the news, I really felt inspired and it influenced me to pick\nmyself up,\" said Liao, adding that the meeting with Bach made her dream come\ntrue.\n\nMengniu has also established long-term cooperation with the FIFA World Cup and\nhas become the official global sponsor of FIFA World Cup Russia 2018 and FIFA\nWorld Cup Qatar 2022.\n\n * Strong rainfall to persist in Central China\n * Rain-triggered landslides, mudflows halt traffic in Northwest China province\n * China sees over 200 million railway passenger trips so far in summer rush\n * Workers harvest daylily buds in Datong\n * Large-scale water recycling project launched in Shanghai\n * Shanghai research team discovers two new species of fish\n\n\n\n\n\n\n\n",
        "summary": "IOC President Thomas Bach visited the Olympic-themed exhibition booth of China Mengniu Dairy Company Limited at the Olympic Qualifier Series in Shanghai on Sunday. Bach held talks with CEO Gao Fei on topics related to jointlypromoting global sports and sustainable development.",
        "source": "China Daily",
        "sentiment": 0.5252248272299767,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-05-21",
        "title": "China Mengniu Dairy (HKG:2319) investors are sitting on a loss of 60% if they invested three years ago",
        "link": "https://simplywall.st/stocks/hk/food-beverage-tobacco/hkg-2319/china-mengniu-dairy-shares/news/china-mengniu-dairy-hkg2319-investors-are-sitting-on-a-loss",
        "content": "China Mengniu Dairy Company Limited (HKG:2319) shareholders should be happy to\nsee the share price up 13% in the last month. But that is small recompense for\nthe exasperating returns over three years. Tragically, the share price declined\n61% in that time. So the improvement may be a real relief to some. While many\nwould remain nervous, there could be further gains if the business can put its\nbest foot forward.\n\nIt's worthwhile assessing if the company's economics have been moving in\nlockstep with these underwhelming shareholder returns, or if there is some\ndisparity between the two. So let's do just that.\n\nSee our latest analysis for China Mengniu Dairy\n\nIn his essay The Superinvestors of Graham-and-Doddsville Warren Buffett\ndescribed how share prices do not always rationally reflect the value of a\nbusiness. One way to examine how market sentiment has changed over time is to\nlook at the interaction between a company's share price and its earnings per\nshare (EPS).\n\nDuring the unfortunate three years of share price decline, China Mengniu Dairy\nactually saw its earnings per share (EPS) improve by 11% per year. This is quite\na puzzle, and suggests there might be something temporarily buoying the share\nprice. Or else the company was over-hyped in the past, and so its growth has\ndisappointed.\n\nSince the change in EPS doesn't seem to correlate with the change in share\nprice, it's worth taking a look at other metrics.\n\nWe note that, in three years, revenue has actually grown at a 7.4% annual rate,\nso that doesn't seem to be a reason to sell shares. It's probably worth\ninvestigating China Mengniu Dairy further; while we may be missing something on\nthis analysis, there might also be an opportunity.\n\nThe image below shows how earnings and revenue have tracked over time (if you\nclick on the image you can see greater detail).\n\nSEHK:2319 Earnings and Revenue Growth May 21st 2024\n\nChina Mengniu Dairy is a well known stock, with plenty of analyst coverage,\nsuggesting some visibility into future growth. So it makes a lot of sense to\ncheck out what analysts think China Mengniu Dairy will earn in the future (free\nanalyst consensus estimates)\n\n\nA DIFFERENT PERSPECTIVE\n\nInvestors in China Mengniu Dairy had a tough year, with a total loss of 45%\n(including dividends), against a market gain of about 7.1%. Even the share\nprices of good stocks drop sometimes, but we want to see improvements in the\nfundamental metrics of a business, before getting too interested. Regrettably,\nlast year's performance caps off a bad run, with the shareholders facing a total\nloss of 7% per year over five years. We realise that Baron Rothschild has said\ninvestors should \"buy when there is blood on the streets\", but we caution that\ninvestors should first be sure they are buying a high quality business. I find\nit very interesting to look at share price over the long term as a proxy for\nbusiness performance. But to truly gain insight, we need to consider other\ninformation, too. For example, we've discovered 2 warning signs for China\nMengniu Dairy that you should be aware of before investing here.\n\nIf you are like me, then you will not want to miss this free list of undervalued\nsmall caps that insiders are buying.\n\nPlease note, the market returns quoted in this article reflect the market\nweighted average returns of stocks that currently trade on Hong Kong exchanges.\n\n\nVALUATION IS COMPLEX, BUT WE'RE HELPING MAKE IT SIMPLE.\n\nFind out whether China Mengniu Dairy is potentially over or undervalued by\nchecking out our comprehensive analysis, which includes fair value estimates,\nrisks and warnings, dividends, insider transactions and financial health.\n\nView the Free Analysis\n\nHave feedback on this article? Concerned about the content? Get in touch with us\ndirectly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based\non historical data and analyst forecasts only using an unbiased methodology and\nour articles are not intended to be financial advice. It does not constitute a\nrecommendation to buy or sell any stock, and does not take account of your\nobjectives, or your financial situation. We aim to bring you long-term focused\nanalysis driven by fundamental data. Note that our analysis may not factor in\nthe latest price-sensitive company announcements or qualitative material. Simply\nWall St has no position in any stocks mentioned.",
        "summary": "China Mengniu Dairy Company Limited (HKG:2319) shareholders should be happy to see the share price up 13% in the last month. But that is small recompense for the exasperating returns over three years. Warren Buffett described how share prices do not always rationally reflect the value of a business.",
        "source": "Simply Wall Street",
        "sentiment": 0.21756143122911453,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-03-05",
        "title": "China’s Mengniu Dairy Plunges After Annual Profit Drops",
        "link": "https://www.yicaiglobal.com/news/mengniu-dairys-stocks-plunge-after-announcing-decline-in-profit-change-of-president",
        "content": "(Yicai) March 27 -- Mengniu Dairy’s shares sank after the Chinese dairy and ice\ncream  giant said net profit fell 9.3 percent last year, mainly because of lower\nearnings at its majority-owned unit and higher income tax expenses.\n\nMengniu [HKG: 2319] closed down 9.9 percent at HKD17.08 (USD2.18) a share in\nHong Kong today. The stock has halved in value over the past 12 months.\n\nNet profit was CNY4.8 billion (USD664.1 million) in the year ended Dec. 31, the\nHohhot-based company’s annual report showed yesterday. Revenue rose 6.5 percent\nto CNY98.6 billion (USD13.6 billion).\n\nGrowth slowed in China’s dairy industry last year amid an excess supply of raw\nmilk, and Mengniu stored the excess, resulting in asset impairment, Lu Minfang,\nwho was promoted to vice chairman from president yesterday, said on the firm’s\nearnings conference call.\n\nAnother factor was greater competition, which led to higher sales costs, Lu\nnoted.\n\nVice President Gao Fei will take over as the new president, Mengniu said. Lu was\npresident for seven years and will remain as an executive director.\n\nGao, 47, joined Mengniu when it was set up in 1999 and was promoted to vice\npresident and head of the firm’s core room temperature business group in 2016.\n\nLu instituted changes in Mengniu’s supply chain, talent system, and digital\noperations during his tenure as president, boosting the firm’s business\nsignificantly, Song Liang, a dairy industry analyst, told Yicai. \n\nMengniu likely chose Gao as the new president because of his wealth of frontline\nexperience, which will help the firm better respond to the increased market\ncompetition, he added.\n\nEditors: Dou Shicong, Tom Litting",
        "summary": "Mengniu shares closed down 9.9 percent at HKD17.08 (USD2.18) a share in Hong Kong today. The stock has halved in value over the past 12 months. Net profit was CNY4.8 billion (USD664.1 million) in the year ended Dec. 31. Revenue rose 6.5 percent (USD13.6 billion)",
        "source": "Yicai Global",
        "sentiment": -0.4813845753669739,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-06-17",
        "title": "China Mengniu Dairy Announces Leadership Transition in Board and Committees",
        "link": "https://dairynews.today/global/news/china-mengniu-dairy-announces-leadership-transition-in-board-and-committees.html",
        "content": "China Mengniu Dairy Co. has revealed a major transition in its leadership,\neffective May 22, 2024.\n\nMr. Chen Lang will step down as the non-executive director and chairman of the\ncompany's board, nomination, and strategy and development committees due to\nchanges in his professional responsibilities.\n\nHe will be succeeded by Mr. Qing Lijun, whose extensive background in beverage\nproduction and management with COFCO Corporation and its subsidiaries positions\nhim as a valuable successor. The company extended its gratitude to Mr. Chen for\nhis significant contributions and anticipates a new chapter of leadership under\nMr. Qing’s direction.",
        "summary": "China Mengniu Dairy Co. has revealed a major transition in its leadership. Mr. Chen Lang will step down as the non-executive director and chairman of the board. He will be succeeded by Mr. Qing Lijun.",
        "source": "DairyNews",
        "sentiment": 0.14193684980273247,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-06-17",
        "title": "Chinese Dairy Giant Mengniu Consolidates Cheese Business",
        "link": "https://dairynews.today/global/news/chinese-dairy-giant-mengniu-consolidates-cheese-business.html",
        "content": "On the evening of June 12, Shanghai-based Miaoke Landuo Food Technology Co.,\nLtd. (600882.SH, referred to as \"Miaoke Landuo\") announced that it would acquire\n100% equity in Inner Mongolia Mengniu Cheese Co., Ltd. (referred to as \"Mengniu\nCheese\") from its controlling shareholder, Inner Mongolia Mengniu Dairy (Group)\nCo., Ltd. (referred to as \"Mengniu\"), for 448 million yuan in cash.\n\nBoth Miaoke Landuo and Mengniu Cheese are subsidiaries of Mengniu. This\nadjustment represents Mengniu's restructuring of its cheese business segment,\nconsolidating the cheese operations under the listed company Miaoke Landuo to\nresolve issues of internal competition. Miaoke Landuo stated that this move aims\nto leverage the advantages of both entities, enhance quality and efficiency, and\npromote coordinated development, ultimately boosting the listed company's\nprofitability and core competitiveness.\n\nAccording to Miaoke Landuo's disclosure, Mengniu Cheese's annual revenue exceeds\n1.2 billion yuan but remains loss-making. The transaction did not bolster Miaoke\nLanduo's stock price, which fell on June 13, with a market value of 6.815\nbillion yuan.\n\nNotably, Miaoke Landuo was once a \"star stock\" in the dairy industry, with\nsignificant performance growth driving its stock price above 80 yuan per share\nin May 2021. Since 2020, Mengniu has repeatedly acquired Miaoke Landuo shares at\nhigh valuations. Now, this decision has resulted in a paper loss for Mengniu,\nand the investment return is under market scrutiny.\n\nThe roots of this acquisition trace back to 2021. In July 2021, after Miaoke\nLanduo issued private shares to Mengniu, Mengniu became its controlling\nshareholder. Due to overlapping and competitive businesses, Mengniu promised to\ninject its cheese operations, including related raw material trade, into Miaoke\nLanduo within two years. This commitment was later extended to be fulfilled by\nJuly 9 of this year, with shareholder approval.\n\nAs per Miaoke Landuo's announcement, as of December 31, 2023, the audited book\nvalue of Mengniu Cheese's consolidated balance sheet stood at 438 million yuan.\nIncluding government subsidies and other factors, the transaction price was set\nat 448 million yuan. Miaoke Landuo stated it would use its own or self-raised\nfunds for the acquisition, without directly or indirectly using raised funds.\n\nEstablished in December 2018, Mengniu Cheese currently operates two wholly-owned\nsubsidiaries engaged in cheese production: Tianjin Aishireen Dairy Products Co.,\nLtd. and Aishireen Dairy Products Import and Export Co., Ltd. According to the\nannouncement, Mengniu Cheese's revenue in 2023 was 1.273 billion yuan, with a\nnet loss attributable to the parent company of 3.373 million yuan. In the first\nquarter of 2024, it reported revenue of 211 million yuan and a net loss of 2.952\nmillion yuan.\n\nIn 2023, Miaoke Landuo's revenue was 4.049 billion yuan, a year-on-year decline\nof 16.16%, with net profit at 63.4395 million yuan, down 53.9%. In the first\nquarter of 2024, revenue was 950 million yuan, a year-on-year decrease of 7.14%,\nwith net profit at 41.2975 million yuan, a year-on-year increase of 70.63%.\n\nMiaoke Landuo's focus on cheese coincided with a hot segment in the dairy\nindustry. After specializing in cheese, the company experienced rapid growth. In\n2020, its revenue was 2.847 billion yuan, up 63.2% year-on-year, with net profit\nrising 208.16% to 59.258 million yuan. In 2021, revenue and net profit increased\nby 57.31% and 160.6%, respectively.\n\nThe remarkable performance of Miaoke Landuo and its cheese segment attracted\nMengniu's attention, leading to multiple rounds of acquisition starting in early\n2020.\n\nMengniu's acquisition of Miaoke Landuo was conducted in several phases: In\nJanuary 2020, Mengniu first invested 287 million yuan to acquire 5% of Miaoke\nLanduo at 14 yuan per share. Subsequently, Mengniu increased its stake through\nvarious means, including private placements and centralized bidding, at\nprogressively higher prices. For instance, in December 2020, Mengniu invested 3\nbillion yuan to purchase Miaoke Landuo shares at 29.71 yuan per share; by\nOctober 2022, the purchase price had risen to 30.92 yuan per share.\n\nAs Mengniu continued its acquisitions, Miaoke Landuo's stock price soared,\nreaching 84.5 yuan per share in May 2021, with a market value exceeding 40\nbillion yuan. However, the current market value of Miaoke Landuo has since\nshrunk to around 6.8 billion yuan, with its stock price significantly lower than\nduring Mengniu's various acquisitions. This has led to external skepticism and\nchallenges regarding the large investments Mengniu made in Miaoke Landuo.\n\nSong Liang, head of the expert group of the China Dairy Industry Alliance,\nbelieves Mengniu's investment in Miaoke Landuo is strategically significant. At\nthe time of the acquisition, Mengniu was expanding its business landscape into\nareas like raw milk and infant formula, including acquiring Modern Dairy and\nAustralian formula brand Bellamy's. Post-acquisition, Mengniu gained a\nfirst-mover advantage in the cheese segment. Mengniu's management has repeatedly\nexpressed optimism about the cheese business segment.\n\nCheese, often called \"milk gold\" due to its high protein and calcium content,\nrepresents a high-end form of dairy products, typically made from ten pounds of\nmilk to produce one pound of cheese. Given its high gross profit margin, the\ncheese sector has attracted numerous enterprises, particularly with the rise of\nchildren's cheese stick products, creating new growth points for companies like\nYili and Mengniu and nurturing new brands like Dr. Cheese and Miaofei.\n\nHowever, rapid development has also led to price wars and increased raw material\ncosts, negatively impacting company profits.\n\nAn executive from a cheese company in East China told the Economic Observer that\nthe cheese market faces another variable: due to cost constraints, cheese is\npriced higher than other dairy products, and consumer eating habits are not yet\nfully developed. When consumer spending becomes more cautious, the cheese market\nfaces challenges. As a result, many cheese companies, after years of rapid\ngrowth, are now at a crossroads, seeking new points of leverage beyond the\ncheese stick product.\n\nSong Liang stated that with the integration of Mengniu's cheese business into\nMiaoke Landuo, resource sharing can be achieved, such as using Mengniu's raw\nmaterials instead of importing from companies like Fonterra. He believes that\ncompanies should develop cheese products more suited to Chinese consumer dietary\nhabits and seek growth by expanding into baking and food service markets.\n\nBeyond the cheese business, Mengniu is also undergoing other internal\nadjustments. In July 2023, Mengniu privatized the publicly listed infant formula\ncompany Yashili and rebranded its products under the \"Mengniu\" trademark.\n\n\"By packaging the cheese business into Miaoke Landuo, Mengniu is making more\nconcrete adjustments to its business segments, aiming to create a concentrated\nresource platform for each category,\" Song Liang concluded.",
        "summary": "On June 12, Shanghai-based Miaoke Landuo Food Technology Co. (600882.SH) announced that it would acquire 100% equity in Inner Mongolia Mengniu Cheese Co. Ltd. (referred to as \"MengniuCheese\") for 448 million yuan in cash. The move aims to leverage the advantages of both entities, enhance quality and efficiency, and promote coordinated development.",
        "source": "DairyNews",
        "sentiment": 0.463781975209713,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-06-25",
        "title": "With 53% institutional ownership, China Mengniu Dairy Company Limited (HKG:2319) is a favorite amongst the big guns",
        "link": "https://simplywall.st/stocks/hk/food-beverage-tobacco/hkg-2319/china-mengniu-dairy-shares/news/with-53-institutional-ownership-china-mengniu-dairy-company",
        "content": "KEY INSIGHTS\n\n * Given the large stake in the stock by institutions, China Mengniu Dairy's\n   stock price might be vulnerable to their trading decisions\n * A total of 5 investors have a majority stake in the company with 51%\n   ownership\n * Ownership research along with analyst forecasts data help provide a good\n   understanding of opportunities in a stock\n\nA look at the shareholders of China Mengniu Dairy Company Limited (HKG:2319) can\ntell us which group is most powerful. With 53% stake, institutions possess the\nmaximum shares in the company. Put another way, the group faces the maximum\nupside potential (or downside risk).\n\nGiven the vast amount of money and research capacities at their disposal,\ninstitutional ownership tends to carry a lot of weight, especially with\nindividual investors. Hence, having a considerable amount of institutional money\ninvested in a company is often regarded as a desirable trait.\n\nLet's delve deeper into each type of owner of China Mengniu Dairy, beginning\nwith the chart below.\n\nCheck out our latest analysis for China Mengniu Dairy\n\nSEHK:2319 Ownership Breakdown June 25th 2024\n\n\nWHAT DOES THE INSTITUTIONAL OWNERSHIP TELL US ABOUT CHINA MENGNIU DAIRY?\n\nMany institutions measure their performance against an index that approximates\nthe local market. So they usually pay more attention to companies that are\nincluded in major indices.\n\nChina Mengniu Dairy already has institutions on the share registry. Indeed, they\nown a respectable stake in the company. This implies the analysts working for\nthose institutions have looked at the stock and they like it. But just like\nanyone else, they could be wrong. If multiple institutions change their view on\na stock at the same time, you could see the share price drop fast. It's\ntherefore worth looking at China Mengniu Dairy's earnings history below. Of\ncourse, the future is what really matters.\n\nSEHK:2319 Earnings and Revenue Growth June 25th 2024\n\nSince institutional investors own more than half the issued stock, the board\nwill likely have to pay attention to their preferences. China Mengniu Dairy is\nnot owned by hedge funds. Looking at our data, we can see that the largest\nshareholder is COFCO Corporation with 24% of shares outstanding. First Sentier\nInvestors (Australia) IM Ltd is the second largest shareholder owning 8.0% of\ncommon stock, and Fidelity International Ltd holds about 7.0% of the company\nstock.\n\nOn looking further, we found that 51% of the shares are owned by the top 5\nshareholders. In other words, these shareholders have a meaningful say in the\ndecisions of the company.\n\nWhile it makes sense to study institutional ownership data for a company, it\nalso makes sense to study analyst sentiments to know which way the wind is\nblowing. There are a reasonable number of analysts covering the stock, so it\nmight be useful to find out their aggregate view on the future.\n\n\nINSIDER OWNERSHIP OF CHINA MENGNIU DAIRY\n\nThe definition of company insiders can be subjective and does vary between\njurisdictions. Our data reflects individual insiders, capturing board members at\nthe very least. The company management answer to the board and the latter should\nrepresent the interests of shareholders. Notably, sometimes top-level managers\nare on the board themselves.\n\nMost consider insider ownership a positive because it can indicate the board is\nwell aligned with other shareholders. However, on some occasions too much power\nis concentrated within this group.\n\nOur data suggests that insiders own under 1% of China Mengniu Dairy Company\nLimited in their own names. However, it's possible that insiders might have an\nindirect interest through a more complex structure. It's a big company, so even\na small proportional interest can create alignment between the board and\nshareholders. In this case insiders own HK$75m worth of shares. Arguably, recent\nbuying and selling is just as important to consider. You can click here to see\nif insiders have been buying or selling.\n\n\nGENERAL PUBLIC OWNERSHIP\n\nThe general public, who are usually individual investors, hold a 22% stake in\nChina Mengniu Dairy. While this group can't necessarily call the shots, it can\ncertainly have a real influence on how the company is run.\n\n\nPRIVATE COMPANY OWNERSHIP\n\nIt seems that Private Companies own 24%, of the China Mengniu Dairy stock. It's\nhard to draw any conclusions from this fact alone, so its worth looking into who\nowns those private companies. Sometimes insiders or other related parties have\nan interest in shares in a public company through a separate private company.\n\n\nNEXT STEPS:\n\nIt's always worth thinking about the different groups who own shares in a\ncompany. But to understand China Mengniu Dairy better, we need to consider many\nother factors. For example, we've discovered 2 warning signs for China Mengniu\nDairy that you should be aware of before investing here.\n\nIf you are like me, you may want to think about whether this company will grow\nor shrink. Luckily, you can check this free report showing analyst forecasts for\nits future.\n\nNB: Figures in this article are calculated using data from the last twelve\nmonths, which refer to the 12-month period ending on the last date of the month\nthe financial statement is dated. This may not be consistent with full year\nannual report figures.\n\n\nVALUATION IS COMPLEX, BUT WE'RE HELPING MAKE IT SIMPLE.\n\nFind out whether China Mengniu Dairy is potentially over or undervalued by\nchecking out our comprehensive analysis, which includes fair value estimates,\nrisks and warnings, dividends, insider transactions and financial health.\n\nView the Free Analysis\n\nHave feedback on this article? Concerned about the content? Get in touch with us\ndirectly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based\non historical data and analyst forecasts only using an unbiased methodology and\nour articles are not intended to be financial advice. It does not constitute a\nrecommendation to buy or sell any stock, and does not take account of your\nobjectives, or your financial situation. We aim to bring you long-term focused\nanalysis driven by fundamental data. Note that our analysis may not factor in\nthe latest price-sensitive company announcements or qualitative material. Simply\nWall St has no position in any stocks mentioned.\n\n\nVALUATION IS COMPLEX, BUT WE'RE HELPING MAKE IT SIMPLE.\n\nFind out whether China Mengniu Dairy is potentially over or undervalued by\nchecking out our comprehensive analysis, which includes fair value estimates,\nrisks and warnings, dividends, insider transactions and financial health.\n\nView the Free Analysis\n\nHave feedback on this article? Concerned about the content? Get in touch with us\ndirectly. Alternatively, email editorial-team@simplywallst.com",
        "summary": "China Mengniu Dairy Company Limited (HKG:2319) has 53% stake in the company. 51% of the shares are owned by the top 5 shareholders. The largest shareholder is COFCO Corporation with 24% of shares outstanding. A total of 5 investors have a majority stake with 51% ownership.",
        "source": "Simply Wall Street",
        "sentiment": -0.06970428675413132,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-04-09",
        "title": "Chinese dairy giant Mengniu has conducted personnel changes: the history of company leaders",
        "link": "https://dairynews.today/global/news/chinese-dairy-giant-mengniu-has-conducted-personnel-changes-the-history-of-company-leaders.html",
        "content": "According to Jiangxi Business Daily, Shanghai Mengniu Yogurt Technology Co.,\nLtd. was established at the beginning of 2024 with a registered capital of 10\nmillion yuan. Its activities include internet sales, brand management, supply\nchain management services, home goods sales, food sales, and other areas. The\nsole shareholder of the company is Inner Mongolia Mengniu Dairy (Group) Co.,\nLtd.\n\nOn March 26, Mengniu made important personnel changes. According to the\ncompany's official statement, the group's president, Lu Minfan, was appointed\nvice chairman with the functional role of executive director. Gao Fei, former\nsenior vice president and head of the fresh product division, assumed the\nposition of company president and became an executive director.\n\nOn March 27, at the Mengniu 2023 performance conference, new president Gao Fei\nstated that regardless of who holds the position of president today, Mengniu's\nstrategy remains unchanged. Currently, the industry is facing some challenges,\nand Mengniu will actively respond to them.\n\nThe annual report showed that in 2023, Mengniu Dairy achieved operating income\nof 98.624 billion yuan, an increase of 6.5% over the previous year, while net\nprofit was 4.809 billion yuan per year, a decrease of 9.31% from the previous\nyear.\n\nAt a briefing on March 27, Lu Minfan stated that the decrease in net profit was\nmainly due to the devaluation of large packages of powdered milk caused by\nexcess fresh powdered milk storage, dividend taxes, intensified market\ncompetition, and increased sales expenses.\n\nIn 2020, Mengniu Dairy's operating profit was 76.035 billion yuan. In 2023,\noperating profit was closest to the target of 100 billion yuan set by Lu Minfan\nin 2017.\n\nMengniu has long held a leading position in the dairy industry. The company was\nfounded in 1999 by Niu Genshen. In just 8 years, Mengniu became the two-time\nchampion of the global liquid milk market and China's dairy industry.\n\nNiu Genshen's successor, Yang Wenzhun, continued his efforts. In 2007, Mengniu\nDairy's operating profit reached 21.318 billion yuan, surpassing Yili's 19.360\nbillion yuan, becoming the largest dairy company in China. This status was\nmaintained until 2010.\n\nIn 2011, Mengniu Dairy's operating profit reached 37.388 billion yuan, ranking\nsecond in China. In 2012, Yili's operating profit reached 41.991 billion yuan,\nwhile Mengniu Dairy's operating profit fell to 36.080 billion yuan.\n\nIn 2012, Sun Yiping, who worked at Coca-Cola, became the third president of\nMengniu Dairy. In 2014, Sun Yiping pushed Mengniu to acquire 75.3% of Yashili's\nshares for 11.3 billion Hong Kong dollars. However, during Sun Yiping's era,\nMengniu slowed its growth pace, while Yili accelerated, widening the gap between\nthem.\n\nAfter Lu Minfan took over the company, he carried out a series of radical\nreforms and large-scale mergers and acquisitions to achieve the goal of\nincreasing profits to 100 billion.\n\nMengniu Dairy acquired Modern Dairy in 2017 and Shengmu Hi-Tech in 2018. From\n2020 to 2021, it controlled Magic Lando, and in 2022, it acquired Shanghai-based\nDanone's business for low-temperature products.\n\nAfter these acquisitions, Mengniu Dairy's operating profit exceeded 60 billion\nyuan in 2017, approached 80 billion yuan in 2019, and approached 100 billion\nyuan in 2023. However, whether it is operating profit or net profit, the gap\nbetween Mengniu Dairy and Yili remains significant.\n\nIn 2022, Yili's operating profit will reach 123.171 billion yuan. For the first\nnine months of 2023, Yili's operating profit was 97.404 billion yuan, close to\nMengniu Dairy's annual operating income.\n\n\nThe gap in net profit is even greater. For the first nine months of 2023, Yili's\nnet profit was 9.380 billion yuan, almost double that of Mengniu Dairy.\n\nAnalysts believe that the key factors contributing to Mengniu's growth slowdown\nare poor sales of fresh white milk and devaluation of significant volumes of\npowdered milk. The company often participates in actions to reduce prices for\nfresh milk, leading to increased costs. In addition, previous mergers and\nacquisitions did not meet expectations.\n\nHow will Gao Fei change the situation after taking over leadership?\n\n\nGao Fei, 47, joined Mengniu in 1999 and held positions as vice president of\nsales, general sales manager, marketing general manager, and group vice\npresident.\n\nAnalysts say that China's dairy industry is currently facing problems such as\nexcess raw milk and intensified competition in the industry, entering a period\nof growth constraints. The hope that Gao Fei brings to Mengniu and the market is\nthat besides being a veteran of Mengniu and charismatic, Gao Fei's advantage\nlies in understanding the market and being good at marketing.\n\n\"He is one of those who knows Mengniu best and has created the company's most\nsuccessful products,\" colleagues say.",
        "summary": "Shanghai Mengniu Yogurt Technology Co. was established at the beginning of 2024. The company was founded in 1999 by Niu Genshen. In 2007, it surpassed Yili's 19.360billion yuan, becoming the largest dairy company in China.",
        "source": "DairyNews",
        "sentiment": -0.33430325984954834,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-06-10",
        "title": "Why You Might Be Interested In China Mengniu Dairy Company Limited (HKG:2319) For Its Upcoming Dividend",
        "link": "https://simplywall.st/stocks/hk/food-beverage-tobacco/hkg-2319/china-mengniu-dairy-shares/news/why-you-might-be-interested-in-china-mengniu-dairy-company-l",
        "content": "China Mengniu Dairy Company Limited (HKG:2319) stock is about to trade\nex-dividend in 3 days. The ex-dividend date is one business day before a\ncompany's record date, which is the date on which the company determines which\nshareholders are entitled to receive a dividend. The ex-dividend date is of\nconsequence because whenever a stock is bought or sold, the trade takes at least\ntwo business day to settle. Thus, you can purchase China Mengniu Dairy's shares\nbefore the 14th of June in order to receive the dividend, which the company will\npay on the 26th of June.\n\nThe company's upcoming dividend is CN¥0.489 a share, following on from the last\n12 months, when the company distributed a total of CN¥0.49 per share to\nshareholders. Last year's total dividend payments show that China Mengniu Dairy\nhas a trailing yield of 3.7% on the current share price of HK$14.30. Dividends\nare an important source of income to many shareholders, but the health of the\nbusiness is crucial to maintaining those dividends. As a result, readers should\nalways check whether China Mengniu Dairy has been able to grow its dividends, or\nif the dividend might be cut.\n\nSee our latest analysis for China Mengniu Dairy\n\nDividends are usually paid out of company profits, so if a company pays out more\nthan it earned then its dividend is usually at greater risk of being cut.\nFortunately China Mengniu Dairy's payout ratio is modest, at just 40% of profit.\nA useful secondary check can be to evaluate whether China Mengniu Dairy\ngenerated enough free cash flow to afford its dividend. It distributed 37% of\nits free cash flow as dividends, a comfortable payout level for most companies.\n\nIt's encouraging to see that the dividend is covered by both profit and cash\nflow. This generally suggests the dividend is sustainable, as long as earnings\ndon't drop precipitously.\n\nClick here to see the company's payout ratio, plus analyst estimates of its\nfuture dividends.\n\nSEHK:2319 Historic Dividend June 10th 2024\n\n\nHAVE EARNINGS AND DIVIDENDS BEEN GROWING?\n\nBusinesses with strong growth prospects usually make the best dividend payers,\nbecause it's easier to grow dividends when earnings per share are improving.\nInvestors love dividends, so if earnings fall and the dividend is reduced,\nexpect a stock to be sold off heavily at the same time. With that in mind, we're\nencouraged by the steady growth at China Mengniu Dairy, with earnings per share\nup 9.4% on average over the last five years. Management have been reinvested\nmore than half of the company's earnings within the business, and the company\nhas been able to grow earnings with this retained capital. We think this is\ngenerally an attractive combination, as dividends can grow through a combination\nof earnings growth and or a higher payout ratio over time.\n\nAnother key way to measure a company's dividend prospects is by measuring its\nhistorical rate of dividend growth. In the last 10 years, China Mengniu Dairy\nhas lifted its dividend by approximately 17% a year on average. It's encouraging\nto see the company lifting dividends while earnings are growing, suggesting at\nleast some corporate interest in rewarding shareholders.\n\n\nTHE BOTTOM LINE\n\nShould investors buy China Mengniu Dairy for the upcoming dividend? Earnings per\nshare growth has been growing somewhat, and China Mengniu Dairy is paying out\nless than half its earnings and cash flow as dividends. This is interesting for\na few reasons, as it suggests management may be reinvesting heavily in the\nbusiness, but it also provides room to increase the dividend in time. It might\nbe nice to see earnings growing faster, but China Mengniu Dairy is being\nconservative with its dividend payouts and could still perform reasonably over\nthe long run. Overall we think this is an attractive combination and worthy of\nfurther research.\n\nOn that note, you'll want to research what risks China Mengniu Dairy is facing.\nFor example, we've found 2 warning signs for China Mengniu Dairy that we\nrecommend you consider before investing in the business.\n\nGenerally, we wouldn't recommend just buying the first dividend stock you see.\nHere's a curated list of interesting stocks that are strong dividend payers.\n\n\nVALUATION IS COMPLEX, BUT WE'RE HELPING MAKE IT SIMPLE.\n\nFind out whether China Mengniu Dairy is potentially over or undervalued by\nchecking out our comprehensive analysis, which includes fair value estimates,\nrisks and warnings, dividends, insider transactions and financial health.\n\nView the Free Analysis\n\nHave feedback on this article? Concerned about the content? Get in touch with us\ndirectly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based\non historical data and analyst forecasts only using an unbiased methodology and\nour articles are not intended to be financial advice. It does not constitute a\nrecommendation to buy or sell any stock, and does not take account of your\nobjectives, or your financial situation. We aim to bring you long-term focused\nanalysis driven by fundamental data. Note that our analysis may not factor in\nthe latest price-sensitive company announcements or qualitative material. Simply\nWall St has no position in any stocks mentioned.",
        "summary": "China Mengniu Dairy Company Limited (HKG:2319) stock is about to trade                ex-dividend in 3 days. The company's upcoming dividend is CN¥0.489 a share, following on from the last                12 months. Last year's total dividend payments show that China MengniU Dairyhas a trailing yield of 3.7% on the current share price of HK$14.30.",
        "source": "Simply Wall Street",
        "sentiment": 0.15590132027864456,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-01-03",
        "title": " 2023 Global Dairy Business Year-in-Review  ",
        "link": "https://dairynews.today/global/news/2023-global-dairy-business-year-in-review-.html",
        "content": "Assembled the important mergers, key acquisitions, joint ventures, new\nfacilities, executive hires and marketing initiatives that made 2023 a\nnoteworthy year for global dairy business, writes USDEC.\n\nAcross the international dairy sector, business activity has been brisk this\nyear, as one can see fr om the U.S. Dairy Export Council's 2023 Global Dairy\nBusiness Year-in-Review.\n\nUSDEC monitors global dairy business developments for our members and curates\nthem for our weekly, members-only newsletter, Global Dairy eBrief. At the end of\nthe year, we aggregate and summarize what's most relevant for this retrospective\nannual review.\n\nWe start the 2023 Global Dairy Business Year-in-Review review with items fr om\nthe January 6 Global Dairy eBrief and end with news from the December 22\nedition.\n\nThis is a fast-paced yet lengthy review. We put company names in bold for easy\nscanning.\n\nTip: To quickly find mentions of a company, search this long page. The easiest\nway to search on a PC is to use the keyboard shortcut Ctrl+F on Windows or\nCommand+F on a Mac.\n\nA one-stop review of 2023's most important dairy business news\n\nWhat follows is USDEC's 2023 Global Dairy Business Year-in-Review, a curated\nsummary of important global dairy business developments, presented in\nmonth-by-month chronological order, beginning in January.\n\nQatari milk producer and dairy processor Baladna Food Industries is exploring a\nlarge-scale dairy project in Algeria. Late last year, Baladna representatives\nand officials from Algeria’s Ministry of Agriculture visited a model farm\nproject in the west of the country and presented plans for a 25,000-acre dairy\nfarm and processing facility. The company is conducting a feasibility study on\nthe soil and climate in the area, and depending on the results, it could launch\nthe project by the beginning of 2024. Founded in 2017 in Qatar, the vertically\nintegrated dairy company has been on a global expansion streak over the past few\nyears. It has farm-to-bottle dairy projects in various stages of development in\nMalaysia, Indonesia and the Philippines, and last year purchased a minority\nstake in Egyptian dairy, juice and cooking product company Juhayna Food\nIndustries. (USDEC Middle East/North Africa office)\n\nCalifornia-based private equity firm Butterfly purchased Minnesota-based Milk\nSpecialties Global. Current Milk Specialties CEO, Dave Lenzmeier, will continue\nto lead the business. Lenzmeier said he expects the acquisition will enable the\ncompany “to achieve a new level of growth.” … The European Commission approved\nthe creation of a new joint venture between Dutch food and nutrition company\nRoyal DSM and New Zealand’s Fonterra Co-operative Group. The new company,\nTasman, will be headquartered in the Netherlands and will develop, produce and\nmarket fermentation-derived dairy proteins. (Company reports; Agriland,\n12/28/22)\n\nA Jan. 2 fire destroyed a butter storage room at the Associated Milk Producers\nInc. (AMPI) plant in Portage, Wisconsin. Firefighters contained the blaze but\nnot before butter runoff flowed into other areas of the plant and into storm\nsewers and a neighboring canal. Operations were temporarily halted on Jan. 3,\nand AMPI told Dairy Herd Management that cleanup would begin as soon as\npossible. … U.S. food giant Mars Inc. completed its new ice cream factory in\nGuangzhou, China, two months ahead of schedule. … Nestlé began testing its first\nanimal-free milk product in California. The drink, branded Cowabunga, was\ndeveloped with California-based food biotech start-up Perfect Day using\nprecision fermentation technology. … Mead Johnson China launched a new adult\nnutrition brand called Agijoy. The product is designed for consumers over 50 and\nreportedly contains 23 nutrients (it is rich in protein and selenium) and\nlactoferrin. (USDEC China office; Company reports; Dairy Herd Management,\n1/3/23; WMTV, 1/2/23; FoodBev.com, 12/22/22)\n\nDutch dairy giant FrieslandCampina became the latest major dairy manufacturer to\nventure into the “animal-free” dairy protein realm. The company’s\nFrieslandCampina Ingredients division signed a strategic partnership with\nCalifornia-based biotech company Triplebar Bio Inc. The two companies will work\ntogether to develop and scale up the production of cell-based proteins using\nprecision fermentation technology. FrieslandCampina, which has been using\nprecision fermentations to manufacture human milk oligosaccharides since 2016,\nsaid it plans to offer the lab-based proteins side-by-side with its dairy\nproteins and ingredients. (Company reports)\n\nIreland’s Ornua and its U.S. subsidiary Ornua Foods North America are suing New\nZealand-based Westland Dairy Co. Ornua claims Westland’s Westgold butter\ninfringes on its own Kerrygold trademark due to the similarity in packaging\nbetween the two brands. A hearing is slated for Feb. 9. …Yili Group completed\nPhase 1 of its new US$250-million fluid milk plant in Inner Mongolia. Product\nsafety testing took place at the end of December, and the company expects to\nbegin commercial production soon. … Finnish food and dairy company Fazer Foods\nis considering exiting the dairy business. Fazer characterized its dairy\noperations as “small scale” and is studying plans to convert its Koria, Finland,\ndiary facility to oat-based drink and product manufacturing. … Alamar Foods, the\nmaster franchisee of Domino’s Pizza in the Middle East, North Africa and\nPakistan opened its 600th Domino’s outlet in the region. The ribbon-cutting took\nplace in Dubai. (USDEC China office; USDEC Middle East/North Africa office;\nAgriland, 1/10/23; FoodBev.com, 1/5/23)\n\nValley Milk is adding a 10,000-sq.-ft. addition to its Turlock, California, milk\nprocessing facility. The project, slated for completion in 2024, will produce\nAMF in drums and totes initially, with plans to expand to pails to serve\nindustrial and foodservice customers. The company is targeting domestic and\nexport markets with the new investment. There are “strategic opportunities” to\nexport AMF into the international market, Valle Milk said. (Company reports)\n\nCorman Miloko, a joint venture dairy spread and butterfat manufacturer based in\nCarrick-on-Sur, Ireland, plans to close its doors this June. Belgian butter,\nspread and fats and oils maker Corman owns a 55% stake in the operation,\nIreland’s Tirlán (formerly Glanbia Ireland) owns the other 45%. Corman, in turn,\nis part of the French dairy company Savencia Fromage and Dairy. The closure\ncomes after “significant restructuring” failed to turn around sagging volume\nsales. The joint venture company, which has been in business since 2005, sells\nprimarily to export markets. (Agriland, 1/21/23)\n\nItalian dairy-co-op Latteria Soresina plans to acquire Italian gorgonzola maker\nFratelli Oioli. Sorensina said it hoped the acquisition would open additional\nexport opportunities. … New York-based global equity firm General Atlantic paid\n$130 million for a 5.6% stake in Indonesian dairy and food processor Cisarua\nMountain Dairy, also known as Cimory. Cimory said it plans to use the funding to\naccelerate growth initiatives, including new product development and broadening\nits distribution network. (Company reports; FoodBev.com, 1/18/23)\n\nKorea’s Lotte Confectionery is investing $55 million over the next five years to\nexpand its Indian ice cream subsidiary, Havmor Ice Cream. The project centers on\na new 650,000 sq. ft. manufacturing plant in Pune, Maharashtra. Havmor operates\n216 ice cream parlors in India. … Nestlé Health Science is spending $43 million\nto add two new production lines to its Eau Claire, Wisconsin, manufacturing\nplant for ready-to-drink beverages. The facility produces an array of medical\nnutrition products and nutritional drink brands such as BOOST and Carnation\nInstant Breakfast. (Leader-Telegram, 1/25/23; FoodBev.com, 1/19/23)\n\nFebruary\n\nSaputo announced a series of capital investments and related consolidation plans\nimpacting facilities in California and Wisconsin. The company is building a\nC$240-million (about US$180 million) greenfield cut-and-wrap facility in\nFranklin, Wisconsin. The plant, slated to be fully operational by the third\nquarter of 2025, will become the center of the company’s Midwest cut-and-wrap\noperations. Saputo plans to transfer regional cut-and-wrap activities to the new\nFranklin site, resulting in the permanent closure of its Green Bay, Wisconsin,\nand Big Stone, South Dakota, facilities. Green Bay will shut down in the third\nquarter of fiscal 2025 and Big Stone will halt operations in the third quarter\nof fiscal 2024. In California, Saputo is investing C$75 million (about US$56\nmillion) to convert its Bardsley Street plant in Tulare into a string cheese\npackaging facility. The plant was previously a cut-and-wrap site. Saputo expects\nthe facility to be operating at full capacity by the third quarter of 2025. In\nconjunction with the conversion, the company will permanently close its South\nGate, California, facility in the fourth quarter of fiscal 2025.\n\nDanone is exploring strategic options for its organic dairy activity in the\nU.S., including a potential sale. The company said its Horizon Organic and\nWallaby businesses “fall outside our priority areas of focus.” … Hong\nKong-listed Vita International exercised its option to buy a 49% stake in dairy\nalternative manufacturer Vitasoy Australia. Vita paid Vitasoy Australia co-owner\nBega Cheese A$51 million (about US$36 million) to acquire the outstanding\nshares. Bega said it would seek other ways to re-enter the dairy alternative\ncategory. … New York-based infant nutrition company ByHeart purchased\nDairiConcepts’ manufacturing plant in Allerton, Iowa. DairiConcepts is a\nwholly-owned subsidiary of Dairy Farmers of America (DFA), which said it looked\nforward to continuing to work with ByHeart. The acquisition triples ByHeart’s\nsupply capacity, “strengthening the vulnerable infant formula supply chain in\nthis country,” the company said. For more, see this press release. (Company\nreports; Sydney Morning Herald, 1/30/23)\n\nFrieslandCampina CEO Hein Schumacher will step down effective May 1, 2023, to\nlead multi-national food and personal care company Unilever. Schumacher will\nreplace retiring CEO Alan Jope on July 1 after a one-month handover period.\nFrieslandCampina has initiated an accelerated process to sel ect a new leader. …\nAnchor Food Professionals, owned by New Zealand’s Fonterra Co-operative Group,\nsigned a deal with Walmart China to provide a lineup of new bakery products to\n400 Chinese stores. The products, which are made using Fonterra ingredients,\ninclude a New Year’s cream cake, Basque cheesecake and a Swiss roll. (USDEC\nChina office; Company reports)\n\nChina’s Junlebao plans to spend $442 million to build a dairy processing\nfacility and three dairy farms in the Yangtze River Delta region. The project\nwill support the government’s school milk program. The company expects to begin\nconstruction in March. Separately, Junlebao purchased a 10% stake in cheese\nmanufacturer Shanghai Laoshen Health Technology Development Co. and plans to\nbuild a cheese factory this year, with an eye toward becoming one of China’s top\ncheese manufacturers over the next five years. (USDEC China office)\n\nOn Jan. 31, Japan’s Meiji began production at the first of three new facilities\nset to open in China this year. The fluid milk/yogurt processing plant is in\nTianjin, China. … McDonald’s plans to open 900 new units in China in 2023. It\nhas increased store openings for the past two years: 480 in 2020, 660 in 2021\nand 700 in 2022. It currently operates more than 5,000 stores in China. …\nMalaysia-based investment group Wellspire Holdings is looking to import dairy\nbeverages, including yogurt and UHT milk, as part of an effort to expand\nbusiness in Thailand. … Danone opened a new research and innovation center at\nits Paris-Saclay campus in France. The facility, with a staff of more than 550,\npilot plants and labs, will focus on “fresh dairy and plant-based products” and\nmineral water. (USDEC China office; USDEC Southeast Asia office; Company\nreports)\n\nFonterra Co-operative Group rolled out two new functional dairy products in\nThailand through an exclusive partnership with 7-Eleven. Anchor Actif-Fiber and\nAnchor Beaute are being sold at more than 14,000 7-Eleven stores across the\ncountry. Actif-Fiber is fortified with fiber to aid digestion. Beaute contains\nzinc and collagen and is being marketed as an “ingestible beauty” product that\nFonterra says provides “an inside-out kind of glow.” (USDEC Southeast Asia\noffice; Company reports)\n\nSubway confirmed that it is exploring selling its business and hired JPMorgan\nChase to advise as it looks for potential buyers. Subway has 37,000 stores\nworldwide. Wall Street Journal estimates a sale price of about $10 billion. …\nThe Seoul High Court upheld a lower court’s ruling and ordered Korean dairy\nprocessor Namyang Dairy to abide by a 2021 deal to sell a majority stake (53%)\nin the business to private equity firm Hahn & Co. Namyang’s owners claimed the\ndeal was invalid just months after they made it, prompting Hahn to file the\nlawsuit. (Wall Street Journal, 2/14/23; Korea Herald, 2/9/23)\n\nFrieslandCampina is consolidating its butter production in the Netherlands. The\ncompany said that increased cream demand fr om the foodservice channel created a\nstructural overcapacity in butter. FrieslandCampina plans to expand its Lochem\nplant and merge all butter production to that location, closing its\n's-Hertogenbosch facility in mid-2025. … China’s Terun Dairy is raising funds to\nbuild a $145-million dairy processing plant in the Xinjiang Autonomous Region in\nnortheast China. The facility will focus on shelf-stable dairy products. (USDEC\nChina office; Company reports)\n\nSaputo is spending A$20 million (about US$14 million) to add cream cheese\nmanufacturing to its Smithton, Tasmania, manufacturing plant. The new capacity\nreplaces cream cheese operations at Saputo’s Maffra, Victoria, plant, which the\ncompany shuttered last week. (It announced the planned closure last November.)\nSaputo CEO Lino Saputo Jr. said that he expected more plant closures in\nAustralia due to the country’s shrinking milk supply, “but there will be heavy\ninvestments as well in other facilities to focus on higher valued categories of\ndairy products that we can sell domestically and around the world.” (Just Food,\n2/17/23; ABC News, 2/15/23)\n\nSaudi Arabian dairy processor Almarai completed the acquisition of International\nDairy and Juice Ltd. (IDJ) from its former joint-venture partner PepsiCo. The\ncompany paid an estimated 255 million riyals (about US$68 million) for PepsiCo’s\n48% share in IDJ. Almarai said that full ownership would facilitate expansion\nefforts. … Malaysian distributor Farm Fresh paid RM84 million (about US$19\nmillion) for a 65% stake in ice cream chain The Inside Scoop. The company plans\nto pursue brand collaboration between The Inside Scoop and its Jom Cha boba tea\nand soft-serve chain. … German regulators will only permit German dairy\nprocessor Theo Müller’s purchase of FrieslandCampina’s German dairy business if\nit divests two of the Dutch dairy giant’s brands. Müller said it is already in\ntalks to sell the Tuffi and Landliebe businesses. (USDEC Southeast Asia office;\nThe National News, 2/19/23; New Straits Times, 2/16/23)\n\nFonterra Co-operative Group COO Fraser Whineray is resigning at the end of\nFonterra’s fiscal year on July 31. … Lactalis is facing criminal charges in\nFrance related to a 2017 salmonella outbreak linked to its infant formula that\nsickened more than 40 children in Europe and impacted Lactalis formula\ndistribution in 80 countries. Prosecutors contend that the company failed to\nproperly carry out a product recall and withdrawal. (Company reports;\nDairyReporter.com, 2/20/23; Food Safety News, 2/18/23)\n\nMarch\n\nLeprino Foods signed a non-binding agreement to take full ownership of Glanbia\nCheese, the European joint venture it operates with Ireland’s Glanbia plc.\nLeprino will initially pay €160 million (about US$170 million) for Glanbia plc’s\nstake, with additional contingent consideration of €25 million (about US$26\nmillion) over the next three years, depending on business performance. The deal\nincludes manufacturing plants in Llangefni, Wales; Magheralin, Northern Ireland;\nand Portlaoise, Ireland. Current Glanbia Cheese CEO Paul Vernon will continue to\nhead the business. “Having successfully partnered with Glanbia since 2000, we\nare proud of the high-quality business that we have helped build,” Leprino\nPresident and CEO Mike Durkin said. “We look forward to working with Paul Vernon\nand the local team to ensure a seamless transition for our employees, customers\nand suppliers. We intend to take advantage of our combined expertise, knowledge\nand strengths to further enhance the business and are committed to ongoing\ninvestments in the core capabilities and the talented people that set us apart\nfrom our competition.”\n\nVertically integrated Qatari dairy manufacturer Baladna formed a strategic\npartnership with French cheesemaker Bel Group. Baladna will begin producing\nLaughing Cow jarred cheeses this year under the terms of the agreement, but more\nBel products are reportedly slated for production “in the near future.” Baladna\nsaid the deal will help reduce imports and the potential supply chain\ndisruptions and eventually increase product options for regional consumers.\n(USDEC Middle East/North Africa office; Company reports)\n\nAustralia’s Bega Cheese is closing its Griffith, Canberra, manufacturing plant\nfollowing a review of its fresh dairy operations in the Australian Capital\nTerritory and New South Wales. Declining farm numbers and milk production made\nsupplying the facility inefficient and unsustainable. The closure follows the\nrecent shuttering of Saputo’s Maffra, Victoria, plant and Saputo CEO Lino Saputo\nJr.’s prediction that he expected more plant closures in Australia due to the\ncountry’s shrinking milk supply. (FoodBev.com, 2/27/23)\n\nFast-food player Wendy’s signed a deal with India’s Rebel Foods to scale up the\nrestaurant’s presence in India. Rebel will become the master franchisee, with\nplans to develop about 150 units over the next decade. Wendy’s originally\npartnered with Rebel in 2020 to build and operate 250 cloud kitchens across\nIndia to grow a home-delivery business in the country. (Bloomberg, 2/27/23)\n\nFrieslandCampina Engro Pakistan signed a partnership with Dubai-based trading\ncompany Engro Eximp FZE. The deal aims to expand FrieslandCampina Engro dairy\nexports to the UAE and the broader Middle East region. … McThai Co., the\noperator of McDonald’s restaurants in Thailand, is spending 300 million baht\n(about US$9 million) to open 10-15 new outlets this year, pushing its total\nnumber of units to 237-242. (USDEC Southeast Asia office; PKrevenue.com,\n2/23/23)\n\nSpanish dairy processor Calidad Pascual partnered with Angolan beverage company\nRefriango on a new milk manufacturing facility in Angola’s capital city of\nLuanda. Pascual has been exporting yogurt to Angola for 25 years, but this is\nits first Angolan production plant. It will reportedly produce UHT milk and milk\npowder. Pascual said it expects to raise international revenues to €125 million\na year (about US$134 million) in three years through the Angolan investment as\nwell as capacity expansion projects in South and Central America. (Company\nreports)\n\nNew Zealand’s second-largest dairy processor, Open Country Dairy, named Mark de\nLautour as its new COO, replacing Steve Koekemoer. Koekemoer is taking over as\nCOO of Talley’s Group, the parent company of Open Country and meat processor\nAffco. De Lautour is presently the general manager of sales and marketing at\nAffco. (Rural News Group, 3/15/23)\n\nDomino’s China has aggressive expansion plans. The company expects to open 180\noutlets in 2023, 240 in 2024, 200 in 2025, and 300 in 2026. The company\ncurrently operates more than 600 stores in 17 Chinese cities. … Fraser & Neave\nHoldings (F&N) secured exclusive rights to manufacture and market Nestlé’s Bear\nBrand sterilized milk in Cambodia until 2037. The new deal expands F&N’s\nexisting contract with Nestlé, under which it makes and distributes Nestlé’s\nBear Brand sterilized milk and Bear Brand Gold milk for Thailand and Laos. …\nSaputo named Frank Guido president and COO of Dairy Division (USA), and Haig\nPoutchigian president and COO, of Dairy Division (Canada), effective April 1,\n2023. … Olam Food Ingredients says it is on track to complete Stage 1 of its new\nTokoroa, North Island, New Zealand powder plant in the second half of 2023. The\nplant will begin with WMP production, but Olam is already moving forward with\nStage 2, which would focus on specialized, high-value protein-based ingredients.\n… Leprino Foods selected Illinois-based ingredient distributor Univar Solutions\nas an authorized distributor of Leprino nutritional ingredients and dairy\nproducts in Canada and the United States. … Australian co-op Norco is one of the\nlatest dairy processors to enter the plant-based dairy alternative categories.\nThe company launched pea- and oat-based beverages under the P2 Pea Protein Mylk\nand Oat Mylk brands, respectively. It is marketing the products in Australia.\n(USDEC China office; USDEC Southeast Asia office; Company reports; Just Food,\n3/13/23; Rural News Group, 3/8/23)\n\nFrieslandCampina’s ingredients arm opened a new lactoferrin manufacturing\nfacility in Veghel, Netherlands. The plant quadruples the company’s total\nlactoferrin capacity to 80 MT annually. FrieslandCampina said it built the\nfacility to meet rising global demand in early life and adult nutrition markets\ndue to lactoferrin’s reported immunity-enhancement properties. Separately,\nFrieslandCampina appointed Jan Derek van Karnebeek as the company’s new CEO. Van\nKarnebeek is currently CEO of GreenV, an international group of operating\ncompanies active in the horticultural sector, but spent most of his career at\nHeineken in commercial, marketing and management positions. He will begin on\nJune 1, replacing Hein Schumacher, who is leaving the company on May 1 to become\nthe new CEO of Unilever. (Company reports)\n\nSuntado LLC, a partnership between Idaho dairymen Jesus Hurtado and Dick\nReitsma, began construction on a $150-million, 190,000-square-foot dairy\nprocessing facility in Burley, Idaho. Dairy West is partnering with Suntado to\nhelp the company get to market with products that meet shifting consumer\ndemands. When completed in the spring of 2024, the facility will be able to\nprocess up to 450 MT of milk per day. The plant will open with six production\nlines making ESL and UHT conventional and organic dairy beverages and related\nproducts. Future plans call for up to 18 production lines. Former Glanbia USA\nCEO Jeff Williams is heading the company. (Ag Proud Idaho, 3/20/23; Capital\nPress, 3/18/23; KLIX, 3/16/23)\n\nOregon-based Tillamook County Creamery Association purchased the former Prairie\nFarms ice cream plant in Decatur, Ill. Tillamook reportedly plans to spend $50\nmillion to retrofit the facility and acquire adjacent property for future\nexpansion. (Company reports; Herald & Review, 3/16/23)\n\nApril\n\nSwiss cheese manufacturer Emmi is looking to capitalize on rising global demand\nfor goat’s milk powder. The company formed a new division—Emmi Nutrition\nSolutions (ENS)—focused exclusively on goat’s milk powder manufacturing, new\nproduct development and marketing. ENS consolidates activities of Emmi’s AVH\ndairy trading business and manufacturer Goat’s Milk Powder. The company is\nbacking the venture with a new CHF40 million (about US$44 million) goat’s milk\npowder manufacturing facility in Etten-Leur, Netherlands. In addition to infant\nformula, Emmi plans to expand its goat’s milk powder portfolio to a range of\nproducts, including special nutrition for adults and seniors and products\ntargeting consumers seeking healthy and active lifestyles. (Company reports)\n\nWisconsin-based Grande Cheese purchased the former Foremost Farms cheese plant\nin Chilton, Wisconsin. Grande operates eight other manufacturing facilities in\nthe state. … Saputo is selling fresh milk processing facilities in Australia to\nretailer Coles Group for A$95 million (about US$64 million). Saputo called the\nsale an important step in executing its long-term vision for success in\nAustralia. ... German dairy processor Hochwald is buying the Tuffi brand from\nMüller Group and seeking to purchase the Landliebe label as well. German\nregulators required Müller to divest the brands as part of its deal to purchase\nportions of FrieslandCampina’s German consumer dairy business. (Company reports;\nPost-Crescent, 3/29/23)\n\nPT Kian Mulia Manunggal, a division of Indonesian conglomerate TempoScan Group,\nopened a new milk powder plant in Cikarang, West Java. The plant will produce\ninputs for TempoScan’s infant formula and growing milk businesses. (USDEC\nSoutheast Asia office)\n\nFrance-based Savencia Fromage & Dairy purchased Argentine dairy manufacturer\nSucerores de Alfredo Williner and its Ilolay dairy brand. Williner was founded\nin 1928 in Santa Fe Province, the heart of Argentina’s dairy region. The company\noperates three manufacturing plants producing cheese, fluid milk and cream, milk\npowder, butter, yogurt, dulce de leche and desserts. Savencia said the\nacquisition expands its existing portfolio of brands and strengthens its\npresence in Argentina. (Company reports)\n\nFrench dairy giant Lactalis officially opened a new US$8-million milk powder\ndryer at its Bonnievale cheese plant in Western Cape Town, South Africa. It\nadded the dryer to serve rising local demand for milk powder and projections for\n6% annual growth through 2028. The facility also reinforces the commitment\nLactalis has made to the country, the company said. Over the past four years,\nLactalis has invested an average of 400 million rands (about US$22 million) per\nyear in South Africa. (Food Business Africa, 4/6/23; Consulate General of\nFrance)\n\nDanone China and Qingdao University opened a new innovation center to focus on\nresearch into gut health, early-life nutrition and healthy aging with an\nemphasis on the specific needs of Chinese consumers. The Qingdao\nUniversity–Danone Nutrition and Health Innovation Centre will utilize resources\nfrom the university’s School of Public Health, Institute of Nutrition and\nHealth, and its analysis and test capabilities, combined with Danone Open\nScience Centre’s research and innovation capabilities. The partnership is the\nlatest in a series of relationships Danone is cultivating with Chinese\nuniversities. Since 2020, the company has published 37 scientific papers and\nreports together with local Chinese health and research institutes.\n(NutraIngredients-Asia.com, 4/11/23)\n\nPapa Johns International signed a 10-year development deal with UAE-based PJP\nInvestments Group to open 650 Papa Johns outlets in India. PJP already operates\n100 locations in the Middle East, with plans to open 250 more over the next\ndecade. The first Indian location is slated to debut in 2024. … Two Malaysian\ncompanies—ag investment firm Kulim (Malaysia) and A2 Fresh Holdings, a\nsubsidiary of investment firm Rhone Ma Holdings—are reportedly moving forward on\na joint venture dairy business. The new company, Jemaluang Dairy Valley in\nJohor, will be a vertically integrated operation, including dairy farming,\nprocessing and marketing. … China’s Behai Dairy (also known as Hokkai Pastures)\ncompleted a new $146-million dairy manufacturing plant. The facility can produce\nmore than 150,000 MT of shelf-stable and refrigerated dairy products per year.\nBehai was founded in 2018 and focuses on yogurt products. … Singapore-based Hao\nFood is looking to expand the White Rabbit ice cream brand throughout Southeast\nAsia. The ice cream was developed through a partnership between the owner of the\niconic White Rabbit candy brand, Shanghai Guan Sheng Yuan Food, and China’s\nBright Dairy. Hao Food is the official regional distributor, rolling the line\nout in Singapore in 2021, and says it is exploring inquiries to launch in\nIndonesia, Malaysia and Vietnam. (USDEC Southeast Asia office; USDEC China\noffice; The Malaysian Reserve, 4/6/23; Restaurant Business Online, 4/5/23;\nDairyReporter.com, 3/27/23)\n\nSingapore-based Growtheum Capital Partners paid US$100 million for a 15% stake\nin Vietnam’s International Dairy Products (IDP). Growtheum said the deal would\nallow the company “to participate in Vietnam’s rising consumption story.” IDP\nmanufactures drinking yogurt, fluid milk and other products and posted sales of\nabout US$260 million last year. … Vilkyškių Pieninė, the parent company of\nLithuanian dairy business Vilvi Group, acquired the remaining 30% stake of\nLatvian dairy processor Baltic Dairy Board (BDB). The company originally\npurchased 70% of BDB in 2018. BDB manufactures SMP, MPC and other products and\nVilkyškių Pieninė said it made the deal to bolster Vilvi Group’s value-added\ndairy ingredient portfolio. (FoodBev.com, 4/17/23; Bloomberg, 4/12/23)\n\nChina’s Yili Group expects to begin trial runs at its new processed cheese\nfactory in Hohhot, Inner Mongolia, this month. The $292-million project will\nreportedly produce 30,000 MTs of mainly lollipop-shaped cheese per annum. The\nplant is Yili’s largest cheese project to date. … Chinese dairy processor\nJunlebao officially opened its new pasteurized milk plant in Henan Province. The\n$146-million facility can reportedly produce 96,000 MT of pasteurized milk per\nannum. (USDEC China office)\n\nNestlé and private equity firm PAI Partners are forming a joint venture for\nNestlé’s frozen pizza business in Europe, which distributes pizzas under the\nWagner, Buitoni and Garden Gourmet brands. Nestlé will retain a non-controlling\nstake in the venture. The business will be headquartered in Germany, with\nmanufacturing facilities in Nonnweiler, Germany, and Benevento, Italy. Nestlé’s\npizza operations elsewhere are not part of the deal. Nestlé previously teamed up\nwith PAI to create global ice cream maker Froneri in 2016. (Company reports)\n\nChinese importer and food processor Pinlive Foods says it is building a natural\ncheese manufacturing plant in Shanghai. It claims the facility will be ready for\nproduction by the end of the year. … Coca-Cola and Mengniu Dairy are reportedly\nrunning into challenges marketing Fairlife milk in China, which they jointly\nlaunched in September 2021. Online marketplaces JD.com and Tmall, and many\nconvenient stores in Beijing, have stopped selling the product due to\nslower-than-expected sales. Reports suggest a lack of consumer understanding\nabout the product’s ultrafiltration process and its higher price point might be\nthe issue. (USDEC China office)\n\nMay\n\nNew Zealand dairy processor Westland Milk Products is building a new\nNZ$70-million lactoferrin plant (about US$43 million) at its South Island\nfacility at Hokitika. Westland, owned by China’s Yili Group, said the investment\nwould more than triple its lactoferrin capacity (currently 20 MT per year) and\nmake the company one of the top three lactoferrin producers in the world. It\nexpects to begin construction in the first half of 2024 and estimates that the\nplant will take about 16 months to complete. The facility will produce\nspray-dried lactoferrin, while Westland’s existing lactoferrin supply is\nproduced via freeze-drying. The investment follows a NZ$40-million expansion\n(about US$25 million) at Hokitika that doubled butter production. (Company\nreports)\n\nNew Zealand’s Fonterra Co-operative Group opened a fifth new application center\nin China. The latest location—in Shenzhen in southern China—will concentrate on\nbeverage applications, whereas the previous four units focus on food. “Part of\nthe success of our foodservice business in China has been driven by the\napplication centers, which allow us to better support our customers and better\nunderstand Chinese consumer preferences,” said Fonterra Greater China chief\nexecutive Teh-han Chow. (Stuff.co.nz, 4/25/23)\n\nChina’s Junlebao, in cooperation with local government, is investing $434\nmillion to build a new fluid milk, dairy beverages and yogurt plant in Jiangmen,\nGuangdong Province. The facility will supply six provinces: Guangdong, Guangxi,\nHunan, Jiangxi, Fujian and Hainan. … Israeli regulators approved Remilk’s\nlab-grown protein for food use. The approval follows an agreement made last year\nbetween Remilk and Central Bottling Co. (the Israeli franchisee for Coca-Cola)\nto produce a line of dairy products made with the protein. (USDEC China office;\nCompany news)\n\nNew Zealand’s Fonterra Co-operative Group signed a two-year milk powder\nmanufacturing deal with Australia’s Halo Food Co. and its Kiwi subsidiary\nKeytone Enterprises. Under the terms of the agreement, Keytone will make nine\nFonterra milk powder SKUs for sale in China, India, Vietnam, New Zealand and\nother countries over the two-year contract term. In other Fonterra news, the\nco-op announced last month that it was closing its office in Egypt after 30\nyears of operation. The company cited global macroeconomic challenges and its\nrecent decision to exit the Fonterra Consumer Brands business in Egypt. It will\ncontinue to service customers in the country from other offices in the Middle\nEast and Africa. (Company reports; edairy news, 4/16/23)\n\nMexican dairy and food manufacturer and distributor Sigma Alimentos acquired a\nmajority stake in California-based Hispanic cheese and cream manufacturer Los\nAltos Foods. Sigma Alimentos said the deal, which includes Los Altos’s\nmanufacturing plant near Los Angeles will allow it to meet rising U.S. demand\nfor Hispanic cheese. (Company reports)\n\nIrish dairy and flavor manufacturer Carbery Group opened a new innovation hub in\nSingapore to serve the greater Asia region. The company said the Carbery Group\nAsia Business and Innovation Center will foster stronger collaboration with\nindustry partners, start-ups, universities and key customers. … Coca-Cola is\nbuilding a new $650-million milk processing plant in Webster, N.Y., to make\nFairlife brand fluid products. It expects commercial production to begin in the\nfourth quarter of 2025. (USDEC Southeast Asia office; Company reports)\n\nDairy Queen is reportedly accelerating expansion plans for China and looking to\nenter new markets like Australia and Taiwan. The company currently operates\nabout 1,250 units in China, its second-largest market after the U.S. It opened\n165 Chinese stores in 2022 and expects to exceed that number this year. …\nCacique Foods held a grand opening of its new 200,000 sq.ft. Hispanic cheese and\ncrema manufacturing plant in Amarillo, Texas. The plant will begin production\nthis summer. (USDEC China office; Inside Retail, 5/12/23; News Channel 10,\n5/11/23)\n\nJune\n\nKerry Dairy Ireland and Dairygold Health and Nutrition are highlighting\nnutrition in their latest new products targeting Chinese consumers. Kerry’s\nOrigimel is an adult milk powder that features what Kerry calls “science-backed\ningredients” to support muscle, bone and cognitive health and boost immunity.\nThe company is targeting “aging consumers who are seeking nutritional beverages\nto maintain and improve their health.” Kerry cited a growing opportunity for\nfortified products in China as that country’s middle class continues to expand.\nDairygold is expanding its Aerabo range of milk powders in China with Aerabo\nLight, Aerabo Boost and Aerabo Vitality, targeting young professional adults,\nolder health-conscious consumers and adults with active lifestyles. The company\nsays that the products contain “higher values” of the essential amino acid\ntryptophan, vitamin B2 (riboflavin), conjugated linoleic acid (CLA) and\nprovitamin A, as well as tocopherols and beta carotene. Dairygold launched\noriginal Aerabo WMP in China in 2021. (Agriland, 5/17/23, 5/19/23)\n\nIreland’s Kerry Group opened a new innovation hub in Wageningen University’s\n“Food Valley” in the Netherlands. The facility will focus on clean-label and\nfood waste technologies. … New Zealand dairy processor Mataura Valley Milk\n(MVM), which is owned by New Zealand’s A2 Milk Co., is seeking a new chief\nexecutive after Bernard May stepped down from the role in May. John Roberts was\nappointed interim CEO and will oversee MVM’s focus on developing its infant\nformula manufacturing business. … Qatari milk producer and dairy processor\nBaladna continues to broaden its global footprint. The company signed\nMemorandums of Understanding with two Indonesian agribusiness companies to\ncooperate on milk production initiatives. The joint efforts will aim to\nidentify, assess and initiate projects to bolster Indonesian milk output and\nprocessing and strengthen food security. … Arla Foods inaugurated a €10-million\ndairy farm (about US$11 million) in Kaduna, Nigeria. Arla said the farm—a joint\neffort between the company, the Nigerian government, non-governmental\norganizations and the local farming community—will serve as a hub of dairy\nfarming knowledge and “symbolizes the massive potential we see in Nigeria.”\n(USDEC Southeast Asia office; FoodBev.com, 5/30/23; Food Ingredients First,\n5/18/23; New Zealand Herald, 5/9/23)\n\nNew Zealand’s Fonterra Co-operative Group formed a new, stand-alone corporate\ninvestment arm to incubate, scale and invest in new, innovative nutrition\nscience businesses. Provisionally named Nutrition Science Solutions (NSS), the\nbusiness will “incubate and scale a portfolio of disruptive ventures by\ndeveloping solutions that combine science, nutrition and technology to make a\nreal impact on human health,” Fonterra CEO Miles Hurrell said. NSS will seek\nout, partner and invest in global start-ups with emerging technologies and in\nnovel market channels. Its first investment is a US$10 million minority share in\nCalifornia-based Pendulum, a biotech company focused on developing\nmicrobiome-targeted products that advance metabolic health. Together, Fonterra\nand Pendulum say they will seek to establish a presence in global markets by\nco-developing and commercializing next-generation microbiome products that are\nscientifically formulated to make measurable improvements in people’s health.\nWeeks prior to the NSS announcement, Fonterra also rolled out a new effervescent\npowdered probiotic drink in Singapore under its Nurture Digestion+Immunity\nlabel. The company based the product on consumer research that indicated an\ninterest in probiotic drinks (Southeast Asian consumers believe “that true\nwellness is impossible without a healthy gut,” Fonterra said) but with lower\nsugar content and a preference for effervescent beverages. The company is\nalready looking to expand distribution to Indonesia, Malaysia and Thailand.\nFonterra has been increasingly active in functional products over the past\nyear—with varying degrees of success. A positive reception to ready-to-drink\nNurture Digestion+Immunity beverages in Singapore in 2022 spawned the new\npowdered, effervescent product. Earlier this year, it also rolled out a line of\nAnchor Actif-branded products in Thailand. However, Fonterra’s BioKodeLab\nsupplement line launched last October has already been “put on hold.” (USDEC\nSoutheast Asia office; Company reports; DairyReporter.com, 5/23/23)\n\nNew Zealand dairy processor Synlait plans to sell Dairyworks (its cheese\nproducts division) and Talbot Forest Cheese (a related consumer business unit).\nSynlait acquired both New Zealand businesses in 2019 in transactions valued\ncollectively at about NZ$150 million (about US$92 million today). Synlait said\nit is narrowing its businesses to focus on its highest margin segments: B2B\nadvanced nutrition and foodservice. (Radio New Zealand, 6/6/23)\n\nSubway reached an agreement with Chinese master franchisee Shanghai Fu-Rui-Shi\nCorporate Development to open 4,000 new sandwich shops across China over the\nnext two decades. It is the largest franchise agreement in Subway’s history.\nThere currently are around 500 Subway stores in China. … California-based Flynn\nRestaurant Group plans to buy Pizza Hut Australia, including the franchise\nlicense for the entire country. Australia-based investment firm Allegro Funds\ncurrently owns Pizza Hut Australia. Flynn operates about 950 Pizza Huts in the\nU.S.; the deal—its first outside the United States—will give it another 260. …\nMars Inc. is aiming to grow its global ice cream business from $400 million in\nsales to $1 billion by 2030. Mars said it is eyeing growth in places wh ere it\nalready has ice cream factories, as well as in emerging markets. “Ice cream is\nabout a $80 billion category around the globe, and it’s going to be about $100\nbillion by 2030,” said Anton Vincent, president of Mars Wrigley in North America\nand who recently took over global ice cream responsibilities. (Nation’s\nRestaurant News, 6/7/23; Reuters, 6/6/23; Bloomberg, 5/24/23)\n\nChina’s Yili Group and New Zealand’s Olam Food Ingredients (OFI) each expect to\nbring new plants online over the next two months. Yili is finishing a\n$138-million infant formula expansion at its Tianjin manufacturing plant. The\nnew line, set to open in July, can produce up to 24,000 MT of semi-finished\nproducts per year. OFI expects to open Stage 1 of its new NZ$100-million-plus\nmilk powder plant in Tokoroa on New Zealand’s North Island in August, prior to\nthe 2023/24 milking seasons. The facility will reportedly produce up to 10 MT of\npowder per hour. Stage 2, which will expand operations to higher-value,\nfunctional protein products, should be up and running for the 2025/26 season,\nthe company said. Rumors in New Zealand farming circles suggest OFI is already\ncontemplating a second plant on the South Island, although the company has not\npublicly stated such intentions. OFI rival Fonterra Co-operative group cautioned\nthat OFI’s plans could lead to excess processing capacity plant closures, given\nexpected declines in New Zealand milk production in the years ahead. (USDEC\nChina office; New Zealand Herald, 6/24/23)\n\nVinamilk announced it is joining six global nutrition and bioscience companies\nin a strategic partnership designed to further its mission of providing\n“international quality” nutritional solutions to Vietnamese children. Companies\njoining the Vietnamese dairy processor in the initiative include DSM, Chr.\nHansen, Beneo, Gnosis, AAK and Kanematsu. Vinamilk CEO Mai Kieu Lien said the\npartnership will help the company further its commitment to leveraging modern\nproduction processes, scientific research and international cooperation to\nprovide Vietnamese children with high-quality nutritional products.\n(FoodBev.com, 6/19/2023)\n\nIreland’s Dairygold Health and Nutrition (a business of Dairygold Co-operative\nSociety) acquired a majority stake in Vita Actives Ltd. Vita Actives, also based\nin Ireland, is a manufacturer, supplier and distributor of bulk nutraceuticals\nand food-grade ingredients for dietary supplements. Dairygold said the deal\npositions the company well within the fast-growing life-stage nutrition segment.\n… Unilever is buying U.S.-based Greek frozen yogurt company Yasso Holdings to\nadvance its position in the premium “better for you” frozen dessert segment.\n(Company reports; Agriland, 6/23/23)\n\nFirehouse Subs, owned by Restaurant Brands International, signed a development\ndeal to launch in Mexico later this year. The company did not name its partner\nin Mexico but said the deal, as well as a new store in Switzerland, are the\nfirst steps of a broad international push into the Middle East, Latin America,\nAsia, Europe and Africa. … Saudia Dairy and Foodstuffs (SADAFCO) signed a sales\nand export agreement with the Sultanate of Oman. SADAFCO, which produces dairy\nproducts, dairy alternatives, snacks, processed tomato products and other foods,\ndid not provide information on which products were included in the agreement.\nThe agreement aligns with the company’s efforts to expand its regional and\nexport business. … Bongards Creameries is spending $125 million to increase milk\nhandling capacity at its Perham, Minnesota, manufacturing plant by 30% to around\n2,500 MT/day. The project includes expanding milk intake bays, cheese packaging,\nwhey drying, packaging and warehousing, and wastewater treatment. Work is set to\nbegin in July with completion expected in June 2025. (USDEC Middle East/North\nAfrica office; Company reports; Perham Focus, 6/27/23)\n\nDairy innovation awards offer insights into new product trends\nThe 2023 World Dairy Innovation Awards were announced in June at Zenith Global’s\n16th Annual Global Dairy Congress in London. While the awards are not a\ncomprehensive round-up of new product innovation around the world, they are\ninstructive in terms of product development trends taking place in some key U.S.\ndairy export markets, particularly China.\n\nHealth and nutrition claims continued to play a strong role among award winners\nand contenders, reflecting the continuing consumer focus on immune and digestive\nhealth. China-based Feihe Dairy’s award in the functional dairy category for its\nAiben bovine colostrum milk powder highlights interest in the use of\nnatural-based products as nutritional supplements to promote health and the\nimmune system. Singapore-based CP-Meiji took home the prize in the\n“intolerance-friendly innovation category” with Lactose Free Dairy Milk with\nMalt.\n\nOther finalists in the functional dairy group included:\nZhennong High-Calcium Milk and ShuHua AnTangJian Sugar-Control Lactose-Free Milk\nfr om Chinese dairy giant Yili Group.\nFeihe’s Aiben Lactoferrin Formula Milk Powder.\nJapanese dairy processor Meiji Co.’s Fat-Fighting MI-2 Yogurt (which it claims\nreduces belly fat) and Probio R-1 Yogurt, which is fortified with iron and\nvitamin C.\nMany award nominees and winners had innovative product configurations that fit\nthe Congress’s theme of “reimagining dairy.” In the cheese category, Feihe’s\nZhuoran High-Calcium Cheese Lolly took top honors, with other finalists\nincluding Feihe’s Zhuoran High-Calcium Cheese Lumps and Yijiahao Cheese’s\nDouble-Layer Cheese Lollipops (Yijiahao Cheese is a subsidiary of Yili).\nYijiahao Cheese also took top honors in the children’s category with its Cheese\nBomb cheese snacks in kid-friendly shapes.\n\nSustainability also continued to be an important industry touchpoint. For\ncorporate social responsibility/sustainability initiatives, Yili earned finalist\nhonors for its Satine A2 Beta-casein Organic Pure Milk, which Yili claims is\nChina’s first net-zero carbon milk. Japan’s Meiji Co. was commended for its\ncollaborative efforts with Ajinomoto to work with Japanese dairy farmers to\nreduce greenhouse gas emissions.\n\nOn the marketing side, Yili was a finalist in packaging for its Satine No\nPrinting No Ink Environmentally-friendly Edition—where individual cartons of\nSatine multipacks are almost completely white.\n\nJuly\n\nTwo New Zealand dairy companies—Happy Valley Nutrition and Dairy\nNutraceuticals—have reportedly run into financial troubles. The Bank of China\nappointed receivers to Dairy Nutraceuticals, which is majority-owned by Hong\nKong-based Health Dairy International Ltd. Dairy Nutraceuticals produces a range\nof dairy products, including infant formula, adult milk powders and foods for\nspecial medical needs, out of its factory in Auckland. Separately,\nadministrators were appointed to Auckland-based Happy Valley Nutrition after\nthat company failed to raise sufficient funds to build a new infant formula and\ndairy nutrition factory in Ōtorohanga, Waikato. The company raised about NZ$13\nmillion (about US$8 million) in an initial public offering but reportedly needed\nan additional NZ$350 million (about US$220 million) to follow through on its\nplans. Happy Valley cited high interest rates, a tighter New Zealand milk supply\nand China's growing domestic milk supply as some of the reasons behind its\nstalled plans. The administrators said in a statement that they were undertaking\n“an urgent review” of the company. (Company reports; Stuff.co.nz, 7/5/23;\nBusinessDesk, 7/4/23)\n\nJapanese dairy Megmilk Snow Brand announced a joint venture with Agrocorp\nInternational, a Singapore-based agricultural commodities company, to\nmanufacture and market plant-based food ingredients. The collaboration, which\nwill be based in Singapore, seeks to support sustainable food production in Asia\nin response to rising food demand in the face of tightening supply. Together,\nthe companies will build a factory in Malaysia to produce pea protein, pea fiber\nand pea starch that can be used in plant-based meat and dairy products.\nProduction is expected to begin at the end of 2025. (USDEC Southeast Asia\noffice; Company reports; FoodNavigator-Asia.com, 7/4/23; Green Queen, 5/22/23)\n\nSwitzerland’s Emmi Group divested its organic dairy processor Gläserne Molkerei\nin northeast Germany to Mutares, a German holding company that specializes in\nturnarounds. The transaction is consistent with Emmi’s ongoing efforts to focus\nits portfolio on profitable strategic markets and niches, such as ready-to-drink\ncoffee, specialty cheeses, premium chilled desserts and plant-based dairy\nalternatives. … Danone sold its 38% stake in Irish Organic yogurt maker Glenisk\nto the company’s founders, the Cleary family. (Company reports; FoodBev.com,\n7/11/23)\n\nFrench dairy cooperative Sodiaal appointed Antoine Collette as the company’s new\nCEO. Collette succeeds Jorge Boucas, who stepped down in February to lead French\nsugar group Tereos. … McDonald’s Korea expects to add 100 new stores by 2030,\nraising its total number of outlets in South Korea to 500. … Lactalis opened a\nnew €2.4-million (about US$2.6 million) UHT addition to its plant in Gradačac,\nBosnia and Herzegovina. The company expects to spend another €1.3 million next\nyear to expand yogurt capacity at the facility. (Company reports; Just Food,\n7/7/23; FoodBev.com, 7/5/23)\n\nHilmar Cheese Company has revealed a new look and corporate strategy, unifying\nits products under the brand name Hilmar while marking the integration of the\ncompany’s cheese and ingredients businesses. A news release explains that the\nnew logomark features a milk droplet that’s being split into two products:\ncheese and whey ingredients. The design also reflects the concepts of nature,\nfarmland and sustainability. “We take our role as stewards of the land and\nenvironment seriously,” said David Ahlem, Hilmar’s president and chief executive\nofficer. Ahlem also said. “This new brand reflects our commitment to investing\nin technologies and processes that reduce our carbon footprint and make\nefficient use of all our resources.” “The new identity aligns with the company’s\nexpanding role in the markets it serves,” said Ahlem. (Dairy Processing, Turlock\nJournal, 7/14/23)\n\nRussia has taken control of the Russian subsidiary of French dairy group Danone,\nreports BBC News. The units have been put in “temporary management” of the state\nunder a new order signed by Russian President Vladimir Putin. Danone was in the\nprocess of selling its Russian operations. Reuters reported on Monday that\nDanone is reviewing its legal options. (BBC News, 7/16/23; Reuters, 7/17/23)\n\nJapanese milk producers Megmilk Snow Brand and Yotsuba Milk Products will expand\ndairy exports to Asian markets to secure new revenue streams as price hikes dent\ndemand at home, reports this article by Nikkei Asia, a Japanese weekly news\nmagazine. Megmilk will soon start exporting its \"Hokkaido\" brand long-life milk\nto Thailand. It already ships the product to Singapore, Taiwan, Hong Kong and\nPalau. Meanwhile, Yotsuba Milk Products plans to lift exports to Singapore by\nvalue by 20% every year. Milk packaged at its main factory in Hokkaido will be\nshipped to Taiwan, Malaysia and other markets. (Nikkei Asia, 7/18/23)\n\nDenmark’s Arla Foods is teaming up with Blue Ocean Closures in a formal\npartnership to create a fiber-based cap for its milk products. This could be a\nfirst in the dairy industry and reduce Arla’s plastic consumption by more than\n500 tons annually if implemented … Darigold has joined the Global Dairy Trade\nplatform to better support its growth ambitions and create value for its\nfarmer-owners … China’s Mengniu Dairy has been named an official sponsor of the\nFIFA Women’s World Cup 2023, which began on Thursday … Nestlé has introduced a\nnew sugar-reduction technology, which uses an enzymatic process that can reduce\nintrinsic sugar in ingredients such as milk, malt and fruit juices by up to 20%\n... China’s Shanghai Youchun Dairy signed a cooperative agreement to build a\ndairy processing project in Jinchang City in Gansu province capable of producing\nof 200,000 MTs of dairy products per annum … Seven-Eleven Japan Co. said it will\nlaunch a new brand of environmentally friendly prepared foods. The company will\nstart selling the first four items of the brand this week. The items include a\ntuna mayonnaise \"onigiri\" rice ball whose tuna is partly replaced by pea\nprotein. (Perishable News.com, 7/14/23; Dairy Reporter, 7/11/23; Sports Mint,\n7/17/23; FoodBev Media, 7/1/23; USDEC China Office, 7/18/23; Jiji Press,\n7/11/23)\n\nWith the pandemic seemingly in the rearview mirror, Western-based chain\nrestaurants are once again moving to grow their international businesses. Here\nare a few recent highlights:\n\nMcDonald’s Corp. is spending more than A$1 billion (about US$677 million) over\nthe next three years to add 100 new stores and refurbish more than 500 existing\noutlets in Australia.\nChipotle signed an agreement with Kuwait-based Alshaya Group to open two stores\neach in Dubai and Kuwait next year. the Deal is Chipotle’s first franchise\nagreement (all existing stores in the U.S., Canada and Europe are company-owned)\nand the stores will be the first in the Middle East. Alshaya is also a\nfranchisee for other major U.S. restaurant brands, including Starbucks, and\nShake Shack. Chipotle said the agreement could serve as a new model as the\ncompany looks to expand to other global markets.\n\nDine Brands is bringing its Applebee’s and IHOP chains to Japan (and a handful\nof EU countries) but not in a traditional manner. Dine is working with\nGeorgia-based Franklin Junction, a company that specializes in matching\nrestaurant brands with “host kitchens” and providing the technology to set up a\ndelivery-only, virtual presence in the market. Dine said the new strategy will\nopen new opportunities for IHOP and Applebee’s in key international markets.\n\nBurger King’s Thai outlets rolled out a new sandwich it is characterizing as a\n“real cheeseburger.” Instead of meat and cheese on a bun, the “cheeseburger”\ncontains up to 20 slices of cheese. The sandwich went viral on social media\nearlier this month and was reportedly selling well. Thai conglomerate Minor\nInternational, which runs more than 2,000 foodservice outlets in over 25\ncountries, operates the Burger King franchise in Thailand. (USDEC Southeast Asia\noffice; Company reports; Bloomberg, 7/22/23; Restaurant Business, 7/19/23; CNBC,\n7/18/23)\n\nAugust\n\nCompetition concerns have been raised in three pending dairy asset deals,\ncausing anti-trust regulators to call for further investigation before allowing\nthe deals to close. In Brazil, antitrust regulators are challenging Nestlé and\nFonterra Co-operative Group’s planned sale of Dairy Partners Americas Brazil to\nLactalis. Technical staff at the Council for Economic Defense (CADE) recommended\nthat the regulator block the US$147-million deal because it would likely cause\nhorizontal competition in the Brazilian dairy products market, particularly\namong the dairy desserts, fermented milk and petit-suisse categories. CADE’s\ncourt will conduct a broader review of the deal before voting on its approval.\nIn Ireland, regulatory authorities announced they will conduct a full Phase 2\ninvestigation of the proposed acquisition by Aurivo Consumer Foods of certain\nassets of Arrabawn Co-Operative Society. The Competition and Consumer Protection\nCommission (CCPC) said a full investigation is needed to ensure the proposed\ndeal, in which Aurivo would acquire parts of Arrabawn’s business for the supply\nof branded and unbranded liquid milk, cream and butter products, does not lead\nto “a substantial lessening of competition in the State.\" Australia’s\nCompetition and Consumer Commission (ACCC) also identified competition concerns\nabout a proposed deal for Coles Group Limited to acquire two fresh milk\nprocessing facilities from Saputo Dairy Australia. The ACCC cited concerns that\nthe acquisition would give Coles, one of Australia’s largest grocery retailers,\ntoo much influence in the dairy supply chain. The watchdog is also considering\nwhether the deal would lim it competition, which could cause farmers to receive\nlower prices for their raw milk. (Reuters, 7/25/23; CCPC, 7/14/23;\nDairyReporter.com, 7/24/23)\n\nUSDEC brings you results highlights from recent half-year reports from major\nglobal dairy suppliers:\n\nNestlé reported broad-based growth across most categories and regions. Dairy\ngroup sales rose at a high-single-digit pace, with strong demand for coffee\ncreamers and affordable fortified kinds of milk. Middle East and Africa saw\ndouble-digit growth, with infant nutrition as the largest contributor, led by\nLactogen, NAN and Cerelac. In Brazil, dairy posted double-digit growth,\nsupported by fortified milks and dairy culinary solutions, while infant\nnutrition increased by double-digits as well, based on solid momentum for NAN\nand Nido growing-up milks. In China, infant nutrition saw mid-single-digit\ngrowth, led by NAN specialty offerings and illuma.\n\nFrieslandCampina reported a “challenging” first half, citing “sharply declined\ncommodity dairy prices and lower volumes.” One bright spot was the performance\nof specialized nutrition, which reported strong revenue and operating profit\nfigures, partially driven by growth in infant nutrition sales under the Friso\nPrestige brand in the ultra-premium segment in China. (Company reports)\nLeprino Foods expanded its relationship agreement with Illinois-based\ningredients distributor Univar Solutions. Univar’s Mexican and Brazilian units\nwill distribute Leprino’s nutritional ingredients and dairy products in their\nrespective markets. Leprino said the deal “reinforces our commitments to the\nfood ingredients and nutrition market.” Earlier this year, Leprino selected\nUnivar as an authorized distributor for Canada and the United States. … Japanese\nprobiotic beverage maker Yakult is building a $305-million production facility\nin Bartow County, Georgia. The company expects to commence manufacturing at the\nbeverage plant in 2026. … Danone claims it remains the legal owner of its\noperations in Russia despite a Russian decree in July putting the business under\n“temporary management” of the government. The government justified that move\nwith recently passed rules aimed at companies from “unfriendly” countries. Just\nprior to the takeover, Danone said it was localizing its Activia brand in\nRussia, renaming it AktiBio. A company spokesperson said, “What’s going to\nhappen in the future? We don’t know.” (Company report; Al Bawaba, 7/29/23;\nFoodBev.com, 7/28/23; Bloomberg, 7/26/23)\n\nMilk Specialties Global (MSG) has completed a new production facility in Jerome,\nIdaho, that will produce acid casein and rennet casein products for food and\nindustrial applications. MSG says its new facility will process 2.5 million\npounds of milk each day and offer North American consumers an “alternative\nsupply of domestically produced casein products” … Lactalis Canada has agreed to\npurchase dessert manufacturer Marie Morin Canada for an undisclosed sum. The\nacquisition will see the Canadian division of Lactalis Group expand its presence\nin the dessert category, entering both the Canadian and U.S. markets. The move\nwill complement Lactalis Canada’s extensive dairy portfolio, which includes\ncheese, table spreads, yogurt and fluid brands … South Korea’s Orion has joined\nwith Thailand’s No. 1 milk beverage company Dutch Mill to enter Vietnam’s dairy\nmarket. Orion will first introduce two new product lines – Proyo! and Choco IQ –\nthis month and launch others later … Dow and China’s Mengniu have partnered to\nintroduce a yogurt pouch made entirely from polyethylene. The new packaging\nsolution, which is designed for recyclability, allows previously\n“hard-to-recycle\" packaging to be integrated into closed-loop recycling systems.\n(FoodBev.com, 8/4/23, 8/3/23; The Korea Times, 8/8/23, Food Bev.com, 8/9/23)\n\nArla Foods Ingredients (AFI) inked a partnership with biological solutions\ncompany Novozymes to jointly develop protein ingredients using precision\nfermentation technology. The collaboration will initially focus on creating\nproducts for disease-specific medical nutrition, with expansion into other\nmarket segments expected in the future. “Collaborating with Novozymes fits\nperfectly with our ambition to explore alternative nutrition platforms and\ncomplement our portfolio of dairy and whey solutions,” AFI Group Vice President\nHenrik Anderson said. (Company reports)\n\nAdministrators for aspiring New Zealand-based infant formula manufacturer Happy\nValley Nutrition have recommended that the board vote to liquidate the company.\n… Turkey-based quick-service restaurant operator TFI Tab Food Investments\n(parent company of Burger King (China) Investment Co.) plans to open 200-300\nBurger King outlets in China per year moving forward. The company already runs\nmore than 1,400 restaurants in 150 Chinese cities. … New York-based scoop shop\nVan Leeuwen Ice Cream is opening its first international outlet in Singapore\nthrough a partnership with Singapore-based lifestyle and food and beverage group\nCaerus Holding. (USDEC China office; USDEC Southeast Asia office; Dao Insights,\n8/8/23; Stuff.co.nz, 8/4/23)\n\nArla Foods Ingredients signed a new partnership agreement with Chinese\ningredient and chemical distributor Zhongbai Xingye Food Technology (Beijing)\nCo., a unit of the Brenntag Group. The two companies have a 15-year relationship\nthat includes a jointly funded Innovation & Application Center in Zhongbai’s\nBeijing facility to develop China-specific formulations. The new agreement\nexpands their cooperative product development work and covers the full range of\nArla’s ingredient products. “This agreement will help us adapt and make our\noffering to Chinese markets even stronger,” said Luis Cubel, Commercial Director\nof Arla Foods Ingredients. (Company reports)\n\nOngoing inflation and increased supply chain expenses continue to hinder\ncompanies across the globe as they release their most recent financial\nperformance results:\n\nGlanbia plc reported first-half earnings that exceeded expectations, driven\nlargely by the strong performance of its Glanbia Performance Nutrition (GPN)\nbusiness. Group revenues for the company, which recently changed its financial\nreporting currency from the euro to the U.S. dollar, were $2.8 billion for the\nfirst half of 2023, down from $3.1 billion in HY 2022. But group EBITA (before\nexceptional items) grew 6.1% (constant currency). GPN revenue increased by 3.4%\nin HY 2023 versus the previous year. Based on its half-year results, Glanbia\nupgraded its full-year guidance to 12%-15% growth in adjusted earnings per\nshare.\n\nIn its first quarter 2024 report, Saputo revenues fell 2.8% while net earnings\nrose 1.4% compared to the same quarter last fiscal year. Factors cited by the\ncompany as affecting the first quarter performance included the positive\ncarryover effect of previously implemented pricing initiatives in all its\nsectors, lower average block market price and butter market price in the USA\nsector, and softening of the global demand for dairy products negatively\nimpacting its sales volumes.\n\nBel Group revenues rose 6.3% in the first half of 2022. The company attributed\nthe gain in part to sustained double-digit growth in China and strong\nperformances by core brands, including Kiri and Boursin. Sales in China\nincreased for the fourth consecutive year, driven in part by the performance of\nKiri cheese. Strengthening its presence there was Bel’s acquisition of a\nmajority stake in China’s Shandong Junjun Cheese.\n\nThe second quarter 2023 results for Yum China showed record growth in total\nrevenues and operating profit. The unaudited results show total revenues\nincreased 25% to $2.65 billion, up from $2.13 billion in 2022. Total system\nsales increased 32% year over year, with increases of 32% at KFC and 30% at\nPizza Hut. Same-store sales increased 15% year over year, and the company opened\n422 new stores during the quarter. Net Income increased 138% to $197 million\nfrom $83 million in the prior year period, primarily due to a 216% increase in\noperating profit, which jumped to $257 million and has already surpassed the\nentire year for 2022. Company officials credited robust digital capabilities, an\nagile supply chain and special marketing campaigns for its strong performance,\nas well as strong sales on holidays including Children’s Day.\n\nIn its FY 2023 annual results, A2 Milk reported revenue for FY23 up 10.1% from\nthe previous year and net profit growth of 26.9%. The company credited its\nChina-focused growth strategy for the revenue increase. The China & Other Asia\nsegment saw revenue rise 37.9%, and it exceeded NZ$1 billion (about US$594\nmillion) for the first time. The gains came despite an overall decline in the\nChinese infant formula sector of more than 10% in A2’s FY23. The company\nattributed the decrease to China’s declining birth rate, challenging\nmacroeconomic conditions and increased competition. A2 said it expected another\ndouble-digit decline in China’s infant formula sector in FY24 but expected the\ncompany to still post low single-digit revenue growth. (USDEC China office;\nCompany reports; Radio New Zealand, 8/21/23)\nGlanbia plc’s Group Managing Director Siobhán Talbot announced plans to step\ndown effective Dec. 31. 2023, and retire from the company in January 2024. Hugh\nMcGuire, currently CEO of Glanbia Performance Nutrition, will take over as CEO\nof Glanbia plc effective Jan. 1, 2024. Talbot joined Glanbia plc in 1992 and has\nbeen managing director for the past 10 years. (Company reports)\n\nWells Enterprises is more than doubling its ice cream and frozen novelty\nmanufacturing capacity at its Dunkirk, N.Y., facility. Construction will begin\nthis fall. Wells is owned by Italian confectionery company Ferrero Group. … The\nCheesecake Factory is set to open its first store in Thailand in December\nthrough its relationship with Hong Kong-based foodservice operator Maxim’s\nCaterers. The new store is located in Bangkok. Last fall, Cheesecake Factory and\nMaxim’s announced they planned to open 18 Cheesecake Factory locations in\nThailand by 2028. (Company reports; Lifestyle Asia, 8/17/23)\n\nSeptember\n\nAustralia’s Bega Cheese paid A$11 million (about US$7 million) for certain\nassets of TasFoods Ltd.’s Betta Milk and Meander Valley Dairy businesses. The\ndeal includes a perpetual, royalty-free license for Bega to use the Pyengana\nDairy brand in Australia. (Company reports)\n\nJohn Jordan, CEO of Irish dairy manufacturer and marketer Ornua, is stepping\ndown to take on a new position as COO of a U.S.-based private equity firm. The\nOrnua board named current CFO Donal Buggy as interim CEO while it began a search\nfor a permanent replacement. … McDonald’s Malaysia plans to spend more than\nUS$40 million to open 36 new stores in Sabah, the Malaysian state on the island\nof Borneo. The company expects to complete the expansion by 2030, giving it 52\ntotal stores in Sabah. … Tim Hortons China plans to open 1,700 Popeyes units in\nChina over the next decade. (USDEC Southeast Asia office; USDEC China office;\nCompany reports)\n\n2022 was a good year for large companies in Rabobank’s Global Dairy Top 20. They\nhad a combined turnover gain of 7.4% in U.S. dollar terms (based on 2022 sales,\nplus acquisitions completed by June 30, 2023.) Favorable commodity prices,\ninflation and a tight dairy market were contributing factors. Yet, as Rabobank\npoints out, the degree to which a dairy company’s revenues benefitted from price\ndevelopments depended on a combination of its product portfolio, geographic\npresence and distribution channels. French dairy giant Lactalis held onto the\nNo. 1 spot with an estimated turnover of $28.6 billion. Two U.S. companies made\nsignificant jumps on the list. Dairy Farmers of America moved from No. 4 to No.\n2 – leaping over Nestlé and Danone -- with a turnover of $24.5 billion.\nSchreiber Foods moved from No. 19 to No. 16. New Zealand’s Fonterra dropped\nthree spots from No. 6 to No. 9. To download the full Rabobank report, click\nhere.\n\nDespite ongoing inflation, cautious optimism was a common theme among many\ncompanies looking ahead as they released their most recent financial statements:\n\nArla Foods: The numbers: Denmark-based Arla Foods’ revenue was up 10.7% compared\nto the first half of the previous year, but Arla saw net profit drop to 1.5% of\nrevenue from 3.0% in the last half-year. Beyond the numbers: Arla predicts\ninflation will continue to influence consumer patterns—and put pressure on\nbranded volumes in most markets—for the rest of 2023. But the company expects\nits branded-product growth numbers will climb again in the second half of this\nyear. The commodity market, however, “continues to be marked by uncertainty,”\nArla said.\n\nBega Group: The numbers: For the full year ending in June, Australia-based Bega\nposted revenue growth of 12% from 2022, while EBITDA dropped 4%. Beyond the\nnumbers: Now in the final phase of its transition to a predominantly branded\nbusiness, Bega credits its brands for driving performance in the second half of\nits fiscal year. The company expects the majority of profit for the coming\nfiscal year will come from this branded segment.\n\nDutch Lady Milk Industries: The numbers: The Malaysia-based dairy processor\nreported a net profit increase of 12.7% in the second quarter that ended June\n30, 2023. Quarterly revenue also increased 3.3% for the same period. Beyond the\nnumbers: Dutch Lady says higher revenue was driven by strong demand and\nselective price increases designed to offset inflationary headwinds.\nEmmi Group: The numbers: Emmi’s first-half 2023 sales increased by 4.3% from the\nprevious half-year, with net profit jumping 25.2%. Beyond the numbers: Emmi\nGroup, based in Switzerland, credits its rebound from a challenging 2022 in part\nto the strength of its ready-to-drink coffee brands, such as Emmi Caffè Latte,\nas well as chilled premium desserts.\nFeihe Ltd.: The numbers: The first half of 2023 saw revenues tick up 0.6% from\nthe previous year for the Chinese formula company. Gross profit for the same\nperiod decreased by 2.7%. Beyond the numbers: Feihe says it is dedicated to\ninnovation in “fresh keeping” technology and expanding its business into formula\nand nutritional products covering the age cycle from infant to senior. In the\nfirst half of 2023, sales of its adult milk powder jumped 57% from the previous\nyear.\n\nMengniu Dairy: The numbers: Mengniu’s 2023 half-year revenue increased 7.1%\ncompared to the same period the previous year, with an operating profit increase\nof 29.9%. Beyond the numbers: The China-based company saw liquid milk revenues\nincrease 5% from the previous year, while its ice cream business revenue\nincreased 10.5%. Its cheese segment, which is self-operated by its Shanghai\nMilkground Food Tech business, increased 310% compared to the same period last\nyear—a jump attributed to the rising cheese demand in China.\n\nNew Hope Dairy: The numbers: The China-based dairy supplier reported that\nrevenues increased 10.8% in the first half of 2023. Net profit climbed 25.1% for\nthe same period. Beyond the numbers: New Hope said it will continue to focus\nefforts on its pasteurized milk segment, which posted a revenue increase of more\nthan 10% from the previous year.\n\nPanda Dairy Corp.: The numbers: For the first half of 2023, the China-based\ncompany’s revenue was up 18.3% year over year, and net profit leaped 107.1% for\nthe same period. Beyond the numbers: The company attributes the growth to the\nactive development of new channels and customers, including adding distributors\nfor catering and establishing strategic partnerships with food companies.\nLooking ahead, it expects cheese and cream to be new growth categories.\n\nYili Group: The numbers: China’s Yili saw a 4.3% increase in revenue for the\nfirst half of 2023, and net profit was up 2.9% over the previous year. Beyond\nthe numbers: China’s largest dairy company credits its revenue growth to strong\nsales of infant formula and ice cream, both of which posted double-digit gains\nduring the period. A company official said demand for liquid milk is also on the\nrise and that the slowdown in its milk powder business is showing signs of\nimprovement. (Company reports; USDEC China office; Yicai, 8/29/23; The Edge\nMalaysia, 8/24/23)\nNew Zealand-based dairy cooperative Fonterra is seeking US$596 million in cost\nsavings, likely leading to the potential loss of jobs, reports an article in\nJust Food. “While this focus on efficiencies will have implications for staff\nnumbers, we don’t want this to be at the expense of driving value growth,” CEO\nMiles Hurrell said in a letter to its farmer owners. The cost-cutting plan will\nbe implemented over the next seven years.\n\nFrench cheese giant Bel Group offered its take on doing business in China in a\nrecent piece in DairyReporter.com. The company said it tried for years to break\ninto the China market by selling its Laughing Cow cheese cubes, all in savory\nflavors popular in other markets. But Bel realized Chinese consumers wanted\nsweeter cheeses. “As soon as we thought out of the box and integrated fruit\njuices to develop the fruity range, the products started doing extremely well,”\nsaid Gorge Bai, Bel China general manager, cheese. But that does not mean\nabandoning traditional product lines, Bai said. He recommended a dual approach:\ninnovate to local tastes while simultaneously introducing tastes and products\nthat might be new to the market. (DairyReporter.com, 8/29/23)\n\nTillamook County Creamery Association is working with Golden West Food Group on\n“premium, restaurant-quality” frozen meals, which comprise three types of\nmac’n’cheese products and four frozen pizza flavors. It’s a new segment for\nTillamook, which markets fresh products such as cheese, butter, spreads, ice\ncream and sour cream … Denmark’s Arla Food Ingredients has taken full control of\nMV Ingredients, with Volac exiting the joint venture, which has been in place\nfor more than 10 years. MV Ingredients is a whey processing facility based at\nArla Foods Ingredient’s Taw Valley creamery in the UK … HP Hood will expand its\nmanufacturing operations at the Genesee Valley Agri-Business Park in Batavia,\nNew York. The $120 million project is expected to create 48 jobs in Genesee\nCounty … Müller Yogurt and Desserts has launched Müller Corner Originals,\nbringing back favorites from the last 30 years. The first retro flavors from the\nEnglish dairy company’s back catalog will be Mississippi Mud Pie Inspired and\nStrawberry and Choc Orange Balls. (Dairy Reporter, 9/4/23; Food Ingredients\nFirst, 9/4/23; Area Development, 9/4/23; FoodBev Media, 9/6/23)\n\nAn international dairy development collaboration created to further the\ndevelopment of organic dairy production in Indonesia recently introduced that\ncountry’s first locally produced organic cheese. The launch is the result of a\npartnership between Denmark-based dairy cooperative Arla Foods and partners,\nincluding Indonesia-based dairy producer Mazaraat Artisan Cheese, the Indonesian\ngovernment and the Danish Ministry of Foreign Affairs.The effort began with\nIndonesian farmers and other stakeholders making research trips to Denmark in\n2018, wh ere Arla shared its agricultural experience and best practices for\norganic dairy production. The organizations formed a partnership that went on to\nconvert a number of conventional Indonesian farms to certified organic dairy\nproducers. Mazaraat processed milk produced at those farms to become the\ncountry’s first organic cheese. The partnership was formed to meet Indonesia’s\ngrowing dairy demand. Roughly 80% of the country’s dairy consumption comes from\nimported products, and demand is expected to increase by 6% in 2023. The\nIndonesian government is also working to increase local organic food production\nfrom 2% to 20% by 2024. The cheese will be sold locally in hotels, cafés, and\nrestaurants, and Mazaraat says it has inked its first export agreement with\nSingapore. (Company reports, 8/31/23)\n\nMengniu Dairy, China’s second-largest dairy company, said it believes increasing\nconsumer demand will make innovation in protein products, especially in the\nready-to-drink (RTD) beverage format, a key component to the country’s domestic\ndairy growth. At the Food and Beverage Innovation Forum in Shenzhen, China,\nMengniu Nutrition and Health GM Ben Wu said the company believes RTD protein\nproducts will drive the dairy category as Chinese consumers seek the health and\nnutritional benefits of dairy across all life stages. Other factors Wu\nidentified as contributing to the increased demand for protein products include\nthe aging of Chinese society and a rise in the number of professional Chinese\nathletes. Wu also said opportunity areas exist around protein products with\nChinese cultural significance and those with flavors catering to Chinese tastes.\nMengniu recently launched its first range of locally produced RTD beverage line\ncalled M-Action, which features products targeted to men and women based on\ntheir genetic differences and activity levels. (DairyReporter.com, 9/6/23)\n\nSolar Foods, a Finland-based food technology company, received funding worth\n€5.5 million (about US$5.9 million) from the European Innovation Council to work\non a four-year project to develop an animal-free milk protein. The “Hydrocow\nproject” will use genetic engineering to produce milk protein from carbon\ndioxide and electricity. Solar Foods and a consortium of European academic\npartners plan to build a protein production platform that will produce\nbeta-lactoglobulin, the major whey protein in cow’s milk, and eventually convert\ncarbon dioxide into ingredients including lactoferrin, casein, enzymes and other\nproteins. (Food Ingredients First, 9/6/23)\n\nThe receivers for New Zealand-based processor Dairy Nutraceuticals reportedly\nsigned a deal to sell the company’s fixed assets, despite findings that its\naccounts “appear inaccurate.” They did not identify the buyer. Bank of China\nappointed receivers in July after Dairy Nutraceuticals breached its lending\nagreement. … U.S. cheese manufacturer Heartisan Foods acquired gourmet cheese\nspread maker North Country Packaging. Heartisan was formed by private equity\nfirm Ronin Equity Partner in 20221 after Ronin acquired and merged the\noperations of Red Apple Cheese, Barron County Cheese and e-commerce business\nCheese Brothers. … Nestlé acquired a majority stake in Brazilian premium\nchocolate firm Grupo CRM. Grupo CRM operates more than 1,000 chocolate boutiques\nunder the Kopenhagen and Brasil Cacau brands and has a growing online presence.\n(Company reports; FoodBev.com, 9/12/23; BusinessDesk, 9/5/23)\n\nChinese dairy processor Royal Group began construction on a $411-million buffalo\nmilk processing plant in Anhui Province. … PT PepsiCo Indonesia Foods and\nBeverages broke ground on its first snack food manufacturing facility in\nIndonesia. The project marks PepsiCo’s return to the country after selling its\nstake in a 30-year snack-manufacturing joint venture two years ago. … Australian\ninfant formula maker Bubs Australia named Reg Weine as its new CEO, replacing\ninterim CEO Richard Paine. Paine took over for founder and CEO Kristy Carr who\nwas ousted in May for reportedly failing to comply with “reasonable board\ndirections.” (USDEC China office; USDEC Southeast Asia office; FoodBev.com,\n9/1/23; Reuters 8/29/23)\n\nFrench dairy giant Danone announced a new program created to identify and\ndevelop strategic partnerships to drive innovation, efficiencies and growth. The\n“Partner for Growth” program aims to leverage consumer trends and create growth\nopportunities in four strategic areas: emerging science and technology,\nprecision capacity creation, cost competitiveness, and sustainability. The\ninitiative is run through Danone Manifesto Ventures, the company’s corporate\nventure arm, and will target partnerships with organizations ranging from\nstartups to major corporations and academic institutions. The first such\nalliances have already been formed and include a partnership with Arla Foods to\nsupply specialty dairy ingredients, a relationship with Kansas-based McCarty\nFamily Farms for pioneering regenerative agriculture practices, and a joint\nbusiness development plan with Denmark-based bioscience company Chr. Hansen will\nwork with Danone to innovate dairy and plant-based solutions designed to improve\nconsumer health. (Company reports)\n\nNew Zealand’s A2 Milk Co. gave Synlait Milk written notice that it was canceling\nits exclusive infant formula supply agreement with the company, paving the way\nto move more production to A2’s own factory. Synlait has exclusive supply and\nmanufacturing rights to A2 Milk’s Stage One, Two and Three infant milk formula\nproducts sold by A2 Milk in China, Australia and New Zealand. (Synlait makes\nother A2 products as well, though not exclusively.) A2 claims Synlait failed to\nlive up to on-time performance provisions in the contract, allowing A2 to\nproduce the products elsewhere. The original exclusivity deal runs through\nSeptember 2027. Synlait is expected to challenge the deal’s cancellation and\nsaid it expects to continue to make the products through the life of the\noriginal contract. Despite moving to cancel the exclusivity provision, A2 said\nit expects Synlait to remain an important supplier to the company and that\nSynlait is contractually bound to provide a set volume of infant formula.\n(Stuff.co.nz, 9/18/23)\n\nA new joint-venture dairy plant in Paide, Estonia, has produced its first\ncheddar cheese. Cross-border Estonian-Latvian dairy co-op SCE E-Piim,\nNetherlands-based Royal A-Ware and Interfood Group built the facility. Royal\nA-ware is responsible for the sale of cheese from the factory, while Interfood\nwill handle the sale of whey powder and butter. … Ireland’s Competition and\nConsumer Protection Commission (CCPC) completed its investigation of Aurivo\nConsumer Foods’ purchase of certain assets of Arrabawn Co-operative Society and\ncleared the acquisition, finding that it would not substantially lessen\ncompetition. (Company reports; CCPC)\n\nDanone is spending €50 million (about US$53 million) to expand the production of\nmedical nutrition products at its plant in Opole, Poland. Specialized nutrition,\nwhich includes medical nutrition, accounted for about 30% of Danone’s total\nrevenues and grew 10% in 2022. … Yum China Holdings revised this year’s new\nstore opening target from 1,100-1,300 to 1,600, citing more predictable market\nconditions in the wake of the removal of COVID restrictions and resilience in\nChina’s fast-food sector. It currently has around 13,600 units in China and is\naiming for 20,000 by 2026. … Chinese milk producer Adopt A Cow is building an\n$87-million manufacturing facility in Hebei Province. The plant, when complete,\nwill produce 150,000 MT of fluid milk per year. (USDEC China office; Company\nreports; Bloomberg News, 9/14/23)\n\nDutch dairy giant FrieslandCampina reorganized its business structure as part of\na broader plan to boost profitability. The company split its Food & Beverage\nBusiness Group into five separate business units: Europe; Middle East, Pakistan\nand Africa; Asia; Retail and Americas; and Professional (combined with its\nTrading business unit). Ingredients and Specialized Nutrition remained as their\nown business units. Jan Derck van Karnebeeck, who took over as FrieslandCampina\nCEO in June, named a new executive team to lead each group. The executive team\nappointments take effect on Oct. 1, but the new business units will not be\nofficial until Jan. 1, 2024. (Company reports)\n\nSingapore private equity firm Growtheum Capital Partners is growing its dairy\nportfolio. After sinking US$100 million in Vietnam’s International Dairy\nProducts earlier this year, the company invested a reported US$70 million in\nvertically integrated Indonesian dairy manufacturer KIN Dairy. Growtheum joins\nMitsui & Co. as a backer of KIN, which operates one of the only A2-cow dairy\nfarms in Indonesia. (USDEC Southeast Asia office; Deal Street Asia, 9/18/23)\n\nLactalis Canada is consolidating its Canadian cheese and table spread\ndistribution operations into a new single distribution center in Oshawa,\nOntario. The facility, occupying nearly 380,000 sq. ft., will be Lactalis’s\nlargest-capacity distribution (by capacity) in the world. It’s slated to open in\nthe fourth quarter of 2024. (European Supermarket Magazine, 9/21/23)\n\nOctober\n\nOlam Food Ingredients (OFI) significantly expanded its manufacturing plant in\nJohor, Malaysia. The project, which includes a new milk powder dryer and\nexpansion of the OFI Ingredient Excellence Center (IEC), more than doubles the\nplant’s capacity to 90,000 MT of fat-filled milk powder and other dairy\ningredients each year and will play a key part in serving the demand from\ncustomers in the Middle East, North Africa and Asia, the company said. The IEC\nis one of OFI’s global network of 15 innovation centers. The company says the\nexpansion will allow it to focus on high-growth segments such as ready-to-drink\nbeverages, premixes and blending lines, alongside its existing range of filled\nmilk powder solutions. (DairyReporter.com, 9/28/23; FoodBev.com, 9/29/23)\n\nEuropean dairy giants FrieslandCampina and Arla Foods Ingredients are bolstering\ntheir whey processing capabilities at projects in the Netherlands and Argentina,\nrespectively. FrieslandCampina is doubling WPI capacity at its Borculo,\nNetherlands, plant to meet rising global demand in the sports and infant\nnutrition sectors. The investment is part of a new business strategy called\n“Expedition 2030,” and also includes company-wide cost cuts to the tune of\n€400-500 million annually (about US$424-530 million). FrieslandCampina said the\ncost-cutting will not entail production facility closures. Denmark-based Arla\nFoods Ingredients is building a new drying tower to double whey permeate powder\ncapacity at its plant in Porteña, Argentina. The company expects to complete the\nproject in 2026. The expansion comes on the heels of a just-completed upgrade to\nthe facility’s sanitary standards to produce infant formula-grade proteins. The\ncompany said infant-grade products will account for “a sizeable proportion” of\nthe plant’s output within the first year and increase further over time.\n(Company reports)\n\nCalifornia Dairies Inc. (CDI) continues to achieve benchmarks in its commitment\nto reducing greenhouse gas emissions and its journey toward sustainability. As\npart of those efforts, California’s largest member-owned milk marketing and\nprocessing cooperative has successfully implemented three innovative\ndecarbonization technologies developed to improve energy efficiency and reduce\nemissions without interrupting operations at two of its largest facilities. CDI\nworked with industrial thermal energy service provider Skyven Technologies to\ndesign and implement the technologies. They include two solar thermal systems\nthat convert solar energy into heat for thermal processes to reduce steam loss\nand a boiler heat-recovery system that boosts boiler efficiency by roughly 10%.\nSo far, these solutions have removed more than 3,500 MT of carbon dioxide\nemissions and more than 65,000 MMBtu of natural gas from those facilities. Those\nnumbers are projected to grow to more than 4,700 MT of CO2 and more than 89,000\nMMBtu of natural gas over the course of a full year. No up-front capital was\nrequired from CDI for the project. Financing included grant funding from the\nCalifornia Energy Commission’s Food Production Investment Program (FPIP),\nutility incentive funding from Pacific Gas & Electric and Southern California\nGas, and investments from Skyven and energy performance investment company\nKyotherm. Project officials say the decarbonization technologies will pay for\nthemselves in the form of the resulting energy savings. CDI is working with its\npartners to implement additional decarbonization solutions at more facilities as\nit continues its work to advance dairy sustainability. In its latest\nsustainability report, CDI says it is committed to achieving carbon neutrality\nor better by 2050 and reducing direct and supply chain greenhouse gases 30% by\n2030. The co-op is aiming for 80% of electricity use on CDI farms to be\nrenewable or carbon-free by 2030, and 100% by 2045. (Company reports;\nDairyReporter.com, 10/5/23)\n\nNew Zealand’s Fonterra Co-operative Group announced a partnership with\nmicrobiome research institute APC Microbiome Ireland to develop a research\ncenter at University College Cork in Ireland. The collaboration, which will\noperate out of the newly established Fonterra microbiome research center, will\nwork to better understand the human microbiome and develop new probiotic\nproducts designed to deliver health and wellness benefits. A Fonterra spokesman\nsaid the company aims to launch a number of new probiotic strains over the next\ndecade. The center is expected to be operational by the end of this year. (Food\nBusiness Africa, 10/9/23)\n\nFrieslandCampina Ingredients announced a new early life nutrition (ELN) platform\ndeveloped to support the physical and mental development of children from age\nthree into adolescence. The new platform, called Step Up Nutrition, features\ningredients designed to support five areas of child development: growth,\nimmunity, cognitive development, gut health and mental health. At Vitafoods Asia\n2023 in Singapore, the company showcased prototypes of products featuring its\nELN ingredients and their benefits. These products included a powdered milk\ndrink developed to promote growth, an immunity-supporting drinkable yogurt, and\nmilk drinks created to boost cognition and gut health. Company officials said\ndespite a downturn in the regular infant milk market, they believe there is a\ngrowing global consumer demand for nutritional products for young children and\nthat while dairy remains the “nutritional go-to” for most of them, a growing\nnumber of manufacturers are looking to the ELN category as a potential growth\ndriver. (Dairy Reporter, 9/28/23; Nutrition Insight, 9/20/23)\n\nDanone plans to launch a new infant formula containing milk droplets that\nclosely mimic the structure found in breast milk. Paris-based Danone revealed\nthe launch at the Growth Asia Summit 2023 in Singapore and said the product will\nbe introduced in China later this year. The new formula, called Nuturis, is\ninspired by biomimicry and aims to replicate some of the parts of human milk fat\nglobules, including size and structure, that could help babies digest the\nformula more similarly to breast milk. Research indicates this similarity may\npromote benefits, including improved metabolic outcomes and growth that is\ncomparable to breastfed babies. (Growth Asia, 9/26/23)\n\nChinese dairy manufacturer Shanghai Milkground Food Tech is making a foray into\nexports. The company shipped its first load of cheese lollipops to Australia and\nSoutheast Asia with plans to expand volume to both regions. The lollipops are\nmade with dairy ingredients from Australia and come in three flavors: plain\n(salty), vanilla and strawberry. … China’s Lefuna Food Technology completed the\ninitial phase of construction on a new cheese manufacturing plant in Shanghai.\nLefuna, established in 2020, markets cheese powder and will expand into\nmozzarella once the new facility is up and running in mid-2024. The company\nexpects sales from the facility to exceed $200 million annually starting in\n2025. Future investments will add a 16,000-sq.-ft. lab and develop an in-house\nmilk supply. … UAE-based food and beverage maker Nutridor opened a new\nAED75-million (about US$20 million) dairy processing facility in Dubai. The\nplant will handle about 125 MT of milk per day, producing value-added dairy\nproducts under the Abevia brand. Nutridor, which operates in more than 15 Middle\nEastern and African countries, is targeting domestic as well as export markets\nin the region. (USDEC China office; USDEC Middle East/North Africa office)\n\nWalmart plans to build a new $350 million milk processing plant in Valdosta,\nGeorgia, to provide milk for more than 750 Walmart and Sam’s Club stores in\nGeorgia and neighboring states. It will be the second milk processing plant that\nWalmart has built after the one that opened in 2018 in Fort Wayne, Indiana …\nFrench dairy company Lactalis has received regulatory clearance to finalize the\nacquisition of Dairy Partners Americas in Brazil after Fonterra and Nestlé put\nthe venture on the market … British online grocer Abel & Cole says it has\ncreated the UK’s first environmentally-friendly refillable plastic milk bottle\nin order to reduce carbon emissions during transportation … New Zealand-based\nSynlait Milk announced that its exclusivity dispute with The A2 Milk Company\nremains unresolved and is now entering arbitration … Saudi food conglomerate\nSavola Group has confirmed that it’s exploring options for its $5.3 billion\nholding in the Middle East’s largest dairy firm, Almarai. (Associated\nPress,10/11/23; Just Food,10/12/23; Dairy Reporter,10/16/23;\nFoodBev.com,10/18/23; Trade Arabia, 10/18/23)\n\nNestlé plans to shut down its Wyeth Nutrition infant formula facility and R&D\ncenter in Askeaton, County Limerick, Ireland. The factory produces products\nexclusively for export to China and Asia. The sharp decline in China’s birthrate\nin China coupled with gains by domestically produced formula makers has undercut\ndemand for the plant’s products. Nestlé plans to transfer production to existing\nfactories in Suzhou, Jiangsu Province, China and Konolfingen, Switzerland. The\ncompany has been unable to find a buyer for the facility but said it would\nremain open to offers. The plant shutdown is slated for the first quarter of\n2026; the R&D facility will shutter in the first quarter of 2025. (The Irish\nTimes, 10/18/23)\n\nVietnam’s Vinamilk signed a memorandum of understanding with Chinese “partners”\nto distribute Vinamilk yogurt in China. The Chinese companies—including\nGuangzhou Jiangnan Fruit and Vegetable Wholesale Market Management—will oversee\nimports, the distribution network, regulatory compliance and trade promotions. …\nAfter rolling out a milk, soy and fruit-powered beverage in Asia last year,\nNestlé launched an instant beverage powder in Central and West Africa made with\na blend of milk- and plant-based ingredients. Nido Milk & Soya was developed by\nthe company’s R&D center in Cote d’Ivoire. … Arizona-based Villa Dolce Artisan\nDesserts is opening a 76,000 sq. ft. manufacturing plant in Glendale, Arizona to\nmanufacture gelato and frozen novelties. (Company report; FoodBev.com, 10/23/23)\n\nNovember\n\nIrish dairy exporter Ornua, which owns Kerrygold, officially opened its new\n€40-million (about US$42 million) development at the company’s Kerrygold Park\nproduction facility in Mitchelstown, Co. Cork. The investment increases the\nsite’s butter production capacity to 80,000 MT per year. The project includes 10\npacking lines for a range of over 50 product formats supplied to more than 60\nmarkets globally. An Ornua spokesman said the development is part of the\ncompany’s efforts to become Ireland’s first €2 billion (about US$2.1 billion)\nfood brand. (Agriland, 10/25/23)\n\nChina’s Jialihe Husbandry is building a 24,000-cow dairy farm in Chifeng City,\nInner Mongolia. The company expects to complete the project in December 2025.\nWhen at capacity, it will produce 150,000 MT of raw milk per year. … Norway’s\nTINE dairy is restructuring its processing operations to address long-term\ndeclines in domestic fluid milk and brown cheese consumption. The company is\nshuttering its Sem and Kristiansand fluid plants, halting fluid operations at\nSola and Frya, and downsizing its cheese lines at Lom and Skjåk. TINE hopes\nplanned brown cheese new product projects will lead to regrowth. … Saputo is\npermanently closing its Lancaster, Wisconsin, cheese plant following the opening\nof its newly converted Reedsburg, Wisconsin, facility to goat cheese\nmanufacturing. Lancaster will close in the fourth quarter of 2024, along with\nthe closure of Saputo’s Belmont, Wisconsin, goat cheese plant, which was\npreviously announced. … Shake Shack opened its first unit in Malaysia in\ncooperation with Korean restaurant operator SPC Group and other local partners.\nShake Shack plans to open more than 45 stores in Malaysia. Singapore and South\nKorea by 2031. (USDEC China office; Company news; Inside Retail, 10/31/23)\n\nLeprino Foods President and CEO Mike Durkin announced that he would retire\neffective November 2024. Durkin joined Leprino as senior vice president and CFO\nin 2011 before taking over as president and CEO three years later. In addition\nto heading up Leprino, he has held various leadership positions in the U.S.\ndairy and world dairy industries, including chair of the Innovation Center for\nU.S. Dairy and as a member of Global Dairy Platform’s Global Dairy Board.\nLeprino announced that Lance FitzSimmons, executive vice president and chief\nsupply chain officer, will succeed Durkin effective Nov. 1, 2024. FitzSimmons\nhas been with Leprino since 2009, managing nearly every division of the company.\n(Company reports)\n\nMexico’s Grupo Lala exited the Nicaraguan market, reportedly selling its\noperations to a group called Nicaragua Dairy Ventures. Lala entered the\nNicaraguan market in 2014, acquiring well-established local processor Eskimo SA\nand, two years later, La Perfecta, promising to expand milk collection, transfer\ntechnology to its milk suppliers, increase storage facilities, and create new\njobs. After the sale announcement, media reports were critical of the company,\nsaying the promises were unfulfilled. (Breaking Latest News, 11/3/23; La Prensa,\n10/27/23)\n\nNew Zealand’s Olam Food Ingredients (OFI) new Tokoroa, North Island, processing\nplant is nearly finished with its commissioning stage. The NZ$100-million\nfacility (about US$59 million) produced its first bags of WMP at the end of\nAugust, and staff has been fine-tuning the process since. Phase 2 of\nconstruction will add specialist powder capacity, although completion is at\nleast two years away. … Starbucks said it expects to add nearly 15,000 locations\noutside of North America by 2030. It currently operates around 20,000\ninternational cafes. (Farmers Weekly, 11/2/23; CNBC, 11/2/23)\n\nWisconsin-based dairy cooperative Foremost Farms USA has partnered with\nBoston-based biotechnology company Ginkgo Bioworks to reduce the dairy\nindustry’s carbon footprint while lowering manufacturing costs and creating a\nnew revenue stream for the co-op’s Midwest dairy farmer members. The\ncollaboration aims to use biotechnology advances to create and commercialize the\ndomestic, sustainable conversion of low-value dairy manufacturing co-products\ninto environmentally friendly, value-added materials. The organizations estimate\nthat the new technology could help upcycle billions of pounds of dairy\nco-products each year. “We are innovating to continue our trajectory as\nenvironmental stewards that take care of our world and create value for dairy\nfarm families by potentially lowering manufacturing costs and creating a\nsignificant new revenue stream for those farmers,” said Greg Schlafer, president\nand CEO of Foremost Farms. (Company reports)\n\nNew Zealand’s Fonterra Co-operative Group announced at its annual meeting\nseveral new initiatives supporting its climate ambitions. The first, an on-farm\nemissions reduction target, seeks to reduce the intensity of on-farm emissions\n(which comprises 86% of the co-op’s total emissions) by 30% by the year 2030.\nFonterra said it plans to achieve this new target through reduction efforts,\nincluding sharing farming best practices such as feed quality and improving herd\nperformance; novel technologies being developed through the agribusiness and\ngovernment joint venture AgriZeroNZ; carbon removals from existing and new\nvegetation; and historical land-use change conversions to dairy. To support this\nplan, Fonterra launched a Climate Roadmap, a plan that outlines the actions the\nco-op will take toward its 2030 targets and ambition to be “net zero” by 2050.\nIn addition, Fonterra voluntarily released its first climate-related disclosure\nreport, which identifies risks and opportunities related to climate and helps\nthe co-op plan for the future. New Zealand claims to be the first country to\npass a law introducing mandatory climate-related risk reporting. This\nrequirement will become mandatory next year for roughly 200 New Zealand\ncompanies, including Fonterra. Separate from Fonterra, New Zealand regional\ngovernments continue to advance new sustainability regulations. Proposed land\nand water regulations for the Otago region would cause several changes for area\nfarmers. The regs include proposed changes around setbacks from waterbodies for\nvarious farming activities, suggested limits on the number of cows per hectare\nas a measure of intensity, suggested restrictions on the amount of nitrogen\nfertilizer used per hectare, and changes around minimum flows for the\nManuherekia River. Farmers have expressed significant concerns regarding the\nproposals, which are still in the draft stage. The deadline to finalize the plan\nis June 2024. (Company reports; New Zealand Herald, 11/9/23)\n\nChinese dairy processor Junlebao Group acquired a 30% stake in Chinese fresh\nyogurt retailer More Yogurt. More Yogurt operates over 1,600 stores in first-\nand second-tier cities. Retail outlets are a growing distribution channel for\nfresh yogurt in China. (China Daily, 11/9/23)\n\nSaputo is conducting a strategic review of its King Island Dairy specialty\ncheese plant in Tasmania, Australia. It is working with its advisor MA Moelis\nAustralia on potential options, including a possible sale. In addition, Saputo\nalso announced it was committing A$27 million (about US$17 million) to a series\nof projects at its facilities in Victoria and Tasmania. … FrieslandCampina ended\nits farmer departure scheme, which it implemented in 2009 to incentivize milk\nsuppliers to switch to alternate buyers. Regulators mandated that the company\nredirect 1.2 million tons of milk as a condition of the merger between Friesland\nFoods and Campina. More than 1,000 suppliers have left the co-op under the plan,\nreaching the 1.2 million ton threshold. FrieslandCampina says it is open to\ntaking on new suppliers now that the scheme is cancelled. (Company news; ABC,\n11/8/23)\n\nDecember\n\nSeattle-based Darigold plans to open a new office in the Boise, Idaho, area. The\nnew site “gives us greater access to a larger workforce focused on agriculture,\ncreates a better opportunity to establish Darigold as an employer of choice and\nvalued community partner, and establishes a presence closer to some of our\nfarming and production operations in other parts of our regions,” said Joe\nCoote, CEO. The company hopes to secure the space in early 2024. Completing\ntenant finish and staffing will take 18-24 months, Darigold estimates. (Company\nreports)\n\nBetween now and the first quarter of 2025, Ireland’s Lakeland Dairies plans to\nclose three manufacturing sites, build a new fluid milk processing plant in\nKilleshandra, County Cavan, and align future investment toward value-added\nproducts. The company is closing its milk drying plant in Lough Egish and its\nbutter facility in Banbridge in June 2024. The Lakeland Dairies fluid plant in\nthe town of Monaghan will shut down in early 2025, with production transferred\nto a new facility at the company’s Killeshandra site. The company plans to sell\nthe Monaghan fluid plant and the Banbridge butter facility. “The next decade\nwill be less about large volume growth and more about value-added growth and\nadding capability throughout the business,” said CEO Colin Kelly. (Company\nreports)\n\nIndia’s Kerala Cooperative Milk Marketing Federation (KCMMF), known by its trade\nname Milma, entered an agreement with retail giant Lulu Group to sell Milma\ndairy products in Lulu’s extensive network of Middle Eastern hypermarkets and\nmalls. The Memorandum of Understanding, which was signed at the World Food India\n2023 conference in New Delhi, aims to expand the range of dairy products\navailable in Lulu’s stores to reach a wider segment of the population. KCMMF\nChairman K.S. Mani said Milma is aiming to move the cooperative forward by\nlooking beyond its traditional milk and curd products to additional offerings.\nThe deal will initially place five long shelf-life Milma products—ghee, premium\ndark chocolates, golden milk mix powder (a health drink), instant paneer-butter\nmasala and palada payasam mix—in Lulu hypermarkets, with the goal of eventually\nincreasing the number of products sold at Lulu outlets to 25. The cooperative\nestimates the agreement will generate roughly US$12 million in the first two\nyears. (USDEC Middle East/North Africa office; Agritimes, 11/7/23)\n\nJapanese conglomerate Sojitz Corp.—together with Sojitz Asia and Sojitz\nVietnam—jointly acquired full ownership of Vietnamese importer/distributor\nDaiTanViet Joint Stock Co., also known as New Viet Dairy. New Viet Dairy has a\nsignificant presence in dairy ingredients and cheese. Sojitz plans to\ncollaborate with its subsidiary Huong Thuy Manufacture Service Trading Corp. to\nestablish a broadline wholesale food distribution business in Vietnam focused on\nindependent retailers, mass merchandisers and mid- to high-end hotels and\nrestaurants. (Company reports)\n\nMcDonald’s is buying back Carlyle Group’s 28% stake in the fast-food giant’s\nChina business. McDonald’s sold the bulk of the China business to Carlyle and\nChinese-state-owned Citic in 2017; Citic will retain a 52% share. Since 2017,\nMcDonald’s has doubled its footprint in China to more than 5,500 units and plans\nto reach 10,000 stores by 2028. … Danone plans to collaborate with Else\nNutrition, a Canadian supplier of plant-based infant formula. The first stage of\ntheir partnership is a license agreement that will add Else’s products to\nDanone’s specialized nutrition portfolio and see Danone market and commercialize\nthe line. (USDEC China office; CNBC, 11/20/23; Just Food, 11/14/23)\n\nMengniu Dairy has entered the Chinese baked goods sector with the launch of a\nhigh-calcium biscuit in two varieties: milk and cheese. The products use cheddar\nfrom Denmark, butter from New Zealand and milk powder and fluid milk from\nMengniu. … Arla Foods Ingredients CEO Henrik Andersen is stepping down to pursue\na new career path. Andersen has been with AFI since 1994 and held the CEO\nposition since 2010. Luis Cubel, AFI’s vice president, commercial, will take\nover as the new CEO effective Feb. 1, 2024. The company has opened a search for\nCubel’s replacement. … Lactalis filed a €1.1 billion claim for damages against\nlab services provider Eurofins. Lactalis says that Eurofins incorrectly found\nthat salmonella was present in the company’s infant formula in 2017, causing a\nglobal recall and shutting down its plant in Craon, France, for nearly a year.\nEurofins called the claim “frivolous.” … Switzerland’s Emmi Group opened its new\ncheese conversion and packaging facility in Stoughton, Wisconsin. The company\nsays the facility helps simplify logistics, increases efficiency and advances\nits internal sustainability goals. (USDEC China office; Company reports; Food\nSafety News, 11/24/23; Boerderij/International-Dairy.com, 11/21/23)\n\nAustralia’s Pure Dairy Manufacturing began construction on a new\nstate-of-the-art production facility in Melbourne. The A$100 million facility\n(about US$66 million) reportedly represents the largest privately funded\nAustralian dairy investment in the last 40 years. Covering 10 acres, Pure\nDairy’s M2 Industry Park site will include a 137,000-sq.-ft. facility housing\nthe company’s manufacturing, R&D pilot plant, an innovation kitchen,\nwarehousing, logistics and the corporate office. Company officials said the\nplant will feature innovative automated equipment that will “guarantee lean\nmanufacturing and environmental sustainability to the highest accreditable\nglobal standards,” boost exports and contribute to economic growth. It is\nscheduled to open in early 2024. (Company reports)\n\nMichigan Milk Producers Association (MMPA) recently announced its investment in\nGoodSport Nutrition, a Chicago-based startup that makes a dairy-based sports\nhydration drink. GoodSport uses a nutrient-rich byproduct from ultra-filtered\nmilk processing to create the drink, called GoodSport, which the company says\ncontains three times the electrolytes and 33% less sugar than traditional sports\ndrinks. The dairy co-op and startup said their alliance aims to advance\ninnovation, highlight their commitment to sustainability in the dairy industry,\nand champion the benefits of milk as a natural, effective and sustainable source\nof sports nutrition. (Company reports)\n\nClingate Oy, a Finnish company that manages industrial infrastructure dedicated\nto precision fermentation, acquired a former Valio production facility in\nLappeenranta, Finland. The move will create what Clingate claims is the world’s\nlargest precision fermentation facility. The company is dedicating the 363,000\nsq. ft. plant to the advancement of biotechnology, with a focus on fostering\nresearch, development and production in precision fermentation and synthetic\nbiology. Clingate officials expect the acquisition to help establish the region\nas a hub for cutting-edge biotechnology development. The collaborative\necosystem, Clingate says, is “poised to reshape the landscape of precision\nfermentation and synthetic biology, unlocking unprecedented possibilities for a\nsustainable and thriving future.” Clingate is aiming for the facility to be\nfully operational by the second half of 2024. (Company reports)\n\nAustralian dairy co-op Norco reopened its Lismore, New South Wales, ice cream\nplant 18 months after a record flood destroyed the facility. The rebuilt plant,\nwhich sits in a floodplain, features improved flood mitigation features to\nhandle waters higher than those from 2022. The rebuild cost an estimated A$100\nmillion. (Rural News Group, 11/30/23; FoodProcessing.com.au, 11/28/23)\n\nDarigold CEO Joe Coote is stepping down to return with his family to his native\nAustralia. Coote joined the co-op three years ago as president of its\nInternational Ingredients division before taking over as CEO in January 2022.\nPrior to that, he worked for 12 years globally in the dairy sector. Allan\nHuttema takes over as interim CEO effective immediately. Huttema is one of\nDarigold’s 300 farmer-owners and has served on the board of directors for nine\nyears, the last three as chairman of the board. (Company reports)\n\nJapan’s Meiji Co. is building a new ¥48-billion (about US$330 million) dairy\nproduction facility in Nakashibetsu, Hokkaido. The plant will replace Meiji’s\nNishi Shunbetsu and Honbetsu facilities, producing the same products—nonfat dry\nmilk, concentrated skim milk, butter and cream—as well as milk protein. It will\nhandle 430,000 MT of raw milk per year, eventually increasing to half a million.\nConstruction is slated to begin in April 2024 with an estimated completion date\nof March 2027. (Just Food, 12/7/23)\n\nLactalis expects to invest €160 million (about US$173 million) in its Italian\noperations in 2023-2024. Nearly 90% of that investment will go toward\n“improvement, maintenance and modernization” of its 31 facilities in Italy. …\nDanone North America commenced work on a $65-million coffee and creamer\nproduction line at its plant in Jacksonville, Florida. … French dairy processor\nSODIAAL spent €10 million (about US$11 million) at its Le Mans, France, facility\nto install a new line to package Yoplait yogurt in brick packs. The company says\nthe new brick packaging is fully recyclable. (Just Food, 12/8/23; Jacksonville\nRecord, 12/7/23; edairy news, 11/30/23)\n\nAs part of their year-old partnership to help reduce on-farm emissions, Nestlé\nand New Zealand-based dairy cooperative Fonterra announced that the Swiss food\ngiant will fund additional payments to Fonterra farmers that meet certain\nsustainability requirements. Under the new agreement, Nestlé will pay farmers\nfor achieving one of three levels of Fonterra’s The Co-operative Difference\nframework in the 2023/24 season. The framework lays out key farming and business\npractices related to quality, safety and sustainability, and rewards farmers\nthat meet criteria across five focus areas: environment, animals, people and\ncommunity, milk, and co-op and prosperity. Depending on the number of farmers\nachieving these levels, Fonterra estimates the additional payment will be about\n1-2 New Zealand cents per KgMS. Nestlé New Zealand CEO Jennifer Chappell noted\nfarmers’ importance to the company’s success: “Nestlé has sourced dairy from New\nZealand for well over a hundred years and we will continue supporting farmers,\nalongside our partners, to develop new economic opportunities and reduce their\ngreenhouse gas emissions,” she said. (Company reports)\n\nKent Precision Foods Group, a division of Iowa-based Kent Corp., acquired\nAustralia’s Frosty Boy Global, a maker of powder-based products, including\ndesserts, beverages, savory ingredients, bakery products and wellness items. The\npurchase significantly expands Kent’s global footprint. (Company reports)\n\nAgropur named Maxime Devourdy president of Ingredients and Corporate Strategy.\nDevourdy most recently served Agropur as vice president, Corporate Development\nand Sustainable Growth Strategy. He replaces Dan LaMarche who is retiring after\nmore than three decades with the company. … China’s Mengniu Dairy reportedly\nsigned a strategic cooperation contract with restaurant group Yum China. The two\ncompanies plan to work together on resource sharing, new product innovation,\nsupply chain, and environmental, social and corporate governance (ESG)\nconsiderations. From its five business units—ambient products, chilled products,\nfresh milk, desserts and Western cuisine—Mengniu plans to provide dairy\nsolutions to Yum. … Separately, Yum celebrated the opening of its 10,000th KFC\nunit in China. The company added more than 1,150 in the first three quarters of\n2023. … Dutch dairy co-op FrieslandCampina is cutting more than 1,800 jobs over\nthe next two years as part of its “Expedition 2030” effort to slash by €400\nmillion-€500 million per year by 2026 onward. The job cuts will come from\n“almost all parts of the organization.” (USDEC China office; Company reports;\nDairy Processing, 12/15/23)\n\nSource",
        "summary": "The U.S. Dairy Export Council releases its 2023 Global Dairy Business Year-in-Review. The review highlights the important mergers, key acquisitions, joint ventures, newFacilities, executive hires and marketing initiatives that made 2023 a noteworthy year for dairy business.",
        "source": "DairyNews",
        "sentiment": 0.36121106147766113,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-05-03",
        "title": "Investors lap up China Feihe despite declining profits and revenue - Bamboo Works - Where China Stocks meet global investors",
        "link": "https://thebambooworks.com/investors-lap-up-china-feihe-despite-declining-profits-and-revenue/",
        "content": "The premium infant formula maker is taking a hit from China’s low birth rate,\nbut investors may like its dividends and transition to other dairy products\n\nKEY TAKEAWAYS:\n\n * China Feihe posted declines in both profits and sales last year, as it is\n   heavily exposed to the country’s falling birth rate\n * The company, which gets 91% of its revenue from infant milk formula, may\n   remain attractive to investors due to its pledge to pay much of its profits\n   as dividends\n\nBy Edith Terry\n\nChina Feihe Ltd.’s (6186.HK) 2023 year-end results, announced last week, were\ndismal enough to leave investors crying over plenty of spilled milk. The infant\nformula maker’s annual revenue sank 8.3% year-on-year to 19.5 billion yuan\n($2.69 billion), and its profit fell by an even larger 33.5% to 3.3 billion\nyuan. But rather than cry, investors applauded the results with a rise of over\n9% in the company’s stock. So, what do they see in this homegrown infant powder\nstar?\n\nOne answer is the healthy dividends it is spinning off. It paid an interim\ndividend amounting to 1.1 billion yuan last September, equal to 30% of profits.\nAnd in its latest results announcement, it promised to return another 40% of its\nprofit in a dividend whose amount will be determined and approved at its annual\nmeeting.\n\nSuch dividend payments are a popular strategy for attracting investors by\nconsumer stocks like Feihe, which tend to soak up plenty of revenue but whose\nslower growth stories tend to be less attractive than sexier companies from\nsectors like tech and new energy.\n\nDividends aside, Feihe’s latest results offer clues that the company may be\nworking hard to diversify beyond its core infant formula into powdered milk for\nchildren and adults, as well as new milk products with better growth potential.\nAnd it has 10.5 billion yuan in cash to cushion it through any transition. While\nits sales of infant milk formula products fell 10.3% to 17.8 billion last year,\nsales of its “other dairy products” actually rose by 23.4%.\n\nInfant milk formula makes up 91.5% of Feihe’s revenue, with “other” dairy\nproducts, such as adult milk powder, liquid milk and rice powder supplements,\naccounting for a far smaller but faster-growing 7.3%. The shift to those other\ngroups looks like a positive trend in the face of demographic inevitability with\nChina’s plunging birth rate.\n\nA total of 9.02 million babies were born in the country last year, the lowest\nnumber since the founding of the People’s Republic in 1949 and the second year\nof sharp declines. In addition to falling birth rates, companies like Feihe are\nalso facing the challenge of recently overhauled government regulations on\ninfant milk powder quality that some are calling the toughest in the world.\n\nThe objective is to set standards as close as possible to breast milk. The\ntoughness is also partly in response to a 2008 scandal where six infants died\nand another 300,000 fell ill after drinking infant formula spiked with melamine,\na toxic chemical that some producers used to boost their scores in milk protein\ntests.\n\nMany of the 400 brands in the market before the new regulations have now left,\nand remaining players have had to re-certify their products. The market\nturbulence forced at least one major international player, Nestlé (NESN.SW), to\nclose a baby milk factory in Ireland last October that produced milk solely for\nthe Chinese market.\n\nFALLING MARGINS\n\nOther metrics for China Feihe’s 2023 fiscal year were equally dismal as its top-\nand bottom-line numbers. Its gross profit margin fell to 64.8% from 65.5% in\n2022. And 2022’s results were nothing to get excited about either, with revenue\nand profit down 6.4% and 28.4% from 2021 levels, respectively.\n\nThe company’s 2021 annual report, whose cover featured a gold star and a can of\nmilk powder, included the last time revenue increased, rising 22.5% to 22.7\nbillion yuan. But even in the peak year of 2021, profit was down by 7%.\n\nThe year 2021 was also when China officially adopted its “three-child” policy,\nraising the permissible number of children to three from the previous two. In\n2016 the government abandoned its decades-old “one child” policy that imposed\nfines and other restrictions on couples who went beyond the limit. Feihe’s\nshares were hitting record highs around that time, rising to more than three\ntimes their IPO price of HK$7.50 from 2019, as investors bet it could become a\nbig beneficiary of the government’s call for people to have more children.\n\nBut the policy changes have failed to have the desired effects of improving\nbirth rates, with many people citing the high cost of raising children as a\nmajor deterrent. Feihe’s shares sagged as its revenue began contracting with the\nfalling birth rates, and its current share price is now about half its IPO\nprice.\n\nFeihe’s stock certainly isn’t alone in feeling the shrinking pains of China’s\ndeclining fertility rates. Shares of leading dairy Yili Industrial (600887.SS)\nalso peaked in 2021 before falling. But unlike Feihe, Yili’s top and bottom\nlines have both been rising since 2020. The same is true for Mengniu Dairy\n(2319.HK), whose shares also peaked in 2021, but whose revenue and profit\ncontinue to rise. Mengniu subsidiary China Modern Dairy (1117.HK) has similar\nstock trends, but has recorded falling profits despite growing revenue.\n\nThose differences might imply that the regulatory change has favored older\nplayers like Mengniu and Yili with closer state ties, at the expense of newer\ncompanies like Feihei and Modern Dairy. Feihe’s heavy reliance on infant formula\nis also working against it, while its peers have more diverse product lines. Its\nrecent diversification moves are aimed at weaning it from overreliance on the\ninfant market, but the transition is taking time.\n\nAll those differences show up in Feihe’s price-to-earnings (P/E) ratio, which is\nmarkedly lower than the other three companies. Its stock currently trades at a\nratio of 7.4, compared with 13 and 17 for Mengniu and Yili, respectively. China\nModern Dairy trades at the highest ratio of 33.\n\nThe strong market reaction to Feihe’s latest earnings could partly reflect the\nstock’s current low valuation as well as enthusiasm about the company’s dividend\npolicy. Investors may also like Feihe for its position in the relatively\nrecession-proof consumer space, which should help to stabilize its revenue even\nas people cut back on spending in more discretionary areas in the current\nclimate of economic uncertainty.\n\nTo subscribe to Bamboo Works free weekly newsletter, click here\n\n\nRELATED ARTICLES\n\n\n\n",
        "summary": "China Feihe posted declines in both profits and sales last year, as it is heavily exposed to the country’s falling birth rate. The company, which gets 91% of its revenue from infant milk formula, may remain attractive to investors due to its pledge to pay much of its profits as dividends.",
        "source": "Bamboo Works",
        "sentiment": -0.8237882852554321,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-04-15",
        "title": "China Mengniu Dairy Company Limited's (HKG:2319) Fundamentals Look Pretty Strong: Could The Market Be Wrong About The Stock?",
        "link": "https://simplywall.st/stocks/hk/food-beverage-tobacco/hkg-2319/china-mengniu-dairy-shares/news/china-mengniu-dairy-company-limiteds-hkg2319-fundamentals-lo",
        "content": "With its stock down 18% over the past month, it is easy to disregard China\nMengniu Dairy (HKG:2319). But if you pay close attention, you might find that\nits key financial indicators look quite decent, which could mean that the stock\ncould potentially rise in the long-term given how markets usually reward more\nresilient long-term fundamentals. Specifically, we decided to study China\nMengniu Dairy's ROE in this article.\n\nReturn on equity or ROE is a key measure used to assess how efficiently a\ncompany's management is utilizing the company's capital. Simply put, it is used\nto assess the profitability of a company in relation to its equity capital.\n\nCheck out our latest analysis for China Mengniu Dairy\n\n\nHOW IS ROE CALCULATED?\n\nThe formula for ROE is:\n\nReturn on Equity = Net Profit (from continuing operations) ÷ Shareholders'\nEquity\n\nSo, based on the above formula, the ROE for China Mengniu Dairy is:\n\n9.6% = CN¥4.9b ÷ CN¥51b (Based on the trailing twelve months to December 2023).\n\nThe 'return' is the yearly profit. So, this means that for every HK$1 of its\nshareholder's investments, the company generates a profit of HK$0.10.\n\n\nWHAT HAS ROE GOT TO DO WITH EARNINGS GROWTH?\n\nThus far, we have learned that ROE measures how efficiently a company is\ngenerating its profits. We now need to evaluate how much profit the company\nreinvests or \"retains\" for future growth which then gives us an idea about the\ngrowth potential of the company. Generally speaking, other things being equal,\nfirms with a high return on equity and profit retention, have a higher growth\nrate than firms that don’t share these attributes.\n\n\nCHINA MENGNIU DAIRY'S EARNINGS GROWTH AND 9.6% ROE\n\nOn the face of it, China Mengniu Dairy's ROE is not much to talk about. However,\nits ROE is similar to the industry average of 8.7%, so we won't completely\ndismiss the company. Having said that, China Mengniu Dairy has shown a modest\nnet income growth of 9.8% over the past five years. Given the slightly low ROE,\nit is likely that there could be some other aspects that are driving this\ngrowth. For instance, the company has a low payout ratio or is being managed\nefficiently.\n\nAs a next step, we compared China Mengniu Dairy's net income growth with the\nindustry, and pleasingly, we found that the growth seen by the company is higher\nthan the average industry growth of 0.7%.\n\nSEHK:2319 Past Earnings Growth April 15th 2024\n\nThe basis for attaching value to a company is, to a great extent, tied to its\nearnings growth. It’s important for an investor to know whether the market has\npriced in the company's expected earnings growth (or decline). By doing so, they\nwill have an idea if the stock is headed into clear blue waters or if swampy\nwaters await. If you're wondering about China Mengniu Dairy's's valuation, check\nout this gauge of its price-to-earnings ratio, as compared to its industry.\n\n\nIS CHINA MENGNIU DAIRY MAKING EFFICIENT USE OF ITS PROFITS?\n\nChina Mengniu Dairy has a healthy combination of a moderate three-year median\npayout ratio of 29% (or a retention ratio of 71%) and a respectable amount of\ngrowth in earnings as we saw above, meaning that the company has been making\nefficient use of its profits.\n\nBesides, China Mengniu Dairy has been paying dividends for at least ten years or\nmore. This shows that the company is committed to sharing profits with its\nshareholders. Our latest analyst data shows that the future payout ratio of the\ncompany is expected to rise to 43% over the next three years. Still, forecasts\nsuggest that China Mengniu Dairy's future ROE will rise to 12% even though the\nthe company's payout ratio is expected to rise. We presume that there could some\nother characteristics of the business that could be driving the anticipated\ngrowth in the company's ROE.\n\n\nSUMMARY\n\nOverall, we feel that China Mengniu Dairy certainly does have some positive\nfactors to consider. Despite its low rate of return, the fact that the company\nreinvests a very high portion of its profits into its business, no doubt\ncontributed to its high earnings growth. We also studied the latest analyst\nforecasts and found that the company's earnings growth is expected be similar to\nits current growth rate. To know more about the company's future earnings growth\nforecasts take a look at this free report on analyst forecasts for the company\nto find out more.\n\n\nVALUATION IS COMPLEX, BUT WE'RE HELPING MAKE IT SIMPLE.\n\nFind out whether China Mengniu Dairy is potentially over or undervalued by\nchecking out our comprehensive analysis, which includes fair value estimates,\nrisks and warnings, dividends, insider transactions and financial health.\n\nView the Free Analysis\n\nHave feedback on this article? Concerned about the content? Get in touch with us\ndirectly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based\non historical data and analyst forecasts only using an unbiased methodology and\nour articles are not intended to be financial advice. It does not constitute a\nrecommendation to buy or sell any stock, and does not take account of your\nobjectives, or your financial situation. We aim to bring you long-term focused\nanalysis driven by fundamental data. Note that our analysis may not factor in\nthe latest price-sensitive company announcements or qualitative material. Simply\nWall St has no position in any stocks mentioned.",
        "summary": "China Mengniu Dairy (HKG:2319) has a 9.6% return on equity (ROE) ROE is a key measure used to assess how efficiently a company's management is utilizing the company's capital. The company has shown a modestnet income growth of 9.8% over the past five years. Despite its low ROE, the company does have some positivefactors to consider.",
        "source": "Simply Wall Street",
        "sentiment": 0.2743578180670738,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-06-26",
        "title": "<Full-day Takeaway>HSI Closes at 18,072, Up 45 pts; HSTI Closes at 3,655, Down 22 pts; MENGNIU DAIRY Up over 4%; EB ENVIRONMENT, CHINA POWER Hit New Highs",
        "link": "http://www.aastocks.com/en/stocks/news/aafn-news/NOW.1358988/3",
        "content": "At close, HSI rose 45 pts or 0.3% to 18,072. HSTI dropped 22 pts or 0.6% to\n3,655. HSCEI gained 23 pts or 0.4% to 6,464. Market turnover reached $93.74\nbillion.\n\nActive Heavyweights:\nMEITUAN (03690.HK)  +2.300 (+1.957%)    Short selling $288.94M; Ratio 24.874%  \nclosed at $116.8, up 1.2%\nPING AN (02318.HK)  +0.200 (+0.587%)    Short selling $211.91M; Ratio 17.905%  \nclosed at $37.1, up 1.1%\nHKEX (00388.HK)  +1.400 (+0.579%)    Short selling $129.59M; Ratio 25.264%  \nclosed at $255.4, down 0.9%\nBABA (09988.HK)  +1.200 (+1.589%)    Short selling $312.79M; Ratio 20.230%  \nclosed at $72.65, up 0.8%\nAIA (01299.HK)  +1.000 (+1.866%)    Short selling $47.20M; Ratio 11.980%  \nclosed at $55, down 0.8%\nTENCENT (00700.HK)  -4.400 (-1.164%)    Short selling $1.13B; Ratio 19.315%  \nclosed at $382, up 0.4%\nCCB (00939.HK)  -0.010 (-0.183%)    Short selling $243.50M; Ratio 35.072%  \nclosed at $5.8, up 0.3%\n\nHSI & HSCEI Constituents on Move:\nMENGNIU DAIRY (02319.HK)  +0.800 (+5.556%)    Short\nselling $50.28M; Ratio 21.123%   closed at $13.94, up 4.5%\nSMIC (00981.HK)  -0.140 (-0.773%)    Short selling $30.84M; Ratio 12.262%  \nclosed at $17.2, down 4.3%\nHANSOH PHARMA (03692.HK)  +0.740 (+4.485%)    Short\nselling $9.35M; Ratio 28.656%   closed at $16.72, up 4.2%\nALI HEALTH (00241.HK)  +0.290 (+9.206%)    Short\nselling $34.88M; Ratio 22.659%   closed at $3.32, down 3.8%\nSUNNY OPTICAL (02382.HK)  -1.500 (-2.868%)    Short\nselling $100.80M; Ratio 16.350%   closed at $47.55, down 3.5%\nLENOVO GROUP (00992.HK)  -0.020 (-0.186%)    Short\nselling $67.09M; Ratio 37.337%   closed at $11.28, down 3.1%\n\nHSMI & HSSI Constituents on Move:\nKINGKEY FIN INT (01468.HK)  +0.001 (+1.111%)   closed at $0.152, down 12.1%\nUNITEDENERGY GP (00467.HK)  +0.010 (+3.077%)    Short\nselling $3.42M; Ratio 4.666%   closed at $0.415, up 10.7%\nEB ENVIRONMENT (00257.HK)  -0.030 (-0.852%)    Short\nselling $17.73M; Ratio 11.904%   closed at $3.89, up 2.1%, hitting new high\nCHINA POWER (02380.HK)  -0.130 (-3.476%)    Short selling $5.57M; Ratio 8.579%  \nclosed at $4.02, up 1.8%, hitting new high\n(HK stocks quote is delayed for at least 15 mins.Short Selling Data as at\n2024-07-17 12:25.)\n\nAAStocks Financial News",
        "summary": "At close, HSI rose 45 pts or 0.3% to 18,072. HSTI dropped 22 pts or0.6% to 3,655. HSCEI gained 23 pts or 1.4% to 6,464. Market turnover reached $93.74billion.",
        "source": "AASTOCKS.com",
        "sentiment": -0.4389238953590393,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-06-26",
        "title": "<Midday Takeaway>HSI Closes Midday at 18,109, Up 81 pts; HSTI Closes Midday at 3,668, Down 9 pts; MENGNIU DAIRY Up over 4%; EB ENVIRONMENT, CHINA POWER Hit New Highs",
        "link": "http://www.aastocks.com/en/stocks/news/aafn-news/NOW.1358914/2",
        "content": "At midday close, HSI rose 81 pts or 0.5% to 18,109. HSTI dropped 9 pts or 0.3%\nto 3,668. HSCEI gained 34 pts or 0.5% to 6,475.\n\nActive Heavyweights:\nMEITUAN (03690.HK)  +2.300 (+1.957%)    Short selling $288.94M; Ratio 24.874%  \nclosed at $118.1, up 2.3%\nTENCENT (00700.HK)  -4.400 (-1.164%)    Short selling $1.13B; Ratio 19.315%  \nclosed at $383.6, up 0.8%\nBABA (09988.HK)  +1.150 (+1.523%)    Short selling $312.79M; Ratio 20.230%  \nclosed at $72.65, up 0.8%\nCCB (00939.HK)  -0.020 (-0.366%)    Short selling $243.50M; Ratio 35.072%  \nclosed at $5.82, up 0.7%\nPING AN (02318.HK)  +0.200 (+0.587%)    Short selling $211.91M; Ratio 17.905%  \nclosed at $36.9, up 0.5%\nAIA (01299.HK)  +1.000 (+1.866%)    Short selling $47.20M; Ratio 11.980%  \nclosed at $55.2, down 0.5%\n\nHSI & HSCEI Constituents on Move:\nMENGNIU DAIRY (02319.HK)  +0.800 (+5.556%)    Short\nselling $50.28M; Ratio 21.123%   closed at $13.88, up 4%\nHANSOH PHARMA (03692.HK)  +0.740 (+4.485%)    Short\nselling $9.35M; Ratio 28.656%   closed at $16.64, up 3.7%\nSMIC (00981.HK)  -0.160 (-0.884%)    Short selling $30.84M; Ratio 12.262%  \nclosed at $17.4, down 3.2%\nLENOVO GROUP (00992.HK)  -0.040 (-0.372%)    Short\nselling $67.09M; Ratio 37.337%   closed at $11.28, down 3.1%\n\nHSMI & HSSI Constituents on Move:\nHIGHTIDE-B (02511.HK)  +0.020 (+1.786%)   closed at $1.75, up 15.1%\nEB ENVIRONMENT (00257.HK)  -0.040 (-1.136%)    Short\nselling $17.73M; Ratio 11.904%   closed at $3.92, up 2.9%, hitting new high\nCHINA POWER (02380.HK)  -0.130 (-3.476%)    Short selling $5.57M; Ratio 8.579%  \nclosed at $4.01, up 1.5%, hitting new high\n(HK stocks quote is delayed for at least 15 mins.Short Selling Data as at\n2024-07-17 12:25.)\n\nAAStocks Financial News",
        "summary": "At midday close, HSI rose 81 pts or 0.5% to 18,109. HSTI dropped 9 pts or0.3% to 3,668. HSCEI gained 34 pts to 6,475.Active Heavyweights:MEITUAN (03690.HK)  +2.300 (+1.957%)    Short selling $288.94M; Ratio 24.874%  closed at $",
        "source": "AASTOCKS.com",
        "sentiment": 0.017131775617599487,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-06-26",
        "title": "＜H Shrs＞HSI Fades 3 pts as NTES, MENGNIU DAIRY Leap 4%; Lithium Stocks Rebound",
        "link": "http://www.aastocks.com/en/stocks/news/aafn-con/NOW.1359309/latest-news/AAFN",
        "content": "You expressly agree that the use of this app/website is at your sole risk.\n\nAASTOCKS.com Limited, HKEx Information Services Limited, China Investment\nInformation Services Limited, Shenzhen Securities Information Co. Ltd, Nasdaq,\nInc., their respective holding companies and/or any subsidiaries of such holding\ncompanies, their Sources and/or other third party data provider(s) endeavour to\nensure the accuracy and reliability of the Information provided but do not\nguarantee its accuracy or reliability and accept no liability (whether in tort\nor contract or otherwise) for any loss or damage arising from any inaccuracies\nor omissions.\n\nNeither AASTOCKS.com Limited, HKEx Information Services Limited, China\nInvestment Information Services Limited, Shenzhen Securities Information\nCo.Ltd., Nasdaq, Inc. nor their respective holding companies and/or any\nsubsidiaries of such holding companies nor their Sources and/or other third\nparty data provider(s) make any express or implied offers, representations or\nwarranties (including, without limitation, any warranty or merchantability or\nfitness for a particular purpose or use) regarding the Information.\n\nNeither AASTOCKS.com Limited, HKEx Information Services Limited, China\nInvestment Information Services Limited, Shenzhen Securities Information Co.\nLtd., Nasdaq, Inc. nor their respective holding companies and/or any\nsubsidiaries of such holding companies nor their Sources and/or other third\nparty data provider(s) will be liable to any Subscriber or any other party for\nany interruption, inaccuracy, error, or omission, regardless of cause, in the\nInformation or for any damages (whether direct or indirect, consequential,\npunitive, or exemplary) resulting from its use by any party.\n\nAASTOCKS.com Limited shall not be liable for any failure or delay in performance\nof its obligations under this Disclaimer because of circumstances beyond its\nreasonable control, including but without limitation, acts of God, typhoons,\nrainstorms, other natural disasters, government restrictions, strikes, wars,\nvirus outbreak, network failures or telecommunications failures.\n\nMorningstar Disclaimer: Copyright © 2020 Morningstar, Inc. All Rights Reserved.\nThe information, data, analyses and opinions (\"Information\") contained herein:\n(1) include the proprietary information of Morningstar and Morningstar’s third\nparty licensors; (2) may not be copied or redistributed except as specifically\nauthorised; (3) do not constitute investment advice; (4) are provided solely for\ninformational purposes; and (5) are not warranted to be complete, accurate or\ntimely. Morningstar is not responsible for any trading decisions, damages or\nother losses related to the Information or its use. Please verify all of the\nInformation before using it and don’t make any investment decision except upon\nthe advice of a professional financial adviser. Past performance is no guarantee\nof future results. The value and income derived from investments may go down as\nwell as up.\n\nThe information and contents contained in this app/website are based on the\nanalyses and interpretations of publicly available information obtained from\nsources believed to be reliable. Such analyses and information have not been\nindependently verified and AASTOCKS.com Limited makes no guarantees to their\naccuracy, completeness, timeliness or correctness.\n\nThe information, financial market data, quotes, charts, statistics, exchange\nrate, news, research, analysis, buy and sell ratings, Education Center and other\ninformation on this app/website should be used as references only at your own\ndiscretion. Prior to the execution of a security or any other trade based upon\nthe Information, you are advised to consult independent professional advice to\nverify pricing information or to obtain more detailed market information.\nAASTOCKS.com Limited is not soliciting any subscriber or app/website visitor to\nexecute any trade. Any trades executed following the said information,\ncommentaries and/or buy/sell ratings on this app/website are taken at your own\nrisk for your own account.\n\nAASTOCKS.com Limited provides the information and services on an \"AS IS\" basis.\nThe information and contents on this app/website are subject to change without\nnotice. AASTOCKS.com Limited reserves the right, in its sole discretion but\nwithout any obligation, to make improvements to, or correct any error or\nomissions in any portion of this app/website at any time.\n\nThe subscriber or app/website visitor agrees not to reproduce, retransmit,\ndisseminate, distribute, broadcast, publish, circulate, sell or commercially\nexploit the information and contents on this app/website in any manner without\nthe express written consent of AASTOCKS.com Limited.\n\nInvestment involves risk. You may make use of the Education Center of this\nwebsite for academic reference purposes at your own discretion. AASTOCKS.com\nLimited cannot and does not give any assurance that the present or future\nbuy/sell commentaries and signals on this app/website will be profitable.\nAASTOCKS.com Limited cannot guarantee, and the subscriber or app/website visitor\nshould not assume, that the future performance will equal past performance.\n\nAASTOCKS.com Limited may point to other sites that may be of interest to the\nsubscriber or app/website visitor but for which AASTOCKS.com Limited has no\nresponsibility and only provides this as a service to the subscriber or\napp/website visitor.\n\nAASTOCKS.com Limited does not represent or endorse the accuracy or reliability\nof any information, advertisements or contents contained on, distributed\nthrough, or linked, downloaded or accessed from any of the services on this\napp/website. AASTOCKS.com Limited cannot and does not guarantee the quality or\nreliability of any products or information purchased or obtained by you as a\nresult of an advertisement or any other information displayed on this\napp/website.\n\nAATV is a video platform owned by AASTOCKS.com Limited.\n\nYou acknowledge that: (i) AATV is provided for information purposes only and, in\nparticular, is not intended for trading purposes; (ii) AATV does not and none of\nthe information contained in its program constitutes a solicitation, offer,\nopinion, or recommendation by us to buy or sell any security, or to provide\nlegal, tax, accounting, or investment advice or services whether or not\nregarding the profitability or suitability of any security or investment; and\n(iii) AATV is not intended for use by, or distribution to, any person or entity\nin any jurisdiction or country where such use or distribution would be contrary\nto law or regulation.\n\nThe financial analysis or opinion expressed in the AATV programs is for\nreference and discussion only, and does not represent AASTOCKS.com Limited.\nInvestors must make their own investment decisions based on their own investment\nobjectives and financial situation. AASTOCKS.com Limited shall not, directly or\nindirectly, be liable, in any way, to you or any other person for any: (i)\ninaccuracies or errors in or omissions from AATV including, but not limited to,\nquotes and financial data; (ii) delays, errors, or interruptions in the\ntransmission or delivery of AATV; or (iii) loss or damage arising therefrom or\noccasioned thereby, or by any reason of nonperformance.\n\nAASTOCKS.com Limited reserves the right to change this Disclaimer at any time by\nposting changes online at this app/website. You are responsible for reviewing\nregularly information posted therein to obtain timely notice of such changes.\nYour continued use of this app / website after changes are posted constitutes\nyour acceptance of this Agreement as modified by the posted changes.\n\nThe disclaimer herein shall be governed by the law of the Hong Kong Special\nAdministrative Region of the People's Republic of China (\"Hong Kong\") and you\nagree to submit to the exclusive jurisdiction of the Hong Kong courts.\n\nIn the event of any discrepancy between the Chinese and English versions, the\nEnglish version shall prevail.\n\nLast updated on 6 January 2023.",
        "summary": "You expressly agree that the use of this app/website is at your sole risk. AASTOCKS.com Limited does not guarantee the accuracy and reliability of the Information provided. The information, data, analyses and opinions (\"Information\") contained herein: include the proprietary information of Morningstar and Morningstar’s thirdparty licensors.",
        "source": "AASTOCKS.com",
        "sentiment": -0.06040775403380394,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-03-11",
        "title": "Lakeland Dairies appoints new chief financial officer - Agriland.co.uk",
        "link": "https://www.agriland.co.uk/farming-news/lakeland-dairies-appoints-new-chief-financial-officer/",
        "content": "Cross-border dairy cooperative Lakeland Dairies has appointed Oliver McAllister\nas its new chief financial officer (CFO).\n\nMcAllister has over 20 years’ experience in finance and strategy and has spent\nthe last decade in some of the largest agri-food companies on the island.\n\nHe departs his current role as CFO with veterinary pharmaceuticals company\nNorbrook and will join Lakeland Dairies where he will be a member of the co-op’s\nsenior leadership team.\n\n\nNEW CHIEF FINANCIAL OFFICER\n\nMcAllister started his career working on mergers and acquisitions with PwC\nbefore pursuing a path in the agri-food industry.\n\nPrior to his role at Norbrook, he was CFO at Dale Farm Ltd. and CFO at Foyle\nFood Group. According to Lakeland, during his tenure as CFO of these businesses,\nthey experienced significant growth with McAllister playing a key and strategic\nrole.\n\nWelcoming Oliver McAllister to Lakeland Dairies, group CEO Colin Kelly said: “In\nOliver, we have appointed a CFO with a tremendous track record of innovation,\nstrategic thinking, and business growth.\n\n> “He has a deep, intrinsic and invaluable understanding of the cooperative\n> sector as well as the wider agri-food industry.\n\n“We are at a hugely exciting time for Lakeland Dairies as we continue to execute\nour ambitious strategy ‘Foundations for a Better Future’.”\n\nKelly said the processor’s goal is to deliver “sustainable prosperity” for 3,200\nfarm families who supply the co-op.\n\n“Oliver’s vision, talent and acumen will ensure that we can realise the\nambitions of our strategy for the benefit of our farmers, our people, our\ncustomers and the communities we serve,” Kelly continued.\n\n\n‘EXCITED’ TO JOIN LAKELAND DAIRIES\n\nCommenting on his appointment with Lakeland Dairies, Oliver McAllister said:\n“I’m delighted to be joining my local dairy cooperative.\n\n> “The dairy industry and the wider cooperative movement play a hugely important\n> role in enhancing the lives of people and communities across rural Ireland,\n> and this is a contribution that I deeply value.\n\n“I’m excited to be joining Lakeland Dairies at such an important time for the\ncompany. I look forward to working collectively and collaboratively with all the\ngreat people throughout the cooperative to ensure we realise our new strategic\ndirection.”\n\nA native of Co. Antrim, Oliver McAllister holds a bachelor of science in finance\nfrom Queen’s University, Belfast.\n\nHe is a chartered accountant and is a fellow of the Institute of Chartered\nAccountants in Ireland. Oliver lives in Co. Fermanagh with his wife and three\ndaughters.",
        "summary": "Oliver McAllister has over 20 years’ experience in finance and strategy. He departs his current role as CFO with veterinary pharmaceuticals company Norbrook. He will join Lakeland Dairies as a member of the co-op’s senior leadership team.",
        "source": "Agriland.co.uk",
        "sentiment": 0.35058136098086834,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-01-24",
        "title": "Rollercoaster year for factory prices 24 January 2024 Free",
        "link": "https://www.farmersjournal.ie/agribusiness/news/rollercoaster-year-for-factory-prices-801370",
        "content": "No matter what the price of beef is, there is always a big range of prices paid\nbetween factories for the exact same type of animal. Based on average slaughter\nweights, up to €225 per head more was paid for R3 cows and €180 per head more\nfor O=3= steers between the highest- and lowest-paying factories that reported\nprices for at least 10 weeks last year. The smallest gap in prices paid was €71\nfor U=3= heifers.\n\nOne of the frequent warnings we give in presenting this data is to be conscious\nof how external factors may influence the prices paid. These include the likes\nof organic and speciality breeds for which factories pay a premium – if there\nare substantial numbers of these in a factory’s kill, then the prices they\nreport will be inflated. Similarly, some factories pay an extra bonus to attract\ncattle in a narrow weight range, which others buy off the grid, and deals at\nflat-rate prices will often reflect higher prices for lower grades and lower\nprices for the top grades.\n\nAnother variable that can distort the picture is the effect of a factory killing\na minuscule number of cattle over the year and if these were bought at either an\nexceptionally high or exceptionally low price, they won’t necessarily reflect\nthe mainstream value.\n\nTo address this, an extra column has been added to this year’s league tables\nidentifying the number of weeks in the year for which prices in each particular\ngrade for each factory were reported.\n\nMain findings\n\nThe categories chosen to reflect 2023 are four different grades from steers,\nheifers, young bulls and cows.\n\nThese are U=3=, R=3=, O=3= and P+ 3= giving 16 categories overall and cover the\nvast majority of cattle that are going through Irish factories.\n\nAll the factories that reported for 2022 are still reporting in 2023. Kavanagh\nMeats Enniscorthy started price reporting during 2023 but are excluded from the\nleagues as they don’t have a full year of data. Kildare Chilling is separate\nfrom the Dawn group because that deal was only concluded during the year.\n\nWhile factories outside the main groups claimed several podium positions, some\nof which were based on a small number of cattle reported, several of them\nincluding ABP, Dawn and Kepak occupied positions in top half of the table. (See\nbelow)\n\nFoyle may have had less podium positions than previous years but it was still\nthere or thereabouts and it is one of the factories that pays extra for a narrow\nweight range on steers and heifers.\n\nAshbourne pushed into the top three for O=3= steers and was a consistent buyer\nas it reported for 52 weeks in that category. It was second for P+3= young bulls\nthough with a small sample size.\n\nMoyvalley claimed a first and second place in P+3= and O=3= young bulls, while\nEurofarm was second for R=3= young bulls with Foyle top for the U=3= grade.\nLiffey claimed a third place finish in the P+3= young bull category.\n\nCows\n\nWhen it comes to cows, the top positions are dominated by factories outside the\nmain groups. C&J Meats is widely known as a strong buyer of top-quality cows and\nthis is reflected in the table where it occupies the top position for U=3= and\nR=3= cows and a second place for O=3= cows.\n\nThese are the best-quality suckler-bred cows and C&J reported on these for 46\nand 52 weeks for the U and R grading cows, respectively, in 2023.\n\nTraditional Meat Company took top position for the O=3= and P+3= cows, reporting\non 50 and 25 weeks, respectively, and a second place for the R=3= grade based on\n51 weeks reporting.\n\nLiffey is also a strong cow buyer and had two third places, with Dawn\nBallyhaunis and ABP Nenagh claiming one each.\n\nGroup performance\n\nABP has the edge on U=3= and R=3= steers and heifers though it is pipped by Dawn\nfor the O=3= grade, who are also top for the P+3= grade followed by Kepak with\nABP back in third.\n\nThe top positions are divided between the big three for young bulls but when it\ncomes to cows, when the factories outside the main groups are taken together,\nthey are the top-payers in all categories apart from P+3= grade. There were some\nexcellent cow prices paid in 2023 and this merits further analysis.\n\nFactory margins\n\nIrish beef processing is privately owned and there are no accounts published\nwith the exception of Foyle and C&J Meats whose businesses operate both sides of\nthe border and in the case of Foyle it has two abattoirs in Britain as well.\n\nDunbia, which is the UK division of Dawn Meats also publishes accounts and while\nthis is outside the Republic of Ireland, between them they will give an\nindication of the financial performance. As well as being a very limited sample,\nwe also have to note that in these cases accounts are for the 2022 financial\nyear.\n\n\n\nSuckler cows and calves.\n\n\n\nC&J has a factory outside Lifford in Co Donegal, a cutting plant in Co Armagh\nand is a stakeholder in an abattoir in Co Antrim. In the year to 30 November\n2022, it had a turnover of £69.1m (€80.3m), up from £58.9m (€68.5m) in 2021.\n\nOperating profit for the year was £727,025 (€845,377) and after interest and\ntaxation, profit for the year was £490,692 (€570,572). The breakdown of sales is\n£37m (€43m) to the UK with £32m (€37m) to Europe.\n\nDunbia, the UK division of Dawn Meats since 2020, also continues to publish\nannual accounts. It is headquartered in Dungannon Co Tyrone, where it has a beef\nand sheep abattoir, cutting plant and retail packing unit. Across the UK, it has\n13 locations and for 2022 posted a £1.37bn (€1.59bn) turnover with an operating\nprofit of £12.79m (€14.87m).\n\nThe Foyle Food Group has an abattoir and cutting plant located in Cargins, Co\nDonegal, and two in Northern Ireland at Lisahally, Co Derry, and Omagh, Co\nTyrone. It also has two factories in Britain. Turnover at the Foyle Food Group\nHoldings Ltd increased to £482m (€560.4m) in 2022, up from £410m (€476.7m) in\n2021 with operating profit at £12.9m (€15m) compared with £14.6m (€17m) the\nprevious year and net profits were £9.3m (€10.8m), down from £10.7m (€12.4m) in\n2021.\n\nNumbers useful for guidance and an indication of trends\n\nLooking at factory profit figures where they exist, profits that are stated in\nmultiple millions look spectacular. There is do doubt that a well-run beef\nprocessing business can be extremely profitable but when the numbers are\nanalysed in these examples, we can see that profit margins are running between\njust under 1% and 2.7%.\n\nQuestion\n\nThe other question that remains unanswered is how representative are these\nnumbers for beef processing in the Republic of Ireland?\n\nAll of the Dunbia business is UK-based as is the largest percentage of the Foyle\nbusiness and the C&J business has a significant contribution from northern\ncattle, as well as from its Donegal factory. As with the factory league tables\nfor cattle prices, these numbers are useful for guidance and an indication of\ntrends.",
        "summary": "Up to €225 per head more was paid for R3 cows than O=3 cows. The smallest gap in prices paid was €71 per head for U=3= heifers. C&J Meats is widely known as a strong buyer of top-quality cows.",
        "source": "Irish Farmers journal",
        "sentiment": -0.2126430794596672,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-07-15",
        "title": "Foyle farm suckler herd trials 'virtual fencing' for hill grazing - Agriland.ie",
        "link": "https://www.agriland.ie/farming-news/foyle-farm-suckler-herd-trials-virtual-fencing-for-hill-grazing/",
        "content": "The suckler herd involved in the trial\n\nFoyle Food Group’s ‘Farms of Excellence’ in Co. Tyrone has partnered with a\nNorwegian-based agri-tech company in a new hill-farm grazing trial.\n\nThe trial is set to examine how ‘virtual fencing’ can optimise the grazing\nmanagement of a suckler herd in a hill farm setting.\n\nSpeaking to Agriland, Foyle Food Group’s Andrew Clarke explained what the\nresearch hopes to achieve.\n\nHe explained that the project is being initially trialled on 26 cows and a\nbreeding bull. No collars are placed on the calves.\n\nThe trial will examine how effective the virtual fencing is in the hill\nlandscape where phone signal is poor.\n\nInitial indications are showing the virtual fence is effective despite the low\nsignal in the region and the farm has plans to expand the project to more cattle\nin the near future.\n\nClarke added that the ‘virtual fence’ is essentially a collar that is placed on\nthe livestock. A phone app shows the farmer where the cattle are located.\n\nL-r: Foyle Food Group’s Andrew Clarke, Ann Elinor Aasen from Monel, Wayne\nAcheson from Foyle Food Group and Christoffer Grindheim from Monel\n\n“I’m sitting here in the office and if I want to give the cattle grazing on the\nhill a fresh area to graze, I can use the technology to create a bigger grazing\nzone for the cattle to make their way into.\n\n> “It’s free entry for the cattle to get into the zone but once they try to go\n> out of the zone they hear a noise and they get that noise three times and then\n> it goes to a shock.\n\n“There’s a solar panel on the collars. They’re charged up at the start of the\nyear and the solar panel will keep them charged for the rest of the season.\n\n“The phone app will tell you what each collar battery is and if you have a\ncollar not working or the battery’s not charging, it will let you know,” he\noutlined.\n\nThe collars were fitted last week and have been “working well” on the herd so\nfar, according to the Foyle representative.\n\nWilson Marshall from the Foyle Food Group agri-team (left) pictured with Monil\nstaff\n\nClarke said: “There’s two reasons we wanted to trial the collars. Firstly, we\nwant to better manage the grazing of the cattle on the hill.\n\n“We want to bring the cattle to graze areas of the hill where they wouldn’t\nnormally go as a group.\n\n> “Secondly, whenever we’re serving cows with a bull on the hill, sometimes the\n> cows could be on one end of the hill and the bull could be on the other. The\n> cow could be cycling and the bull would never see her within 24 hours.\n\n“The aim of the virtual fencing is to keep the livestock batched and moved\nacross the hill. We hope to be able to basically rotationally graze the hill.\nThat’s what were trying to achieve.”\n\nThe fence can be managed from a smartphone\n\nThe Norwegian-based company involved in the trial with Foyle is ‘Monil’.\n\nAccording to their website, Monil is “a startup [business] challenging\ntraditional fences with our innovative virtual fencing technology, allowing\nanimals to roam freely while giving farmers complete control over their herd’s\nlocation and well-being”.\n\n\nFOYLE FARM\n\nFoyle Food Group’s ‘Farms of Excellence’ is located in Co. Tyrone and the\noverall farming operation encompasses 1,100ac of land. 570ac of this is\nmountain-type ground, 250ac is lowland grazing and the rest is lowland silage\nground.\n\nThe farm is continuously conducting research and trials with the aim of\nproviding practical and up-to-date information to Foyle’s beef suppliers on ways\nto further improve the economic and environmental sustainability of their farms.\n\nSome of the areas on which the farm is currently conducting research includes\nbest practice on grassland management, soil health, animal nutrition, and\nbedding for livestock.\n\nMore information on the farm can be found here.",
        "summary": "Foyle Food Group’s ‘Farms of Excellence’ in Co. Tyrone has partnered with aNorwegian-based agri-tech company in a new hill-farm grazing trial. The trial is set to examine how ‘virtual fencing’ can optimise the grazing of a suckler herd in a hill farm setting.",
        "source": "Agriland",
        "sentiment": 0.06555285304784775,
        "keywords": [],
        "categories": [],
        "image": null
    },
    {
        "publication_date": "2024-01-13",
        "title": "Innovative technologies used by leading beef company",
        "link": "https://www.impartialreporter.com/news/24044770.fermanagh-grassland-club-meeting-announces-new-officers/",
        "content": "Fermanagh Grassland Club has a new Chairman for 2024 – Robin Clements, a dairy\nfarmer from Trillick, who has been Vice-Chairman for the past year.\n\nRobin succeeds Roly Graham, who ended his term as Chairman at the annual meeting\nin mid-December.\n\nFollowing the various reports from the Club Secretary, William Johnston;\nTreasurer, Philip Clarke and Chairman Roly Graham, all positions were declared\nvacant, and the guest speaker at the meeting, Andrew Clarke from the Foyle Food\nGroup, conducted the election of officers as follows:\n\nChairman: Robin Clements;\n\nVice-Chairman: Alan Burleigh;\n\nSecretary: William Johnston;\n\nTreasurer: Philip Clarke; and\n\nCommittee members: Chairman and John Egerton, Trevor Dunn, Alan Warnock, James\nMurphy, Nigel Graham and David Foster.\n\nThe main focus of the meeting was new technologies for beef, with a talk\npresented by Andrew Clarke from Foyle Group.\n\nAlso attending was Wayne Acheson, Procurement Director, Foyle Group.\n\nAndrew, who is Agricultural Manager, outlined the remit of the Group, which was\nestablished by the Acheson family in 1977 with four divisions: primary, further\nprocessing, proteins and eco.\n\nThey now operate from five sites and eight business units across the UK and\nIreland with a total of 1,150 employees, with a throughput of 7,000 cattle a\nweek.\n\nThe Foyle Group was the first of the meat plants to DNA test all cattle\nindependently following the horsegate scandal.\n\nThe group specialises in slaughtering, deboning, further processing and\nrendering, supplying the retail market, food service and butchery sectors.\n\nThey have already set an agriculture decarbonisation road map to 2030 focusing\non three main areas of animal health and nutrition, environment and genetics.\n\nThe group already works with farmers through knowledge transfer groups as well\nas best practice farms, site visits and through communications and through four\nproducer clubs: Foyle Valley, Donegal Direct, Severn Vale and Melton Moubray.\n\nAndrew explained how their hill farm, grassland farm and finishing farm all have\nprojects and targets with the aim of improving farm performance.\n\nThe hill farm is stocked with Galloway/Blue Grey crosses using the top one per\ncent of genetics, with the AA cross calves outwintered on the hill, and progeny\nfinishing at 19 months at an average 354kgs carcase weight highlighting the\nbenefits of genetics.\n\nOn the finishing farm, 100 cattle a week are brought in to replace the same\nnumber of finished cattle, where they are subject to various feeding and housing\ntrials.\n\nThey are currently experimenting with composted material for bedding as well as\nhousing design.\n\nAn innovative handling facility includes a double race.\n\nAn extensive area of the grassland farm is planted in multi-species swards.\n\nOther ideas used are in regenerative agriculture, adopting foliar feeding using\nTow and Fert machines, resulting in a 50 per cent reduction in nitrogen applied.",
        "summary": "Robin Clements succeeds Roly Graham, who ended his term as Chairman at the annual meeting in mid-December. The main focus of the meeting was new technologies for beef, with a talk from Andrew Clarke from the Foyle Food Group. The group specialises in slaughtering, deboning, further processing andrendering.",
        "source": "Impartial Reporter",
        "sentiment": 0.05056098476052284,
        "keywords": [],
        "categories": [],
        "image": null
    }
]